# https://stepik.org/lesson/1653781/step/2?unit=1676563
# https://pvolgin-task.ru/15-2/
# (7)
"""
Напишите программу, которая в последовательности натуральных чисел определяет сумму чисел,
у которых последняя цифра четная и кратная 4, но число не оканчивается на 44.
Программа получает на вход количество чисел, а затем сами числа.
Программа должна вывести сумму чисел, у которых последняя цифра четная, кратная 4, но число не оканчивается на 44.
Если таких чисел нет, то программа должна вывести число «NO».
"""
sm = 0
for _ in range(int(input())):
    n = input()
    if n[-1] in '48' and n[-2:] != '44':
        sm += int(n)
if sm:
    print(sm)
else:
    print('NO')
"""
5
44
208
1010
256
149
>>>
208


4
16
444
202
400
>>>
NO

5
4
18
44
14
1000
>>>
36

0
>>>
NO

4
444
1000
4422
497
>>>
NO
"""


# https://stepik.org/lesson/1653781/step/5?unit=1676563
# https://pvolgin-task.ru/15-2/
# (9)
"""
Метеорологическая служба вела наблюдение за погодой в течение нескольких дней.
Напишите программу, которая определяет максимальную и минимальную температуру за время наблюдения.
На вход программе подается  количество дней наблюдения (натуральное число), а затем температуры воздуха за каждый день — целые числа.
Если температура опускалась ниже 0 градусов, то выведете «YES», иначе выведете «NO».
"""
max_n = -1000
min_n = 1000
for _ in range(int(input())):
    n = int(input())
    max_n = max(max_n, n)
    min_n = min(min_n, n)

print(max_n, min_n, sep='\n')
print(['NO', 'YES'][min_n < 0])
"""
4
0
-13
13
11
>>>
13
-13
YES

3
10
0
1
>>>
10
0
NO

1
0
>>>
0
0
NO

1
-1
>>>
-1
-1
YES


3
-40
+40
0
>>>
40
-40
YES
"""


# https://stepik.org/lesson/1653781/step/4?unit=1676563
# https://pvolgin-task.ru/15-2/
# (8)
"""
Напишите программу, которая в последовательности целых чисел определяет количество отрицательных нечетных (по модулю) чисел
и количество положительных чисел, которые не оканчиваются на 5.
Программа получает на вход количество чисел, а затем сами числа.
Программа должна вывести два числа: сначала количество отрицательных нечетных (по модулю) чисел,
а затем количество положительных чисел, которые не оканчиваются на 5.
Предполагается, что в последовательности всегда есть числа, удовлетворяющие двум условиям.
"""
cnt_neg = 0
cnt_pos = 0
for _ in range(int(input())):
    n = int(input())
    if n < 0 and abs(n) % 2:
        cnt_neg += 1
    elif n > 0 and n % 10 != 5:
        cnt_pos += 1

print(cnt_neg, cnt_pos, sep='\n')
"""
5
6
55
-7
78
-8
>>>
1
2

5
5
1
-9
75
-41
>>>
2
1

5
0
4
-9
75
-44
>>>
1
1

5
99
1
-11
75
-1
>>>
2
2

4
-55
101
-11
75
>>>
2
1
"""


# https://stepik.org/lesson/1653781/step/6?unit=1676563
# https://pvolgin-task.ru/15-2/
# (11)
"""
Напишите программу, которая в последовательности целых чисел определяет количество трехзначных чисел,
начинающихся и заканчивающихся на одну и ту же цифру и кратных 7.
Программа получает на вход натуральные числа, количество введённых чисел неизвестно,
последовательность чисел заканчивается числом 0 (0 – признак окончания ввода, не входит в последовательность).
Программа должна вывести одно число — количество трехзначных чисел,
начинающихся и заканчивающихся на одну и ту же цифру и кратных 7. Если таких чисел нет, то программа должна вывести число «NO».
"""
cnt = 0
n = int(input())
while n:
    if len(str(n)) == 3 and str(n)[0] == str(n)[-1] and not n % 7:
        cnt += 1
    n = int(input())

if cnt:
    print(cnt)
else:
    print('N0')
"""
161
101
105
49
0
>>>
1


349
700
484
14
0
>>>
NO


161
252
343
434
525
0
>>>
5


0
>>>
NO


343
434
525
595
616
686
707
777
868
959
0
>>>
10
"""

# https://stepik.org/lesson/1653781/step/3?unit=1676563
# https://pvolgin-task.ru/15-2/
# (15)
"""
Напишите программу, определяющая в последовательности натуральных чисел,
количество трехзначных чисел, у которых произведение цифр равно нулю, и которые делятся на 4.
Программа получает на вход количество чисел в последовательности, а затем сами числа.
Программа должна вывести одно число – количество трехзначных чисел,
у которых произведение цифр равно нулю, и которые делятся на 4.
"""
cnt = 0
for _ in range(int(input())):
    n = input()
    if len(n) == 3 and '0' in n and not int(n) % 4:
        cnt += 1
print(cnt)
"""
3
444
404
128
>>>
1

4
64
128
256
512
>>>
0

0
>>>
0

3
109
207
224
>>>
0

3
109
207
204
>>>
1
"""


# https://stepik.org/lesson/1653781/step/7?unit=1676563
# https://pvolgin-task.ru/15-2/
# (21)
"""
Напишите программу, которая в последовательности целых десятичных чисел определяет количество чисел,
которые в восьмеричной записи оканчиваются на 11.
Программа получает на вход количество чисел, а затем сами числа.
Программа должна вывести одно число – количество чисел, которые в восьмеричной записи оканчиваются на 11.
"""
d = [int(input()) for _ in range(int(input()))]
res = sum(1 for i in d if oct(i)[-2:] == '11')
print(res)

"""
3
137
65
265
>>>
2


4
73
234
329
417
>>>
2


4
165
111
587
711
>>>
0

4
9
137
201
521
>>>
4
"""



# https://stepik.org/lesson/1653781/step/8?unit=1676563
# https://pvolgin-task.ru/15-2/
# (3)
"""
Назовем трехзначное число подходящим, если его средняя цифра равна сумме первой и последней цифр.
Напишите программу, которая в последовательности целых чисел определяет максимальное число,
среди подходящих чисел или сообщает, что таких чисел нет (Выводит «NO»).
Программа получает на вход целые оложительнве числа, количество введённых чисел неизвестно,
последовательность чисел заканчивается числом 0
(0 – признак окончания ввода, не входит в последовательность).
Программа должна вывести максимальное число, среди трехзначных чисел,
у которых средняя цифра равна сумме первой и последней цифр.
"""

mx = 0
n = int(input())
while n:
    d = [int(i) for i in str(n)]
    if d[1] == d[0] + d[2]:
        mx = max(mx, n)
    n = int(input())

print(('NO', mx)[bool(mx)])


"""
947
421
777
264
891
0
>>>
891

581
252
987
180
0
>>>
NO


694
385
242
781
989
0
>>>
781


782
123
978
264
594
333
0
>>>
594

"""

