# https://pvolgin-task.ru/15-2/
# (43)
"""
Напишите программу, которая в последовательности целых чисел определяет произведение максимального и минимального чисел, оканчивающихся на 38 и являющихся четырехзначными числами.
Если таких чисел в последовательности нет, то программа должна вывести «NO». Если в последовательности только одно число или подходящие числа повторяются – программа должна вывести «0».
Программа получает на вход целые натуральные числа, количество введенных чисел неизвестно, последовательность чисел заканчивается числом 0 (0 – признак окончания ввода, не входит в последовательность).
Программа должна вывести одно число – произведение максимального и минимального чисел, оканчивающихся на 38 и являющихся четырехзначными числами, вывести произведение максимального и минимального чисел или вывести «NO».
"""
nums = set()
n = int(input())

while n:
    if len(str(n)) == 4 and str(n)[-2:] == '38':
        nums.add(n)
    n = int(input())

if not len(nums):
    print('NO')
elif len(nums) == 1:
    print(0)
else:
    print(min(nums) * max(nums))



"""
2938
134
1238
1038
238
123238
0
>>>
3049644


3883
4538
1388
4538
138
0
>>>
0


6583
838
12438
138
0
>>>
NO


36538
1138
1338
2138
0
>>>
2433044
"""


# https://pvolgin-task.ru/15-2/
# (43)
"""
Напишите программу, которая в последовательности натуральных чисел определяет произведение чисел, оканчивающихся на 44. В программе есть хотя бы одно число, удовлетворяющее условию задачи. Если таких чисел больше 2 или произведение больше 25000, то программа должна вывести «YES», иначе программа должна вывести «NO»
Программа получает на вход сначала количество чисел, а затем сами числа.
Программа должна вывести произведение чисел, оканчивающихся на 44, а затем «YES» или «NO».
"""
cnt = 0
res = 1
for _ in range(int(input())):
    n = input()
    if len(n) > 1 and n[-2:] == '44':
        cnt += 1
        res *= int(n)

if cnt > 2 or res > 25_000:
    print('YES')
else:
    print('NO')

"""
5
3445
244
44674
44
644
>>>
YES


1
4444
>>>
NO

4
25044
104
96447
4440
>>>
YES
"""

# https://pvolgin-task.ru/15-2/
# (40)
"""
Напишите программу, которая в последовательности натуральных чисел определяет максимальное число, кратное или оканчивающееся на однозначное или двузначное число D. В программе всегда есть хотя бы одно такое число. 
Программа получает на вход сначала число D, затем количество чисел в последовательности, а затем сами натуральные числа. 
Программа должна вывести одно число – максимальное число, кратное или оканчивающееся на однозначное или двузначное число D.
"""
d = input()
max_n = 0
for _ in range(int(input())):
    n = int(input())
    if not n % int(d) or str(n)[-len(d):] == d:
        max_n = max(max_n, n)

print(max_n)

"""
7
4
317
322
197
84
>>>
322

24
5
324
216
576
4224
4225
>>>
4224

87
1
87
>>>
87

49
1
343
>>>
343
"""


# https://pvolgin-task.ru/15-2/
# (44)
"""
 Напишите программу, которая в последовательности натуральных десятичных чисел определяет наибольший элемент, запись которого в системе счисления с основанием 5 оканчивается на 13. Если среди входных данных таких элементов нет, программа должна вывести «NO». Программа получает на вход количество чисел в последовательности, а затем сами числа.
 Программа должна вывести одно число – наибольший элемент последовательности, запись которого в системе счисления с основанием 5 оканчивается на 13 или вывести «NO», если таких элементов нет.
"""
max_n = 0
for _ in range(int(input())):
    n = int(input())
    tmp = n
    s = ''
    while tmp:
        s = str(tmp % 7) + s
        tmp //= 7
    if s[-2:] == '14':
        max_n = max(max_n, n)

if max_n:
    print(max_n)
else:
    print('NO')
# print(['NO', max_n][bool(max_n)])

"""
4
9
163
158
11
>>>
158


3
257
111
374
>>>
NO

4
699
550
60
501
>>>
550
"""


# https://pvolgin-task.ru/15-2/
# (12)
"""
Напишите программу, которая в последовательности натуральных чисел определяет сумму трехзначных чисел, кратных 79 или (кратных 7 и кратных 9).
Если таких чисел в последовательности нет, программа выводит максимальное число в последовательности.
Программа получает на вход количество чисел, а затем сами числа.
Программа должна вывести одно число — сумму чисел, кратных 79 или кратных 7 и 9, либо максимальное число в последовательности.
"""
sm = 0
max_n = 0
for i in range(int(input())):
    n = int(input())
    max_n = max(max_n, n)
    if len(str(n)) == 3 and (n % 79 == 0 or (n % 7 == 0 and n % 9 == 0)):
        sm += n

if sm:
    print(sm)
else:
    print(max_n)

"""
3
100
159
300
>>>
300


4
158
126
998
5
>>>
284


5
711
790
869
189
252
>>>
2811


4
633
442
505
554
>>>
633

5
29
0
99
1
34
>>>
99

"""

# https://pvolgin-task.ru/15-2/
# (14)
"""
Напишите программу, которая в последовательности натуральных чисел определяет целую часть среднего арифметического
всех чисел, кратных 4 и не кратных 6.
В последовательности всегда присутствует хотя бы одно такое число.
Если целая часть среднего арифметического оказалась четным числом, выведите «Yes», в противном случае выведите «No».
Программа получает на вход количество чисел в последовательности, а затем сами числа.
Программа должна вывести целую часть среднего арифметического чисел, кратных 4, но не кратных 6, и вывести слово «Yes»,
если целая часть среднего арифметического является четным числом или вывести «No» в противном случае.
"""
sm = 0
cnt = 0
for _ in range(int(input())):
    n = int(input())
    if not n % 4 and n % 6:
        sm += n
        cnt += 1
res = sm // cnt

print(res)
if not res % 2:
    print('YES')
else:
    print('NO')

"""
4
4
100
29
13
>>>
52
YES

3
127
40
31
>>>
32
YES


4
64
52
104
19
>>>
73
NO


4
80
88
81
89
>>>
84
YES

4
40
44
52
19
>>>
45
NO

1
100
>>>
100
YES

3
4
8
16
>>>
9
NO
"""


# https://pvolgin-task.ru/15-2/
# (16)
"""
Напишите программу, которая в последовательности многозначных натуральных чисел, определяет количество чисел,
у которых последняя цифра является максимальной четной цифрой в числе (большей, чем другие четные цифры).
Программа получает на вход количество чисел в последовательности, а затем сами числа.
Программа должна вывести одно число – количество чисел, у которых последняя цифра является максимальной четной цифрой в числе.
"""

cnt = 0
for _ in range(int(input())):
    n = int(input())
    if n >= 10 and not n % 2:
        ls = [int(i) for i in str(n // 10) if i in '02468']
        if ls and max(ls) < n % 10:
            cnt += 1
print(cnt)


"""
4
5769
12758
8
6008
>>>
2


4
5854
3574
44
9998
>>>
0

4
1748
246
24
206
>>>
4

4
83254
65734
70362
2064
>>>
4
"""
