# https://stepik.org/lesson/1653781/step/8?unit=1676563
# https://pvolgin-task.ru/15-2/
# (3)
"""
Назовем трехзначное число подходящим, если его средняя цифра равна сумме первой и последней цифр.
Напишите программу, которая в последовательности целых чисел определяет максимальное число,
среди подходящих чисел или сообщает, что таких чисел нет (Выводит «NO»).
Программа получает на вход целые оложительнве числа, количество введённых чисел неизвестно,
последовательность чисел заканчивается числом 0
(0 – признак окончания ввода, не входит в последовательность).
Программа должна вывести максимальное число, среди трехзначных чисел,
у которых средняя цифра равна сумме первой и последней цифр.
"""

mx = 0
n = int(input())
while n:
    d = [int(i) for i in str(n)]
    if d[1] == d[0] + d[2]:
        mx = max(mx, n)
    n = int(input())

print(('NO', mx)[bool(mx)])


"""
947
421
777
264
891
0
>>>
891

581
252
987
180
0
>>>
NO


694
385
242
781
989
0
>>>
781


782
123
978
264
594
333
0
>>>
594

"""
