""" Task 02 """


# https://stepik.org/lesson/2360652/step/1?unit=2396049
"""
https://stepik.org/lesson/563429/step/11?unit=557670

Логическая функция F задаётся выражением
(⌐x ∧ y ≡ z) ∧ w
На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z,w.
В ответе напишите буквы x, y, z, w в том порядке, в котором идут соответствующие им столбцы.
Буквы в ответе пишите подряд, никаких разделителей между буквами ставить не нужно.
"""
from itertools import *
def f(x,y,w,z):
 return ((not x and y) == z) and w

for m1,m2,m3,m4,m5,m6,m7,m8,m9,m10 in product((0,1), repeat=10):
    t = [(m1,0,m2,m3), (m4,m5,m6,0), (0,0,m7,m8), (0,0,m9,m10)]
    if len(set(t)) == 4:
        for p in permutations('xywz'):
            if [f(**dict(zip(p, d))) for d in t] == [1,1,1,1]:
                print(''.join(p))  # yzwx


# https://stepik.org/lesson/2360652/step/2?unit=2396049
"""
https://stepik.org/lesson/563430/step/2?unit=557671

Логическая функция F задается выражением:
F(a, b, c, d) = (¬a ≡ b) ∧ (c → d) ∨ (a ∧ ¬b ∧ c)
Сколько строк в таблице истинности функции F соответствуют условию, что функция F истинна, 
если не менее двух из ее четырех аргументов a, b, c, d также имеют значение истина
"""
from itertools import *
res = 0
for a,b,c,d in product((0,1), repeat=4):
    F = (not a == b) and (c <= d) or (not b and a and c)
    res += F and (a + b + c + d) >= 2
print(res)  # 5



"""
Ссылка на мой урок
Ссылка на источник
"""
""" Взято на мой курс """



"""
Ссылка на мой урок
Ссылка на источник
"""
""" Взято на мой курс """