""" Task 05_1 """

"""
pert 1
4462 9360 18578 19888 20182 23264 23551 

pert 2
1114 9774 12721 14330 20278 21244 21974 

Есть на вариантах экзаменов
31502
"""


# https://stepik.org/lesson/1993065/step/1?unit=2021073
"""
https://kompege.ru/task
№ 23551 Пересдача 03.07.25 (Уровень: Базовый)

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится двоичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
a) если число чётное, то к двоичной записи числа слева дописывается 10;
б) если число нечётное, то к двоичной записи числа слева дописывается 1 и справа дописывается 01
Полученная таким образом запись является двоичной записью искомого числа R.
3. Результат переводится в десятичную систему и выводится на экран.
Например, для исходного числа 410 = 1002 результатом является число 2010 = 101002, 
а для исходного числа 510 = 1012 это число 5310 = 1101012.
Укажите максимальное число N, после обработки которого с помощью этого алгоритма получается число R, меньшее, чем 30. 
В ответе запишите это число в десятичной системе счисления.
"""
for n in range(100, 0, -1):
    b = f'{n:b}'
    if b[-1] == '0':
        b = '10' + b
    else:
        b = '1' + b + '01'
    r = int(b, 2)
    if int(b, 2) < 30:
        print(n)  # 6
        break



# https://stepik.org/lesson/1993065/step/2?unit=2021073
"""
https://stepik.org/lesson/1220674/step/3?unit=1234060

1. Строится двоичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
а) если сумма цифр в двоичной записи числа чётная, то к этой записи справа дописывается 0, а затем три левых разряда заменяются на 101;
б) если сумма цифр в двоичной записи числа нечётная, то к этой записи справа дописывается 11, а затем два левых разряда заменяются на 10.
Полученная таким образом запись является двоичной записью искомого числа R.
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число R, большее 68.
В ответе запишите это число в десятичной системе счисления.
"""
for n in range(1, 100):
    nb = f'{n:b}'
    if not nb.count('1') % 2:
        nb = '101' + nb[3:] + '0'
    else:
        nb = '10' + nb[2:] + '11'
    if int(nb, 2) > 68:
        print(n)  # 19
        break


# https://stepik.org/lesson/1993065/step/3?unit=2021073
"""
https://stepik.org/lesson/1220674/step/5?unit=1234060

Автомат обрабатывает натуральное число N по следующему алгоритму:
1. Из числа N вычитается количество нулей в двоичной записи числа N.
2. Строится двоичная запись полученного числа.
3. К полученной записи слева дописывается три младших разряда.
4. Результат переводится в десятичную систему и выводится на экран.
Какое наименьшее число, большее 224, может появиться на экране в результате работы автомата?
"""
# число плавает
res = set()
for n in range(1, 1000):
    n -= f'{n:b}'.count('0')
    b = f'{n:b}'
    b = b[-3:] + b
    if int(b, 2) > 224:
        res.add(int(b, 2))
print(min(res))  # 227


# https://stepik.org/lesson/1993065/step/4?unit=2021073
"""
https://kompege.ru/task
№ 23264 Основная волна 11.06.25 (Уровень: Базовый)

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится троичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
a) если число N делится на 3, то к этой записи дописываются две последние троичные цифры;
б) если число N на 3 не делится, то остаток от деления умножается на 5, переводится в троичную запись и дописывается в конец числа.
Полученная таким образом запись является троичной записью искомого числа R.
3. Результат переводится в десятичную систему и выводится на экран.
Например, для исходного числа 1110 = 1023 результатом является число 1021013 = 30710, 
а для исходного числа 1210 = 1103 это число 110103 = 11110.

Укажите минимальное число R, большее 150, которое может быть получено с помощью описанного алгоритма. 
В ответе запишите это число в десятичной системе счисления.
"""

def conv(n, b):
    r = ''
    while n:
        r = str(n % b) + r
        n //= b
    return r

res = set()
for n in range(1, 1000):
    r = conv(n, 3)
    if not n % 3:
        r += r[-2:]
    else:
        add = (n % 3) * 5
        r += conv(add, 3)
    r = int(r, 3)
    if r > 150:
        res.add(r)
print(min(res))  # 162


# https://stepik.org/lesson/1993065/step/5?unit=2021073
"""
https://stepik.org/lesson/1220674/step/6?unit=1234060

Алгоритм получает на вход натуральное число N и строит по нему новое число R следующим образом:
1.  Строится двоичная запись числа N.
2.  В полученной записи все нули заменяются на единицы, все единицы – на нули. Из полученного числа удаляются ведущие нули.
3.  Результат переводится в десятичную систему счисления.
4.  Результатом работы алгоритма становится разность исходного числа N и числа, полученного на предыдущем шаге.
При каком наименьшем N в результате работы алгоритма получится R = 979?
"""
for n in range(1, 10000):
    b = f'{n:b}'
    b = b.replace('0', '_').replace('1', '0').replace('_', '1')
    if n - int(b, 2) == 979:
        print(n)
        break  # 1001



# https://stepik.org/lesson/1993065/step/6?unit=2021073
"""
https://stepik.org/lesson/1993065/step/7?unit=2021073
Алгоритм получает на вход натуральное число N> 1 и строит по нему новое число R следующим образом:

1)  Строится двоичная запись числа N.
2)  Подсчитывается количество нулей и единиц в полученной записи. Если их количество одинаково, в конец записи добавляется её последняя цифра. 
В противном случае в конец записи добавляется цифра, которая встречается реже.
3)  Шаг 2 повторяется ещё два раза.
4)  Результат переводится в десятичную систему счисления.

При каком наименьшем исходном числе N> 80 в результате работы алгоритма получится чётное число, которое не делится на 4?
"""
def fn(b):
    z, s = b.count('0'), b.count('1')
    if z == s:
        b += b[-1]
    else:
        b += ('0', '1')[z > s]
    return b

for n in range(80, 10000):
    b = f'{n:b}'
    for _ in range(3):
        b = fn(b)
    R = int(b, 2)
    if not R % 2 and R % 4:
        print(n)  # 81
        break



# https://stepik.org/lesson/1993065/step/7?unit=2021073
"""
https://kompege.ru/task
№ 20182 (Уровень: Базовый)

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится троичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
a) если сумма цифр в троичной записи числа чётная, то к этой записи справа дописывается 0, а затем два левых разряда заменяются на 12;
б) если сумма цифр в троичной записи числа нечётная, то к этой записи справа дописывается 2, а затем два левых разряда заменяются на 10.
Полученная таким образом запись является троичной записью искомого числа R.
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число R, большее 105. В ответе запишите это число в десятичной системе счисления.
"""
def conv(n, b):
    r = ''
    while n:
        r = str(n % b) + r
        n //= b
    return r

for n in range(1, 200):
    r = conv(n, 3)
    if not sum(map(int, r)) % 2:
        r = '12' + r[2:] + '0'
    else:
        r = '10' + r[2:] + '2'
    if int(r, 3) > 105:
        print(n)  # 28
        break




# https://stepik.org/lesson/1993065/step/8?unit=2021073
"""
https://kompege.ru/task	
№ 19888 (Уровень: Базовый)

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится восьмеричная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
а) если число N чётное, то в этой записи все нечётные цифры меняются на «2»;
б) если число N нечётное, то первая и последняя цифры меняются на «3».
Полученная таким образом запись является восьмеричной записью искомого числа R.
3. Результат переводится в десятичную систему и выводится на экран.

Например, для исходного числа 9 = 118 результатом является число 338 = 27, а для исходного числа 12 = 148 это число 248 = 20.
Укажите максимальное число R, меньшее 300, которое может быть получено с помощью описанного алгоритма. В ответе запишите это число в десятичной системе счисления.
"""
res = 0
for n in range(1, 1000):
    b = oct(n)[2:]
    if not n % 2:
        for i in '1357':
            b = b.replace(i, '2')
    else:
        b = '3' + b[1:-1] + '3'
    r = int(b, 8)
    if r < 300:
        res = max(res, r)
print(res)  # 294



# https://stepik.org/lesson/1993065/step/9?unit=2021073
"""
https://kompege.ru/task	
№ 18578 (Уровень: Базовый)

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится четверичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
а) если число N делится на 4, то слева к четверичной записи приписывается «2», а справа «03»;
6) если число N на 4 не делится, то остаток от деления на 4 умножается на 5, переводится в четверичную запись и дописывается в конец четверичной записи.
Полученная таким образом запись является четверичной записью искомого числа R.
3. Результат переводится в десятичную систему и выводится на экран.
Например, для исходного числа 11 = 234 результатом является число 23334 = 191.
Укажите максимальное число N, после обработки которого с помощью этого алгоритма получается число R, не превышающее 567.
"""
def conv(n, b):
    r = ''
    while n:
        r = str(n % b) + r
        n //= b
    return r

res = 0
for n in range(100, 0, -1):
    b = conv(n, 4)
    if not n % 4:
        b = '2' + b + '03'
    else:
        add = n % 4 * 5
        b += conv(add, 4)
    if int(b, 4) < 567:
        print(n)  # 34
        break


# https://stepik.org/lesson/1993065/step/10?unit=2021073
"""
https://kompege.ru/task	
4462 Джобс 15.06.2022 (Уровень: Базовый)

На вход алгоритма подаётся целое число N > 1. Алгоритм строит по нему новое число R следующим образом.

1. Строится двоичная запись числа N.
2. Из полученной записи убирается старшая (левая) единица
3. Далее эта запись обрабатывается по следующему правилу:
а) если в полученной записи количество единиц четное, то слева дописывается 10;
б) если количество единиц нечётное, слева дописывается 1, справа 0.

Полученная таким образом запись является двоичной записью искомого числа R.

Например, для исходного числа 4<sub>10</sub> = 100<sub>2</sub> результатом будет являться число 8<sub>10</sub> = 1000<sub>2</sub>, а для исходного числа 6<sub>10</sub> = 110<sub>2</sub> результатом будет являться число 12<sub>10</sub> = 1100<sub>2</sub>.

Укажите максимальное десятичное число R, меньшее 450, двоичная запись которого может являться результатом работы алгоритма. В ответе запишите это число в десятичной системе счисления
"""
res = 0
for n in range(1, 1000):
    b = f'{n:b}'[1:]
    if b.count('1') % 2:
        b = '1' + b + '0'
    else:
        b = '10' + b
    r = int(b, 2)
    if r < 450:
        res = max(res, r)
print(res)  # 444



# https://stepik.org/lesson/1993065/step/11?unit=2021073
"""
https://kompege.ru/task
9360 Джобс 10.06.23 (Уровень: Базовый)

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится двоичная запись числа N.
2. К этой записи справа дописываются разряды по следующему правилу. Если число кратно 3, то дописывается 010, иначе в конец дописывается двоичная последовательность, являющаяся результатом умножения 5 на остаток от деления числа N на 3.
Например, для числа 13 двоичная запись 1101 преобразуется в запись 1101101, для числа 9 двоичная запись 1001 преобразуется в 1001010.
3. Полученная таким образом запись является двоичной записью искомого числа R.
Укажите значение N, в результате обработки которого будет получено минимально возможное четное значение R, большее 300. Если таких значений несколько, приведите минимальное подходящее значение.
"""
res = []
for n in range(1, 1000):
    b = f'{n:b}'
    if n % 3:
        b += f'{n % 3 * 5:b}'
    else:
        b += '010'
    r = int(b, 2)
    if r > 300 and not r % 2:
        res.append((r, n))
res.sort()
print(res[0][1])  # 39


# https://stepik.org/lesson/1993065/step/12?unit=2021073
"""
https://stepik.org/lesson/564212/step/10?unit=558460

На вход алгоритма подаётся натуральное число N > 10. Алгоритм строит по нему новое число R следующим образом.

Строится пятеричная запись числа N.
Далее эта запись обрабатывается по следующему правилу:
а) если число N делится на 5, то к пятеричной записи справа дописываются последние три цифры;
б) если число N не делится на 5, то остаток от деления числа N на 5 умножается на пять, а затем полученный результат в пятеричном виде приписывается слева к пятеричной записи. Полученная таким образом запись является пятеричной записью искомого числа R.
Например, для исходного числа 710 = 125  результатом является число 20125 = 25710 .
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число R, большее 375. В ответе запишите это число в десятичной системе счислени
"""
def b5(n):
    r = ''
    while n:
        r = str(n % 5) + r
        n //= 5
    return r

for n in range(11, 100):
    b = b5(n)
    if n % 5:
        b = b5(n % 5 * 5) + b
    else:
        b += b[-3:]
    r = int(b, 5)
    if r > 375:
        print(n)  # 13
        break



# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""
""" Взято на мой курс """