""" Task 05 - 02 """

"""
pert 1
4462 9360 18578 19888 20182 23264 23551 

pert 2
1114 9774 12721 14330 20278 21244 21974 

Есть на вариантах экзаменов
31502
"""



# https://stepik.org/lesson/2362385/step/1?unit=2397738
"""
https://stepik.org/lesson/1126386/step/2?unit=1137880

Автомат обрабатывает натуральное трёхзначное число N по следующему алгоритму:
1. Из цифр, образующих десятичную запись N, строятся наибольшее и наименьшее возможные двузначные числа (числа не могут начинаться с нуля).
2. На экран выводится разность полученных двузначных чисел. 

Пример. Дано число N = 238. Алгоритм работает следующим образом: 
1. Наибольшее двузначное число из заданных цифр – 83, наименьшее – 23. 
2. На экран выводится разность 83 – 23 = 60.
Чему равно наименьшее возможное трёхзначное число N, в результате обработки которого на экране автомата появится число 70?
"""
for n in range(100, 1000):
    b = ''.join(sorted(str(n)))
    MAX = int(b[-1] + b[-2])
    if b[0] != '0':
        MIN = int(b[:2])
    else:
        i = b.rindex('0')
        MIN = int(b[i+1] + b[i])
    if MAX - MIN == 70:
        print(n)  # 118
        break



# https://stepik.org/lesson/2362385/step/2?unit=2397738
"""
https://stepik.org/lesson/707568/step/12?unit=708074

Автомат получает на вход пятизначное число. По этому числу строится новое число по следующим правилам.
- Складываются отдельно первая, третья и пятая цифры, а также вторая и четвёртая цифры.
- Полученные два числа записываются друг за другом в порядке неубывания без разделителей.
Пример. Исходное число: 63179. Суммы: 6 + 1 + 9 = 16; 3 + 7 = 10. Результат: 1016.
Укажите наименьшее число, при обработке которого автомат выдаёт результат 723.
"""
for n in range(10000, 100000):
    a,b,c,d,e = map(int,str(n))
    n1, n2 = sorted([a+c+e, b+d])
    r = int(str(n1) + str(n2))
    if r == 723:
        print(n)  # 50979
        break


# https://stepik.org/lesson/2362385/step/3?unit=2397738
"""
https://kompege.ru/task
21974 (Уровень: Средний)

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится двоичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
а) если число N делится на 2, то в этой записи все «0» заменяются на «1»;
6) если число N на 2 не делится, то в этой записи все «1», кроме первой, заменяются на «00».
Полученная таким образом запись является двоичной записью искомого числа R.
3. Результат переводится в десятичную систему и выводится на экран.
Например, для исходного числа 11 = 10112 результатом является число 1000002 = 32.
Укажите максимальное число N, после обработки которого с помощью этого алгоритма получается максимальное число R, не превышающее 600.
"""
res = []
for n in range(1, 1000):
    b = f'{n:b}'
    if n % 2:
        b = '1' + b[1:].replace('1', '00')
    else:
        # b = b.replace('0', '1')
        b = '1' * len(b)
    r = int(b, 2)
    if r <= 600:
        res.append((r, n))
print(max(res)[1])  # 257



# https://stepik.org/lesson/2362385/step/4?unit=2397738
"""
https://kompege.ru/task
21244 (Уровень: Средний)

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
Строится четверичная запись числа N.
Далее эта запись обрабатывается по следующему правилу:
а) если сумма цифр четверичной записи кратна 4, то  все нули в записи меняются на 3, а все 3 меняются на нули, 
   после к числу приписывается 21 справа;
б) если сумма цифр четверичной записи не кратна 4, то к записи справа приписывается 22 после первые два разряда, 
   полученной записи, меняются на   11 соответственно, разряды нумеруются слева направо, начиная с 1.
Полученная таким образом запись является четверичной записью искомого числа R. 
Укажите  минимальное число N, для которого результатом работы алгоритма является наименьшее число R, превышающее 200.
"""
def f(n, b=4):
    r = ''
    while n:
        r = str(n % b) + r
        n //= b
    return r

res = []
for n in range(5_000):
    b = f(n)
    if sum(map(int, b)) % 4:
        b += '22'
        b = '11' + b[2:]
    else:
        b = b.replace('0', '*').replace('3', '0').replace('*', '3')
        b += '21'
    r = int(b, 4)
    if r > 200:
        res.append([r, n])
print(min(res)[1])  # 1011



# https://stepik.org/lesson/2362385/step/5?unit=2397738
"""
https://kompege.ru/task
20278 (Уровень: Средний)

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится двоичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
- если сумма цифр в двоичной записи числа чётная, то к этой записи справа дописывается 01, а затем три левых разряда заменяются на 101;
- если сумма цифр в двоичной записи числа нечётная, то к этой записи справа дописывается 10, а затем три левых разряда заменяются на 111.
Полученная таким образом запись является двоичной записью искомого числа R.
Укажите максимальное число N, после обработки которого с помощью этого алгоритма получается число R, меньшее 385. 
"""
for n in range(1000,0, -1):
    b = f'{n:b}'
    if b.count('1') % 2:
        b += '10'
        b = '111' + b[3:]
    else:
        b += '01'
        b = '101' + b[3:]
    r = int(b, 2)
    if r < 385:
        print(n)  # 126
        break


# https://stepik.org/lesson/2362385/step/6?unit=2397738
"""
https://stepik.org/lesson/707568/step/13?unit=708074

Автомат получает на вход четырёхзначное число. По этому числу строится новое число по следующим правилам.
 Складываются отдельно первая и вторая цифры, вторая и третья цифры, а также третья и четвёртая цифры.
 Из полученных трёх чисел выбираются два наибольших и записываются друг за другом в порядке неубывания без разделителей.
Пример. Исходное число: 9575. Суммы: 9+5=14; 5+7=12; 7+5=12. Наибольшие суммы: 14, 12. Результат: 1214.
Укажите наибольшее число, при обработке которого автомат выдаёт результат 1517.
"""
for n in range(9999, 999, -1):
    d = [*map(int, str(n))]
    a, b = sorted(a+b for a,b in zip(d, d[1:]))[-2:]
    if f'{a}{b}' == '1517':
        print(n)  # 9878
        break


# https://stepik.org/lesson/2362385/step/7?unit=2397738
"""
https://kompege.ru/task
1114 (Уровень: Базовый)

Алгоритм получает на вход натуральное число N > 1 и строит по нему новое число R следующим образом:
 - Строится двоичная запись числа N.
 - Подсчитывается количество нулей и единиц в полученной записи. Если их количество одинаково, 
   в конец записи добавляется её последняя цифра. В противном случае в конец записи добавляется цифра, которая встречается реже.
 - Шаг 2 повторяется ещё два раза.
 - Результат переводится в десятичную систему счисления.
При каком наименьшем исходном числе N > 95 в результате работы алгоритма получится число, кратное 4?
"""
for n in range(96, 1000):
    b = f'{n:b}'
    for _ in range(3):
        one = b.count('1')
        zero = b.count('0')
        if one == zero:
            b += b[-1]
        else:
            b += ('0', '1')[one < zero]
    # В двоичной системе, чтобы число делилось на 4, его последние два бита должны быть '00'
    if b[-2:] == '00':
    # if not int(b, 2) % 4:
        print(n)  # 103
        break


# https://stepik.org/lesson/2362385/step/8?unit=2397738
"""
https://kompege.ru/task
9774 Основная волна 20.06.13  (Уровень: Средний)

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится троичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
а) если число N делится на 3, то к этой записи дописываются две последние троичные цифры;
б) если число N на 3 не делится, то остаток от деления умножается на 5, переводится в троичную запись и дописывается в конец числа.
Полученная таким образом запись является троичной записью искомого числа R.
3. Результат переводится в десятичную систему и выводится на экран.
Например, для исходного числа 11 = 1023 результатом является число 1021013 = 307, а для исходного числа 12 = 1103 это число 110103 = 111.
Укажите минимальное число R, большее 133, которое может быть получено с помощью описанного алгоритма. 
В ответе запишите это число в десятичной системе счисления.
"""
def f(n, b=3):
    r = ''
    while n:
        r = str(n % b) + r
        n //= b
    return r

res = 10**10
for n in range(1, 10000):
    b = f(n)
    if n % 3:
        b += f(n % 3 * 5)
    else:
        b += b[-2:]
    r = int(b, 3)
    if r > 133:
        res = min(res, r)
print(res)  # 141




# https://stepik.org/lesson/2362385/step/9?unit=2397738
"""
https://kompege.ru/task
12721 (Уровень: Средний)

На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится восьмеричная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
а) если количество чётных цифр в записи числа нечётно, то к трём последним разрядам восьмеричной записи справа дописывается 46;
б) если количество чётных цифр в записи числа чётно, то остаток от деления числа на 8 умножается на 5, переводится в восьмеричную запись и дописывается слева.
Полученная таким образом запись является восьмеричной записью искомого числа R.
3. Результат переводится в десятичную систему и выводится на экран.
Например, для исходного числа 12 = 148 результатом является число 14468 = 806, а для исходного числа 777 = 14118 это число 411468 = 16998.
Укажите минимальное число R, которое может быть получено с помощью описанного алгоритма при N не меньшем 80. 
В ответ запишите это число в десятичной системе счисления.
"""
def f(n, b):
    r = ''
    while n:
        r = str(n % b) + r
        n //= b
    if r:
        return r
    return '0'

res = 10**10
for n in range(80, 1000):
    b = f(n, 8)
    even = sum(1 for i in b if i in '0246')
    if even % 2:
        b = b[-3:] + '46'  # остаются только 3 младших разряда
    else:
        add = (n % 8) * 5
        b = f(add, 8) + b
    r = int(b, 8)
    res = min(res, r)
print(res)  # 38


# https://stepik.org/lesson/2362385/step/10?unit=2397738
"""
https://kompege.ru/task
14330 (Уровень: Средний)

Автомат получает на вход пятизначное число. По этому числу строится новое число по следующим правилам.
1. Вычисляется квадрат суммы наибольшей и наименьшей цифр исходного числа.
2. Вычисляется произведение всех чётных цифр исходного числа.
3. Полученные два числа записываются друг за другом в порядке невозрастания (без разделителей).
Пример. Исходное число: 82134. Квадрат суммы цифр = (1 + 8)2= 81. Произведение цифр = 8 * 2 * 4 = 64. Результат: 8164.
Укажите наименьшее число, при обработке которого автомат выдаст число 12116.
"""
from math import prod
for n in range(10_000,100_000):
    d = sorted(map(int, str(n)))
    q = (d[0] + d[-1])**2
    p = prod(i for i in d if not i % 2)
    n2, n1 = sorted([q, p])
    r = int(str(n1) + str(n2))
    if r == 12116:
        print(n)  # 22229
        break



# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""
""" Взято на мой курс """


# https://stepik.org/lesson/707568/step/8?unit=708074
from math import prod
for n in range(999, 99, -1):
    pr = str(prod(map(int, str(n))))
    sm = str(sum(map(int, str(n))))
    ls = sorted([pr, sm], reverse=True)
    if int(''.join(ls)) == 33621:
        print(n)
        break
