""" Task 05 - 02 """

# https://stepik.org/lesson/2362385/step/1?unit=2397738
"""
https://stepik.org/lesson/1126386/step/2?unit=1137880

Автомат обрабатывает натуральное трёхзначное число N по следующему алгоритму:
1. Из цифр, образующих десятичную запись N, строятся наибольшее и наименьшее возможные двузначные числа (числа не могут начинаться с нуля).
2. На экран выводится разность полученных двузначных чисел. 

Пример. Дано число N = 238. Алгоритм работает следующим образом: 
1. Наибольшее двузначное число из заданных цифр – 83, наименьшее – 23. 
2. На экран выводится разность 83 – 23 = 60.
Чему равно наименьшее возможное трёхзначное число N, в результате обработки которого на экране автомата появится число 70?
"""
for n in range(100, 1000):
    b = ''.join(sorted(str(n)))
    MAX = int(b[-1] + b[-2])
    if b[0] != '0':
        MIN = int(b[:2])
    else:
        i = b.rindex('0')
        MIN = int(b[i+1] + b[i])
    if MAX - MIN == 70:
        print(n)  # 118
        break




# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""