""" Task 06 """

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""


# https://stepik.org/lesson/2339682/step/2?unit=2375087
"""
Черепахе был дан для исполнения следующий алгоритм:
Повтори 7 [Вперёд 128 Направо 90]

Определите, сколько точек с целочисленными координатами будут находиться внутри области, ограниченной линией, заданной данным алгоритмом. 
Точки на линии учитывать не следует.
# (128 - 1) * (128 - 1) = 16129

Определите, сколько точек с целочисленными координатами будут находиться внутри области, ограниченной линией, заданной данным алгоритмом. 
Точки на линии учитывать.
# (128 + 1) * (128 + 1) = 16641

Определите, сколько точек с целочисленными координатами будут находиться на периметре полученного контура.
# 128 * 128 = 16384
"""



# https://stepik.org/lesson/2339682/step/3?unit=2375087
"""
https://kompege.ru/task
9737 Основная волна 19.06.23 (Уровень: Базовый)
EGE/06/06_01.gif

Черепахе был дан для исполнения следующий алгоритм:
Повтори 2 [Вперёд 10 Направо 90 Вперёд 18 Направо 90]
Поднять хвост
Вперёд 5 Направо 90 Вперёд 7 Налево 90
Опустить хвост
Повтори 2 [Вперёд 10 Направо 90 Вперёд 7 Направо 90]
Определите, сколько точек с целочисленными координатами будут находиться внутри объединения фигур, ограниченных
заданными алгоритмом линиями, включая точки на линиях.
"""
from turtle import *
lt(90)
screensize(1500, 1500)
tracer(0)
k = 30
for _ in range(2):
    fd(10*k)
    rt(90)
    fd(18 * k)
    rt(90)
pu()
fd(5*k)
rt(90)
fd(7*k)
lt(90)
pd()
for _ in range(2):
    fd(10 * k)
    rt(90)
    fd(7 * k)
    rt(90)
pu()
for x in range(-k, k):
    for y in range(-k, k):
        goto(x*k, y*k)
        dot()
done()
print(11*19 + 11*8 - 6*8)  # 249



# https://stepik.org/lesson/2339682/step/4?unit=2375087
"""
https://kompege.ru/task
23365 Резервный день 19.06.25 (Уровень: Базовый)
EGE/06/06_02.gif

Черепахе был дан для исполнения следующий алгоритм.
Повтори 3 [Вперёд 39 Направо 90 Вперёд 48 Направо 90]
Поднять хвост
Вперёд 27 Направо 90 Вперёд 24 Налево 90
Опустить хвост
Повтори 3 [Вперёд 29 Направо 90 Назад 18 Направо 90]
Определите площадь объединения фигур, ограниченного заданными алгоритмом линиями.
"""
from turtle import *
lt(90)
screensize(2500, 2500)
tracer(0)
k = 25
for _ in range(3):
    fd(39 * k)
    rt(90)
    fd(48 * k)
    rt(90)
pu()
fd(27 * k)
rt(90)
fd(24 * k)
lt(90)
pd()
for _ in range(3):
    fd(29 * k)
    rt(90)
    bk(18 * k)
    rt(90)
pu()
for x in range(-5, 50):
    for y in range(-30, 50):
        goto(x*k, y*k)
        dot()
done()
print(39*48 + 29*18 - 12*18)  # 2178



# https://stepik.org/lesson/2339682/step/5?unit=2375087
"""
https://kompege.ru/task
на основе 4764 (Уровень: Средний)
EGE/06/06_03.gif

Черепахе был дан для исполнения следующий алгоритм:
Повтори 65 [Вперёд 7 Направо 18]
Определите, из какого количества отрезков будет состоять фигура, заданная данным алгоритмом.
"""
from turtle import *
lt(90)
screensize(1500, 1000)
tracer(0)
k = 12
for _ in range(65):
    fd(7 * k)
    rt(18)
pu()
for x in range(-10, 60):
    for y in range(-40, 40):
        goto(x*k, y*k)
        dot(3)
done()
print(360 // 18)  # 20
# 360 градусов / 18 (угловой поворот)


# https://stepik.org/lesson/2339682/step/6?unit=2375087
"""
https://stepik.org/lesson/564180/step/2?unit=558428
EGE/06/06_04.gif

Черепахе был дан для исполнения следующий алгоритм:
Повтори 5 [ Повтори 3 [ Вперед 4 Налево 90 ] Вперед 2 ]
Сколько квадратов можно найти на полученной фигуре?
"""
from turtle import *
lt(90)
tracer(0)
k = 50
for _ in range(5):
    for _ in range(3):
        fd(4 * k)
        lt(90)
    fd(2 * k)
pu()
for x in range(-5, 10):
    for y in range(-5, 10):
        goto(x*k, y*k)
        dot(3)
done()


# https://stepik.org/lesson/2339682/step/7?unit=2375087
"""
https://stepik.org/lesson/564180/step/6?unit=558428
EGE/06/06_05.gif

Черепаха выполнила следующую программу (x в тексте программы – некоторое натуральное число):
Повтори 4 [Вперёд x Направо 90 Вперёд x Налево 90 Вперёд x Направо 90]
Определите, при каком наименьшем натуральном x количество точек с целочисленными координатами внутри области, ограниченной линией, полученной при выполнении данной программы, окажется больше 1000. 
Точки, расположенные на линии, не учитывать.
"""
from turtle import *
x = 0
for i in range(100):
    if 5*(i-1)**2 + 4*(i-1) > 1000:  # 1036
        x = i  # 15
        break
lt(90)
screensize(2000, 2000)
tracer(0)
k = 20
for _ in range(4):
    fd(x * k)
    rt(90)
    fd(x * k)
    lt(90)
    fd(x * k)
    rt(90)
pu()
for a in range(-5, 5*x):
    for b in range(-50, 5*x):
        goto(a*k, b*k)
        dot()
done()
# x = 15



# https://stepik.org/lesson/2339682/step/8?unit=2375087
"""
https://kompege.ru/task
17860 Демоверсия 2025 (Уровень: Базовый)
EGE/06/06_06.gif

Черепахе был дан для исполнения следующий алгоритм:
Повтори 9 [Вперёд 22 Направо 90 Вперед 6 Направо 90]
Поднять хвост
Вперед 1 Направо 90 Вперёд 5 Налево 90
Опустить хвост
Повтори 9 [Вперёд 53 Направо 90 Вперёд 75 Направо 90]
Определите периметр области пересечения фигур, ограниченных заданными алгоритмом линиями.
"""
from turtle import *
lt(90)
screensize(2000, 2000)
tracer(0)
k = 20
for _ in range(9):
    fd(22 * k)
    rt(90)
    fd(6 * k)
    rt(90)
pu()
fd(1 * k)
rt(90)
fd(5 * k)
lt(90)
pd()
for _ in range(9):
    fd(53 * k)
    rt(90)
    fd(75 * k)
    rt(90)
pu()
for x in range(-70, 10):
    for y in range(-40, 30):
        goto(x*k, y*k)
        dot()
done()
# (21 + 1) * 2 = 44


# https://stepik.org/lesson/2339682/step/9?unit=2375087
"""
https://kompege.ru/task
12882 (Уровень: Базовый)
EGE/06/06_07.gif

Черепаха выполнила следующую программу:
Налево 255
Повтори 3 [Налево 30 Повтори 4 [Вперёд 10 Налево 90] ]
Определите, общее количество различных точек с целочисленными координатами, которые будут находиться на пересечении только двух фигур, полученных при выполнении данной программы. Точки на линиях учитывать не следует.
"""
from turtle import *
tracer(0)
k = 30
lt(90)
screensize(2000, 2000)
lt(255)
for a in range(3):
    lt(30)
    for b in range(4):
        fd(10*k)
        lt(90)
up()
for x in range(-20, 20):
    for y in range(-20, 20):
        goto(x*k, y*k)
        dot()
done()  # 56


# https://stepik.org/lesson/2339682/step/10?unit=2375087
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""







"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""





