""" Task 07 1 """

"""
Task 07 1 
156 6742 6912 1552 17694 20953 21702 22342   

Task 07 2
690 821 919 13093 17626 20425 22346 22475 24887 24981
"""
"""
Есть на вариантах экзаменов
31504
"""



""" Кодирование изображения """

# https://stepik.org/lesson/1993931/step/1?unit=2021967
"""
https://kompege.ru/task
156 (Уровень: Средний)

Автоматическая фотокамера каждую секунду создаёт растровое изображение, содержащее 216=65536 цветов. Размер изображения – 640 x 480 пикселей. 
Все полученные изображения и коды пикселей внутри одного изображения записываются подряд, никакая дополнительная информация не сохраняется, данные не сжимаются. 
Сколько Мбайт нужно выделить для хранения всех изображений, полученных за 128 секунд? В ответе укажите только целое число – количество Мбайт, единицу измерения указывать не надо.
"""
from math import ceil
pic = ceil(640 * 480 * 16 / 8)  #  1 фото
serial = pic * 128 / 2**20
print(int(serial))  # 75


# https://stepik.org/lesson/1993931/step/2?unit=2021967
"""
https://kompege.ru/task
6912 (Уровень: Базовый)

На жестком диске хранится растровое изображение размером 1044 × 2016. Объём изображения не превышает 4 мегабайта.
Необходимо найти максимально возможное количество использованных цветов. Известно, что при кодировании цвета каждого пикселя используется одинаковое количество бит.
"""
for i in range(1, 100):
    I = 1044 * 2016 * i / 8 / 2**20
    if I > 4:
        print(2**(i - 1))  # 32768
        break


# https://stepik.org/lesson/1993931/step/3?unit=2021967
"""
https://kompege.ru/task
6742 Апробация 10.03.23 (Уровень: Базовый)

Для хранения произвольного растрового изображения размером 320 на 512 пикселей отведено 120 Кбайт памяти без учёта размера заголовка файла. 
При кодировании цвета каждого пикселя используется одинаковое количество бит, при этом для каждых 2 бит цвета дописывается дополнительный бит контроля чётности. Коды пикселей записываются в файл один за другим без промежутков. 
Какое максимальное количество цветов можно использовать в изображении?
"""
i = 120 / (320 * 512 / 2**13)  # 6 бит (вместе с битом контроля чётности)
i_color = i * 2 / 3   # 4 бит (без бита контроля чётности)
print(2**i_color)  # 16


# https://stepik.org/lesson/1993931/step/4?unit=2021967
"""
https://kompege.ru/task
№ 22342 (Уровень: Средний)

Файл изображения сохраняется в разрешении 3508×2480 пикселей, при этом используется 32768 цветов. 
Перед передачей по сети файл сжимается до разрешения 1754×1240 пикселей, а глубина цвета уменьшается до 6 бит на пиксель. Скорость передачи данных составляет 256000 бит в секунду. 
Сколько минут удастся сэкономить при передаче 80 таких изображений благодаря сжатию? В ответе укажите только целую часть полученного числа
"""
from math import log2, ceil
I1 = 3508 * 2480 * ceil(log2(32768))
I2 = 1754 * 1240 * 6
delta = I1 - I2
time = 80 * delta / 256_000 // 60
print(time)  # 611


# https://stepik.org/lesson/1993931/step/5?unit=2021967
"""
https://kompege.ru/task
№ 20953 (Уровень: Базовый)

Прибор автоматической фиксации нарушений правил дорожного движения делает цветные фотографии размером 1920×1080 пикселей. 
Снимки сохраняются в памяти камеры, группируются в пакеты по 57 штук, затем передаются в центр обработки информации со скоростью передачи данных 2138400 бит/с. 
Каково минимально возможное количество цветов в палитре изображения, если на передачу одного пакета отводится более 10 минут?
В ответе запишите целое число
"""
from math import log2, ceil

total_size = 2_138_400 * 600  # bit
for i in range(100):
    if (1920 * 1080 * i) * 57 > total_size:
        print(2**(i - 1) + 1)  # 1025
        break



# https://stepik.org/lesson/1993931/step/6?unit=2021967
"""
https://kompege.ru/task
17694 (Уровень: Средний)

Автоматическая камера производит растровые изображения размером 800×600 пикселей. Для кодирования цвета каждого пикселя используется одинаковое целое количество байт, коды пикселей записываются в файл один за другим без промежутков. Объём файла с изображением не может превышать 700 Кбайт без учёта размера заголовка файла. 
Какое максимальное количество цветов можно использовать в палитре?
"""
from math import ceil
for i in range(2, 100):
    I = 800 * 600 * ceil(i / 8)  # Для кодирования цвета каждого пикселя используется одинаковое целое количество байт
    if I > 700 * 2**10:
        print(2**(i-1))  # 256
        break


# https://stepik.org/lesson/1993931/step/7?unit=2021967
"""
https://kompege.ru/task
1552 (Уровень: Средний)

Для хранения в информационной системе документы сканируются с разрешением 300 ppi. Методы сжатия изображений не используются. Средний размер отсканированного документа составляет 5 Мбайт. В целях экономии было решено перейти на разрешение 150 ppi и цветовую систему, содержащую 16 цветов. Средний размер документа, отсканированного с изменёнными параметрами, составляет 512 Кбайт. 
Определите количество цветов в палитре до оптимизации
"""
"""
300**2 * i == 5 * 1024
150**2 * 4 == 512
"""
i = 150**2 * 4 * 5 * 1024 / (300**2 * 512)  # 10
print(2**i)  # 1024


# https://stepik.org/lesson/1993931/step/8?unit=2021967
"""
https://stepik.org/lesson/648369/step/1?auth=login&unit=645014
Изображения размером 3х4 дюйма сканируются с разрешением 300 ppi и использованием 216 цветов. Заголовок файла занимает 4 Кбайта. Для хранения таких изображений выделено 55 Мбайт памяти. 
Сколько изображений удастся сохранить? В ответе введите целое число.
"""
res = 55 * 2**10 / (3 * 4 * 300**2 * 16 / 2**13 + 4)
print(int(res)) # 26


# https://stepik.org/lesson/1993931/step/9?unit=2021967
"""
https://stepik.org/lesson/648369/step/14?auth=login&unit=645014
В информационной системе хранятся изображения размером 1600 × 1200 пикселей. Для кодирования цвета каждого пикселя используется одинаковое количество бит. 
При кодировании используется алгоритм сжатия изображений, позволяющий уменьшить размер памяти для хранения одного изображения в среднем в 5 раз по сравнению с независимым кодированием каждого пикселя. Так же, каждое изображение дополняется служебной информацией, которая занимает 100 Кбайт. Для хранения 32 изображений выделено 10 Мбайт памяти.
Какое максимальное количество цветов можно использовать в палитре каждого изображения?
"""
for i in range(2, 100):
    if (1600 * 1200 * i / 2**13 / 5 + 100) * 32 > 10 * 1024:
        print(2**(i-1))  # 16
        break



# https://stepik.org/lesson/1993931/step/10?unit=2021967
"""
https://kompege.ru/task
21702 ЕГКР 19.04.25 (Уровень: Базовый)
https://stepik.org/lesson/648369/step/16?auth=login&unit=645014

Фотограф делает цветные фотографии размером 7680×4320 пикселей, используя палитру из 2<sup>16</sup> цветов. Для сохранения снимков фотограф использует сменные карты памяти, каждая из которых вмещает не более 9 Гбайт данных. 
Когда на карте памяти остаётся недостаточно места для записи новой фотографии, фотограф берёт следующую, свободную карту. Известно, что фотограф сделал 4010 снимков. 
Сколько снимков оказалось на последней карте памяти из использованных? В ответе запишите целое число.
"""
I = (7680 * 4320 * 16 / 2**33)
card = 9 // I  # 145 photo
print(4010 % card)  # 95



# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""