""" Task 07 2 """

"""
Task 07 1
156 6742 6912 1552 17694 20953 21702 22342 

Task 07 2
690 821 919 13093 17626 20425 22346 22475 24887 24981
"""
"""
Есть на вариантах экзаменов
31504
"""





""" Кодирование звука """
#  https://stepik.org/lesson/1997663/step/2?unit=2025739
"""
https://kompege.ru/task
919 Джобс 08.02.2020 (Уровень: Средний)
https://stepik.org/lesson/648369/step/9?auth=login&unit=645014

На студии создается мультипликационный ролик, где каждый кадр – отдельно отрисованная картинка. 
Известно, что каждая картинка имеет разрешение 640х480 пикселей и цветовую палитру в 216 = 65536 цветов. Каждый пиксель кодируется с помощью минимально возможного и одинакового для всех пикселей количества бит. Картинки записываются одна за другой без разделителей и заголовков файла. Частота смены кадров в конечном ролике – 24 кадра/сек. 
В качестве звукового сопровождения выбран формат стерео с глубиной кодирования 10 бит и частотой дискретизации 40 кГц. 
Найдите размер мультфильма в МБайтах, если известно, что его длительность 5 минут. В качестве ответа укажите число – минимальное целое количество Мбайт достаточное для хранения такого файла.
"""
from math import ceil
Ip = 640 * 480 * 16 * 24 * 60 * 5 / 2 ** 23
Iv = 2 * 40000 * 10 * 60 * 5 / 2 ** 23
print(ceil(Ip + Iv))  # 4248



# https://stepik.org/lesson/1997663/step/3?unit=2025739
"""
https://kompege.ru/task
690 Джобс 16.11.2020 (Уровень: Средний)
https://stepik.org/lesson/648369/step/13?auth=login&unit=645014

Музыкальный фрагмент был записан в формате моно, оцифрован и сохранён в виде файла с использованием сжатия данных. При этом производилось сжатие данных, объем сжатого фрагмента стал равен 40% от первоначальной записи. 
Затем тот же музыкальный фрагмент был записан повторно в формате стерео (двухканальная запись) и оцифрован с разрешением в 8 раз выше и частотой дискретизации в 2 раз выше, чем в первый раз. При этом производилось сжатие данных, объем сжатого фрагмента стал равен 60% от повторной записи. 
Во сколько раз размер повторной записи будет больше первой?
"""
I1 = 1  # Первичная запись
I2 = I1 * 2 * 8 * 2  # Повторная запись
print(I2 * 0.6 / 0.4)  # 48 раз



# https://stepik.org/lesson/1997663/step/4?unit=2025739
"""
https://kompege.ru/task
№ 22475 (Уровень: Средний)
Преобразуется 3 видеофайла. Каждое из них представляет из себя видео разрешением 3840 x 2160 пикселей, а также цветовой палитрой из 220 цветов и частотой 60 кадров в секунду. 
Длительность каждого видео - 30 секунд. Звук к видео был записан в формате стерео, частотой дискретизации 48 кГц и глубиной кодирования 16 бит.
После отправки видео сжимается до разрешения 1920x1080 пикселей, цветовая палитра содержит 216 цветов. Звук также становится хуже. Его новые параметры после отправки - стерео формат, 36 кГц, глубина кодирования - 8 бит. 
Сколько Гбайт будет сэкономлено после такого преобразования? В ответе указать целое число.
"""
video_1 = 3840 * 2160 * 20  * 60 * 30
audio_1 = 2 * 48_000 * 16 * 30
Total_1 = (video_1 + audio_1) * 3

video_2 = 1920 * 1080 * 16 * 60 * 30
audio_2 = 2 * 36_000 * 8 * 30
Total_2 = (video_2 + audio_2) * 3
print(int((Total_1 - Total_2) / 2**33))  # 83



# https://stepik.org/lesson/1997663/step/5?unit=2025739
"""
https://kompege.ru/task
№ 22346 (Уровень: Средний)

На компьютер был сохранен звуковой файл в формате стерео, с разрешением 10 бит, частотой дискретизации 30 кГц, длительностью 150 секунд. 
Перед отправкой по каналу связи со скоростью 140 000 бит/с файл сжали. Количество каналов уменьшилось в 2 раза, частота дискретизации в 1,5 раза, разрешение в 5 раз, время - в 3 раза. 
Сколько часов удалось сэкономить при отправке 12 треков?  В ответе запишите только целую часть полученного числа.
"""
I1 = 2 * 30_000 * 10 * 150
I2 = I1 / 2 / 1.5 / 5 / 3

T1 = I1 * 12 / 140_000
T2 = I2 * 12 / 140_000
print((T1 - T2) // 3600)  # 2 hour



""" Видеофайлы """
# https://stepik.org/lesson/1997663/step/6?unit=2025739
"""
https://kompege.ru/task
24981 (Уровень: Средний)

Андрей человек снимает вертикальное видео без звука размером 1080 x 1920 пикселей с частотой 60 кадров в секунду и палитрой из 4096 цветов. Известно, что видео длилось 57 секунд. 
Сколько Кбайт можно было сэкономить, если бы запись велась с частотой 24 кадра в секунду и в палитре было бы 2048 цветов? В ответе укажите целое число.
"""
pic_1 = 1080 * 1920 * 12 * 60 * 57
pic_2 = 1080 * 1920 * 11 * 24 * 57
diff = (pic_1 - pic_2)
print(diff // 2**13)  # 6579225



#  https://stepik.org/lesson/1997663/step/7?unit=2025739
"""
https://kompege.ru/task
№ 821 Джобс 14.12.2020 (Уровень: Сложный)

Файлы изображений передают по каналу связи со средней скоростью 224 бит/сек. Известно, что процесс приема разбит на сеансы – 10 секунд передачи затем 2 секундная задержка. Если файл не успел полностью загрузиться за один сеанс, то его загрузка начинается заново во время следующего сеанса. 
Передаются растровые изображения разрешением 1600х1200 в цветовой палитре, содержащей 2000 цветов. Известно, что каждый пиксель кодируется с помощью одинакового и минимально возможного количества бит, все коды пикселей записываются последовательно один за другим без разделителей.
Сколько изображений можно передать за 40 секунд, если все изображения передаются один за другим без заголовков файла?
"""
from math import ceil, log2
I = 1600*1200*ceil(log2(2000))
pack_10 = 2**24 * 10 // I  # 7 photo
tail = 40 % (10 + 2)  # 4 sec
pack_add = 2**24 * tail // I  # 3 photo
print(pack_10 * 3 + pack_add)  # 24 photo



# https://stepik.org/lesson/1997663/step/8?unit=2025739
"""
https://kompege.ru/task
13093 (Уровень: Средний)
Камера наблюдения каждые n секунд (n – целое число) делает фотографию с разрешением 1200×800 пикселей и палитрой 65536 цветов. 
Фотографии передаются по каналу с пропускной способностью 300 Кбайт/сек, при этом используются методы сжатия, позволяющие уменьшить размер изображения в среднем на 40 %.
Определите минимально возможное значение n, при котором возможна передача в режиме реального времени.
"""
from math import ceil, log2
i = ceil(log2(65536))  # 16
for n in range(1, 100):
    if ceil(1200 * 800 * 16 / 8) * ((100-40)/100) <= 300 * 1024 * n:
        print(n)  # 4
        break


# https://stepik.org/lesson/1997663/step/9?unit=2025739
"""
https://kompege.ru/task
17626 Основная волна 19.06.24(Уровень: Базовый)

Прибор автоматической фиксации нарушений правил дорожного движения делает цветные фотографии размером 1280×1024 пикселей. 
Снимки сохраняются в памяти камеры, группируются в пакеты по 39 штук, затем передаются в центр обработки информации со скоростью передачи данных 1966080 бит/с. 
Каково максимально возможное количество цветов в палитре изображения, если на передачу одного пакета отводится не более 280 секунд?
В ответе запишите целое число.
"""
from math import ceil
V = 1_966_080
for i in range(1, 100):
    if ceil(1280 * 1024 * i / 8) * 8 * 39 > V * 280:
        print(2**(i-1))  # 1024
        break


# https://stepik.org/lesson/1997663/step/10?unit=2025739
"""
https://kompege.ru/task
20425 (Уровень: Средний)
Ваня снимал видео в разрешении 3840 x 2160 пикселей с цветовой палитрой в x цветов и частотой 60 кадров в секунду. 
Звуковая дорожка записывалась в стерео формате с частотой дискретизации 48 кГц и глубиной кодирования 16 бит. 
Видео длилось 1,5 минуты и заняло 54691875 Кбайт. 
Найдите чему равно максимальное количество цветов в палитре, используемой Ваней при съёмке этого видео.
"""
from math import ceil
A = 2 * 48_000 * 16
for i in range(1, 100):
    if (ceil(3840 * 2160 * i / 8) * 8 * 60 + A) * 90 > 54_691_875 * 2**13:
        print(2**(i-1))  # 1024
        break



# https://stepik.org/lesson/1997663/step/11?unit=2025739
"""
https://kompege.ru/task
24887 (Уровень: Средний)

Маша скачивает из Интернета альбом любимой группы, оцифрованный в формате стерео с частотой дискретизации 56 000 Гц и разрешением 15 бит без использования сжатия. 
В альбоме 28 треков общей длительностью 27 минут 27 секунд. Каждый трек содержит заголовок, это одно и то же целое число Кбайт для всех треков. 
Каков минимально возможный объём заголовка трека в Кбайт, 
если известно, что время скачивания всего альбома по каналу связи со скоростью передачи данных 367 217 732 бит/с превышает 332 секунды? 
В ответе запишите только целое число.
"""
for h in range(10**5, 10**6):   # большие значения
    t = (2 * 56_000 * 15 * (27 * 60 + 27) + 28 * h * 2**13) / 367_217_732
    if t > 332:
        print(h)  # 519450 KB
        break






# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""



""" Передача данных по сети """
#  ближе к концу
"""
https://stepik.org/lesson/648369/step/10?auth=login&unit=645014

Данные объемом 40 Мбайт передаются из пункта А в пункт Б по каналу связи, обеспечивающему скорость передачи данных 2<sup>21</sup> бит в секунду, а затем из пункта Б в пункт В по каналу связи, обеспечивающему скорость передачи данных 2<sup>23</sup> бит в секунду. 
От начала передачи данных из пункта А до их полного получения в пункте В прошло 5 минут. 
Сколько времени в секундах составила задержка в пункте Б, т.е. время между окончанием приема данных из пункта А и началом передачи данных в пункт В?
"""
# Задержка - время между окончанием приема данных в пункте  "Б"  до начала передачи данных  из пункта  "Б" в "В"
t_ab = 40 * 2**23 / 2**21  # 160 sec
t_bv = 40 * 2**23 / 2**23  # 40 sec
print(60*5 - (t_ab + t_bv))  # 100 sec




