""" Task 07 """

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""


""" Кодирование изображения """

# https://stepik.org/lesson/1993931/step/2?unit=2021967
"""
https://stepik.org/lesson/1221458/step/2?unit=1234862
На жестком диске хранится растровое изображение размером 1044 × 2016. Объём изображения не превышает 4 мегабайта.
Необходимо найти максимально возможное количество использованных цветов. Известно, что при кодировании цвета каждого пикселя используется одинаковое количество бит.
"""
for i in range(1, 100):
    I = 1044 * 2016 * i / 8 / 2**20
    if I > 4:
        print(2**(i - 1))  # 32768
        break


# https://stepik.org/lesson/1993931/step/3?unit=2021967
"""
https://stepik.org/lesson/1221458/step/6?unit=1234862
Для хранения произвольного растрового изображения размером 320 на 512 пикселей отведено 120 Кбайт памяти без учёта размера заголовка файла. 
При кодировании цвета каждого пикселя используется одинаковое количество бит, при этом для каждых 2 бит цвета дописывается дополнительный бит контроля чётности. Коды пикселей записываются в файл один за другим без промежутков. 
Какое максимальное количество цветов можно использовать в изображении?
"""
i = 120 / (320 * 512 / 2**13)  # 6 бит (вместе с битом контроля чётности)
i_color = i * 2 / 3   # 4 бит (без бита контроля чётности)
print(2**i_color)  # 16


# https://stepik.org/lesson/1993931/step/4?unit=2021967
"""
https://kompege.ru/task
№ 22342 (Уровень: Средний)
Файл изображения сохраняется в разрешении 3508×2480 пикселей, при этом используется 32768 цветов. 
Перед передачей по сети файл сжимается до разрешения 1754×1240 пикселей, а глубина цвета уменьшается до 6 бит на пиксель. Скорость передачи данных составляет 256000 бит в секунду. 
Сколько минут удастся сэкономить при передаче 80 таких изображений благодаря сжатию? В ответе укажите только целую часть полученного числа
"""
from math import log2, ceil
I1 = 3508 * 2480 * ceil(log2(32768))
I2 = 1754 * 1240 * 6
delta = I1 - I2
time = 80 * delta / 256_000 // 60
print(time)  # 611


# https://stepik.org/lesson/1993931/step/5?unit=2021967
"""
https://kompege.ru/task
№ 20953 (Уровень: Базовый)
Прибор автоматической фиксации нарушений правил дорожного движения делает цветные фотографии размером 1920×1080 пикселей. 
Снимки сохраняются в памяти камеры, группируются в пакеты по 57 штук, затем передаются в центр обработки информации со скоростью передачи данных 2138400 бит/с. 
Каково минимально возможное количество цветов в палитре изображения, если на передачу одного пакета отводится более 10 минут?
В ответе запишите целое число
"""
from math import log2, ceil

total_size = 2_138_400 * 600  # bit
for i in range(100):
    if (1920 * 1080 * i) * 57 > total_size:
        print(2**(i - 1) + 1)  # 1025
        break



# https://stepik.org/lesson/1993931/step/6?unit=2021967
"""
https://stepik.org/lesson/421031/step/3?auth=login&unit=410641
Автоматическая камера производит растровые изображения размером 800×600 пикселей. Для кодирования цвета каждого пикселя используется одинаковое целое количество байт, коды пикселей записываются в файл один за другим без промежутков. Объём файла с изображением не может превышать 700 Кбайт без учёта размера заголовка файла. 
Какое максимальное количество цветов можно использовать в палитре?
"""
from math import ceil
for i in range(2, 100):
    I = 800 * 600 * ceil(i / 8)
    if I > 700 * 2**10:
        print(2**(i-1))  # 256
        break


# https://stepik.org/lesson/1993931/step/7?unit=2021967
"""
https://stepik.org/lesson/421031/step/8?auth=login&unit=410641
Для хранения в информационной системе документы сканируются с разрешением 300 ppi. Методы сжатия изображений не используются. Средний размер отсканированного документа составляет 5 Мбайт. В целях экономии было решено перейти на разрешение 150 ppi и цветовую систему, содержащую 16 цветов. Средний размер документа, отсканированного с изменёнными параметрами, составляет 512 Кбайт. 
Определите количество цветов в палитре до оптимизации
"""
"""
300**2 * i == 5 * 1024
150**2 * 4 == 512
"""
i = 150**2 * 4 * 5 * 1024 / (300**2 * 512)  # 10
print(2**i)  # 1024


# https://stepik.org/lesson/1993931/step/8?unit=2021967
"""
https://stepik.org/lesson/648369/step/1?auth=login&unit=645014
Изображения размером 3х4 дюйма сканируются с разрешением 300 ppi и использованием 216 цветов. Заголовок файла занимает 4 Кбайта. Для хранения таких изображений выделено 55 Мбайт памяти. 
Сколько изображений удастся сохранить? В ответе введите целое число.
"""
res = 55 * 2**10 / (3 * 4 * 300**2 * 16 / 2**13 + 4)
print(int(res)) # 26


# https://stepik.org/lesson/1993931/step/9?unit=2021967
"""
https://stepik.org/lesson/648369/step/14?auth=login&unit=645014
В информационной системе хранятся изображения размером 1600 × 1200 пикселей. Для кодирования цвета каждого пикселя используется одинаковое количество бит. 
При кодировании используется алгоритм сжатия изображений, позволяющий уменьшить размер памяти для хранения одного изображения в среднем в 5 раз по сравнению с независимым кодированием каждого пикселя. Так же, каждое изображение дополняется служебной информацией, которая занимает 100 Кбайт. Для хранения 32 изображений выделено 10 Мбайт памяти.
Какое максимальное количество цветов можно использовать в палитре каждого изображения?
"""
for i in range(2, 100):
    if (1600 * 1200 * i / 2**13 / 5 + 100) * 32 > 10 * 1024:
        print(2**(i-1))  # 16
        break



# https://stepik.org/lesson/1993931/step/10?unit=2021967
"""
https://stepik.org/lesson/648369/step/16?auth=login&unit=645014

Фотограф делает цветные фотографии размером 7680×4320 пикселей, используя палитру из 2<sup>16</sup> цветов. Для сохранения снимков фотограф использует сменные карты памяти, каждая из которых вмещает не более 9 Гбайт данных. 
Когда на карте памяти остаётся недостаточно места для записи новой фотографии, фотограф берёт следующую, свободную карту. Известно, что фотограф сделал 4010 снимков. 
Сколько снимков оказалось на последней карте памяти из использованных? В ответе запишите целое число.
"""
I = (7680 * 4320 * 16 / 2**33)
card = 9 // I  # 145 photo
print(4010 % card)  # 95



""" Кодирование звука """
#  https://stepik.org/lesson/1997663/step/2?unit=2025739
"""
https://stepik.org/lesson/648369/step/9?auth=login&unit=645014

На студии создается мультипликационный ролик, где каждый кадр – отдельно отрисованная картинка. 
Известно, что каждая картинка имеет разрешение 640х480 пикселей и цветовую палитру в 216 = 65536 цветов. Каждый пиксель кодируется с помощью минимально возможного и одинакового для всех пикселей количества бит. Картинки записываются одна за другой без разделителей и заголовков файла. Частота смены кадров в конечном ролике – 24 кадра/сек. 
В качестве звукового сопровождения выбран формат стерео с глубиной кодирования 10 бит и частотой дискретизации 40 кГц. 
Найдите размер мультфильма в МБайтах, если известно, что его длительность 5 минут. В качестве ответа укажите число – минимальное целое количество Мбайт достаточное для хранения такого файла.
"""
from math import ceil
Ip = 640 * 480 * 16 * 24 * 60 * 5 / 2 ** 23
Iv = 2 * 40000 * 10 * 60 * 5 / 2 ** 23
print(ceil(Ip + Iv))  # 4248



# https://stepik.org/lesson/1997663/step/3?unit=2025739
"""
https://stepik.org/lesson/648369/step/13?auth=login&unit=645014
Музыкальный фрагмент был записан в формате моно, оцифрован и сохранён в виде файла с использованием сжатия данных. При этом производилось сжатие данных, объем сжатого фрагмента стал равен 40% от первоначальной записи. 
Затем тот же музыкальный фрагмент был записан повторно в формате стерео (двухканальная запись) и оцифрован с разрешением в 8 раз выше и частотой дискретизации в 2 раз выше, чем в первый раз. При этом производилось сжатие данных, объем сжатого фрагмента стал равен 60% от повторной записи. 
Во сколько раз размер повторной записи будет больше первой?
"""
I1 = 1  # Первичная запись
I2 = I1 * 2 * 8 * 2  # Повторная запись
print(I2 * 0.6 / 0.4)  # 48 раз



# https://stepik.org/lesson/1997663/step/4?unit=2025739
"""
https://kompege.ru/task
№ 22475 (Уровень: Средний)
Преобразуется 3 видеофайла. Каждое из них представляет из себя видео разрешением 3840 x 2160 пикселей, а также цветовой палитрой из 220 цветов и частотой 60 кадров в секунду. 
Длительность каждого видео - 30 секунд. Звук к видео был записан в формате стерео, частотой дискретизации 48 кГц и глубиной кодирования 16 бит.
После отправки видео сжимается до разрешения 1920x1080 пикселей, цветовая палитра содержит 216 цветов. Звук также становится хуже. Его новые параметры после отправки - стерео формат, 36 кГц, глубина кодирования - 8 бит. 
Сколько Гбайт будет сэкономлено после такого преобразования? В ответе указать целое число.
"""
I_p1 = 3840 * 2160 * 20  * 60 * 30
I_v1 = 2 * 48_000 * 16 * 30
Total_1 = (I_p1 + I_v1) * 3

I_p2 = 1920 * 1080 * 16 * 60 * 30
I_v2 = 2 * 36_000 * 8 * 30
Total_2 = (I_p2 + I_v2) * 3
print(int((Total_1 - Total_2) / 2**33))  # 83


# https://stepik.org/lesson/1997663/step/5?unit=2025739
"""
https://kompege.ru/task
№ 22346 (Уровень: Средний)
На компьютер был сохранен звуковой файл в формате стерео, с разрешением 10 бит, частотой дискретизации 30 кГц, длительностью 150 секунд. 
Перед отправкой по каналу связи со скоростью 140 000 бит/с файл сжали. Количество каналов уменьшилось в 2 раза, частота дискретизации в 1,5 раза, разрешение в 5 раз, время - в 3 раза. 
Сколько часов удалось сэкономить при отправке 12 треков?  В ответе запишите только целую часть полученного числа.
"""
I1 = 2 * 30_000 * 10 * 150
I2 = I1 / 2 / 1.5 / 5 / 3

T1 = I1 * 12 / 140_000
T2 = I2 * 12 / 140_000
print((T1 - T2) // 3600)  # 2 hour






""" Передача данных по сети """
#
"""
https://stepik.org/lesson/648369/step/10?auth=login&unit=645014

Данные объемом 40 Мбайт передаются из пункта А в пункт Б по каналу связи, обеспечивающему скорость передачи данных 2<sup>21</sup> бит в секунду, а затем из пункта Б в пункт В по каналу связи, обеспечивающему скорость передачи данных 2<sup>23</sup> бит в секунду. 
От начала передачи данных из пункта А до их полного получения в пункте В прошло 5 минут. 
Сколько времени в секундах составила задержка в пункте Б, т.е. время между окончанием приема данных из пункта А и началом передачи данных в пункт В?
"""
# Задержка - время между окончанием приема данных в пункте  "Б"  до начала передачи данных  из пункта  "Б" в "В"
t_ab = 40 * 2**23 / 2**21  # 160 sec
t_bv = 40 * 2**23 / 2**23  # 40 sec
print(60*5 - (t_ab + t_bv))  # 100 sec


#
"""
https://kompege.ru/task
№ 821 Джобс 14.12.2020 (Уровень: Сложный)

Файлы изображений передают по каналу связи со средней скоростью 224 бит/сек. Известно, что процесс приема разбит на сеансы – 10 секунд передачи затем 2 секундная задержка. Если файл не успел полностью загрузиться за один сеанс, то его загрузка начинается заново во время следующего сеанса. 
Передаются растровые изображения разрешением 1600х1200 в цветовой палитре, содержащей 2000 цветов. Известно, что каждый пиксель кодируется с помощью одинакового и минимально возможного количества бит, все коды пикселей записываются последовательно один за другим без разделителей.
Сколько изображений можно передать за 40 секунд, если все изображения передаются один за другим без заголовков файла?
"""
from math import ceil, log2
I = 1600*1200*ceil(log2(2000))
pack_10 = 2**24 * 10 // I  # 7 photo
tail = 40 % (10 + 2)  # 4 sec
pack_add = 2**24 * tail // I  # 3 photo
print(pack_10 * 3 + pack_add)  # 24 photo

