""" Task 09 """
"""
Ссылка на мой урок
Ссылка на источник
"""



# https://stepik.org/lesson/2002474/step/2?unit=2030625
"""
https://stepik.org/lesson/1210202/step/5?unit=1223456
Откройте файл электронной таблицы 09-01.xls, содержащей в каждой строке четыре натуральных числа. Определите количество строк таблицы, для которых выполняются следующие условия:
1. Числа, содержащиеся в строке, можно разбить на две пары так что произведения чисел в них равны
2. Квадрат второго максимального из чисел, содержащихся в строке, больше произведения минимального и максимального чисел в строке.
"""
cnt = 0
with open('09/09-01.txt') as flile:
    for fl in flile:
        a, b, c, d = sorted(map(int, fl.split()))
        if a*d == b*c and c**2 > a*d:
            cnt += 1
print(cnt)  # 13


# https://stepik.org/lesson/2002474/step/2?unit=2030625
"""
https://stepik.org/lesson/797932/step/10?auth=login&unit=819598
В файле электронной таблицы, содержится в каждой строке шесть натуральных чисел. 
Определите наибольший номер строки таблицы, для чисел которой выполнены оба условия:
в строке есть одно число, которое повторяется трижды, остальные три числа различны;
повторяющееся число строки больше, чем среднее арифметическое её неповторяющихся чисел.
В ответе запишите только число.
"""
cnt = 0
Mx = None
with open('09/09-02.txt') as flile:
    for fl in flile:
        cnt += 1
        d = list(map(int, fl.split()))
        one = [i for i in d if d.count(i) == 1]
        rep = [i for i in d if d.count(i) == 3]
        if len(one) == 3 and len(rep) == 3 and rep[0] > sum(one) / 3:
            Mx = cnt
    print(Mx)  # 10493


# https://stepik.org/lesson/2002474/step/4?unit=2030625
"""
https://stepik.org/lesson/797932/step/13?auth=login&unit=819598
Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. 
Определите среднее арифметическое чисел всех строк таблицы, содержащих числа, для которых выполнены оба условия:
в строке есть одно число, которое повторяется трижды, остальные три числа различны
повторящееся число строки меньше, чем удвоенное минимальное из ее неповторяющихся чисел
В ответе запишите только елую часть числа.
"""
from statistics import mean
mn = []
with open('09/09-03.txt') as file:
    for fl in file:
        d = list(map(int, fl.split()))
        one = [i for i in d if d.count(i) == 1]
        rep = [i for i in d if d.count(i) == 3]
        if len(one) == 3 and len(rep) == 3 and rep[0] < 2 * min(one):
            mn.append(mean(d))
    print(int(mean(mn)))  # 53


# https://stepik.org/lesson/2002474/step/5?unit=2030625
"""
https://stepik.org/lesson/1039432/step/10?unit=1047905
Откройте  файл  электронной таблицы, содержащей в каждой строке семь натуральных чисел. 
Определите сумму всех чисел в строке таблицы с наименьшим номером, для чисел которой выполнены оба условия:
в строке есть два числа, каждое из которых повторяется дважды, остальные три числа различны;
максимальное число строки не повторяется.
В ответе запишите только число.
"""
with open('09/09-04.txt') as fl:
    for i in fl:
        d = list(map(int, i.split()))
        one = [i for i in d if d.count(i) == 1]
        rep = [i for i in d if d.count(i) == 2]
        if len(one) == 3 and len(rep) == 4 and max(d) in one:
            print(sum(d))  # 261
            break



# https://stepik.org/lesson/2002474/step/6?unit=2030625
"""
# https://kompege.ru/task
№ 18258 (Уровень: Сложный)
Откройте файл электронной таблицы, содержащей в каждой строке пять натуральных чисел. Определите наибольший номер строки таблицы, для чисел которой выполнены оба условия:
 числа в строке расположены в порядке неубывания.
  в строке есть повторяющиеся числа с чётной суммой цифр.
В ответе запишите только число.
"""
MX = None
cnt = 0
with open('09/09-05.txt') as file:
    for fl in file:
        cnt += 1
        d = list(map(int, fl.split()))
        if d == sorted(d):
            rep = [str(i) for i in d if d.count(i) > 1]
            if rep and [i for i in rep if not sum(map(int, i)) % 2]:
                MX = cnt
    print(MX)  # 6937


# https://stepik.org/lesson/2002474/step/7?unit=2030625
"""
# https://kompege.ru/task
Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите сумму всех чисел в строке таблицы с наибольшим номером, для чисел которой выполнены все условия:
Строка состоит из 2-х различных чисел.
Из строки можно выбрать две различные пары одинаковых значений.
Сумма выбранных чисел меньше суммы невыбранных чисел.
В ответе запишите только число.
<details>
  <summary>Подсказка</summary>
 Под данное условие может подойти строка: 1 3 3 3 1 3 3
</details>
"""
MX = None
with open('09/09-06.txt') as file:
    for fl in file:
        d = sorted(map(int, fl.split()))
        if len(set(d)) == 2 and len(set(d[:2])) == len(set(d[-2:])):
            if (d[0] + d[-1]) * 2 < sum(d[2:-2]):
                MX = sum(d)
    print(MX)  # 1700


# https://stepik.org/lesson/2002474/step/8?unit=2030625
"""
# Крылов 20 вариантов - 2023
Вар. 01
Откройте файл электронной таблицы, содержащей в каждой строке восемь натуральных чисел. 
Определите количество строк таблицы, для чисел которых выполнены оба условия:
 В строке есть два числа, каждое из которых повторяется трижды, остальные два числа различны.
 Максимальное число в строке не является повторяющимся числом.
В ответе запишите только число.
"""
cnt = 0
with open('09/09-08.txt') as file:
    for fl in file:
        d = sorted(map(int, fl.split()))
        rep = [i for i in d if d.count(i) == 3]
        one = [i for i in d if d.count(i) == 1]
        if len(rep) == 6 and len(one) == 2:
            cnt += d[-1] not in rep
    print(cnt)  # 4


# https://stepik.org/lesson/2002474/step/9?unit=2030625
"""
# Крылов 20 вариантов - 2023
Вар. 03
Откройте файл электронной таблицы, содержащей в каждой строке восемь натуральных чисел. 
Определите количество строк таблицы, для чисел которых выполнены оба условия:
 В строке есть одно число, которое повторяется трижды, есть другое число, которое повторяется дважды, остальные три числа различны.
 Среднее арифмитическое трёх неповторяющихся чисел строки не больше числа, повторяющегося в строке трижды.
В ответе запишите только число.
"""
cnt = 0
with open('09/09-09.txt') as file:
    for fl in file:
        d = sorted(map(int, fl.split()))
        three = [i for i in d if d.count(i) == 3]
        two = [i for i in d if d.count(i) == 2]
        one = [i for i in d if d.count(i) == 1]
        if len(three) == 3 and len(two) == 2 and len(one) == 3:
            cnt += sum(one) / 3 <= three[0]
    print(cnt)  # 42



# https://stepik.org/lesson/2002474/step/10?unit=2030625
"""
# Крылов 20 вариантов - 2023
Вар. 02
Откройте файл электронной таблицы, содержащей в каждой строке восемь натуральных чисел. 
Определите количество строк таблицы, для чисел которых выполнены оба условия:
 В строке есть три числа, каждое из которых повторяется дважды, остальные два числа различны.
 Минимальное число в строке не является повторяющимся числом.
В ответе запишите только число.
"""
cnt = 0
with open('09/09-08.txt') as file:
    for fl in file:
        d = sorted(map(int, fl.split()))
        rep = [i for i in d if d.count(i) == 2]
        one = [i for i in d if d.count(i) == 1]
        if len(rep) == 6 and len(one) == 2:
            cnt += d[0] not in rep
    print(cnt)  # 17




# ПОСЛЕДНЯЯ ЗАДАЧА
"""
https://stepik.org/lesson/797932/step/3?auth=login&unit=819598
В файле электронной таблицы 09-10.xls в каждой строке содержатся шесть натуральных чисел. Определите количество строк таблицы, для которых выполнены оба условия:
– в строке ровно два числа не повторяются;
– среднее геометрическое повторяющихся чисел не меньше произведения неповторяющихся чисел строки.
Подсказка
Среднее геометрическое – это такое положительное число, которое, будучи подставленным вместо каждого из заданных чисел, сохраняет их исходное произведение. 
Оно рассчитывается как корень n-й степени из произведения n положительных чисел. 
ls = [n1, n2, n3]
g_mean = (n1 * n2 * n3) ** (1/len(ls))
"""
from statistics import geometric_mean
from math import prod

cnt = 0
with open('09/09-10.txt') as file:
    for f in file:
        d = list(map(int, f.split()))
        one = [i for i in d if d.count(i) == 1]
        rep = [i for i in d if d.count(i) > 1]
        if len(one) == 2 and geometric_mean(rep) >= prod(one):
            cnt += 1
print(cnt)  # 12



