""" Task 09_02 """

"""

"""

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""



# https://stepik.org/lesson/2393651/step/1?unit=2429094
"""
https://stepik.org/lesson/797932/step/3?auth=login&unit=819598
В файле электронной таблицы 09-10.xls в каждой строке содержатся шесть натуральных чисел. Определите количество строк таблицы, для которых выполнены оба условия:
– в строке ровно два числа не повторяются;
– среднее геометрическое повторяющихся чисел не меньше произведения неповторяющихся чисел строки.
Подсказка
Среднее геометрическое – это такое положительное число, которое, будучи подставленным вместо каждого из заданных чисел, сохраняет их исходное произведение. 
Оно рассчитывается как корень n-й степени из произведения n положительных чисел. 
ls = [n1, n2, n3]
g_mean = (n1 * n2 * n3) ** (1/len(ls))
"""
from statistics import geometric_mean
from math import prod

cnt = 0
with open('09/09-11.txt') as file:
    for f in file:
        d = list(map(int, f.split()))
        one = [i for i in d if d.count(i) == 1]
        rep = [i for i in d if d.count(i) > 1]
        if len(one) == 2 and geometric_mean(rep) >= prod(one):
            cnt += 1
print(cnt)  # 12



