""" Task 09_02 """

"""
модуль 90-01
4634 9832 16256 18258 23193
4634 8467 9832 16256 18258  23193

модуль 90-01
525


Есть на вариантах экзаменов
31506
"""


# https://stepik.org/lesson/2393651/step/1?unit=2429094
"""
https://kompege.ru/task
Ссылка на источник
Файл электронной таблицы, содержит в каждой строке шесть натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнено хотя бы одно из условий:
–   в строке есть хотя бы одно повторяющееся число;
–   будучи упорядоченными, все числа строки образуют арифметическую прогрессию.
В ответе запишите только число.
"""
cnt = 0
for f in open('09/09_02-01.txt'):
    d = sorted(map(int, f.split()))
    a = [i for i in d if d.count(i) > 1]
    b = all(a - b == d[0] - d[1] for a, b in zip(d, d[1:]))
    if a or b:
        cnt += 1
print(cnt)  # 525


# https://stepik.org/lesson/2393651/step/2?unit=2429094
"""
https://kompege.ru/task
22547 (Уровень: Средний)
Откройте файл электронной таблицы, содержащей в каждой строке шесть натуральных чисел. 
Определите сумму чисел в строке таблицы с наибольшим номером, содержащей числа, для которых выполнены оба условия:
- в строке все числа расположены в порядке возрастания;
- количество чётных и нечётных чисел в строке одинаково.
"""
# если числа расположены в порядке возрастания, то среди них отсутствуют одинаковые числа ✔️
res = 0
for f in open('09/09_02-02.txt'):
    d = [*map(int, f.split())]
    if d == sorted(d) and len(set(d)) == 6 and sum(i % 2 for i in d) == 3:
        res = sum(d)
print(res)  # 335



# https://stepik.org/lesson/2393651/step/3?unit=2429094
"""
https://kompege.ru/task
21592 (Уровень: Средний)
Откройте файл электронной таблицы, содержащей в каждой строке восемь натуральных чисел. 
Определите наибольший номер строки таблицы, содержащей числа, для которых выполнены оба условия:
– в строке есть ровно три числа, каждое из которых повторяется дважды, остальные числа без повторений;
– квадрат разности наибольшего и наименьшего из повторяющихся чисел строки больше 
  удвоенной суммы квадратов её неповторяющихся чисел.
"""
res = c = 0
for f in open('09/09_02-03.txt'):
    c += 1
    d = [*map(int, f.split())]
    n1 = [i for i in d if d.count(i) == 1]
    n2 = [i for i in d if d.count(i) == 2]
    if len(n2) == 6:
        if (max(n2) - min(n2)) ** 2 > sum(i**2 for i in n1) * 2:
            res = c
print(res)  # 29938






# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""
""" Взято на мой курс """


# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""
""" Взято на мой курс """







# https://stepik.org/lesson/2393651/step/1?unit=2429094
"""
https://stepik.org/lesson/797932/step/3?auth=login&unit=819598
В файле электронной таблицы 09-10.xls в каждой строке содержатся шесть натуральных чисел. Определите количество строк таблицы, для которых выполнены оба условия:
– в строке ровно два числа не повторяются;
– среднее геометрическое повторяющихся чисел не меньше произведения неповторяющихся чисел строки.
Подсказка
Среднее геометрическое – это такое положительное число, которое, будучи подставленным вместо каждого из заданных чисел, сохраняет их исходное произведение. 
Оно рассчитывается как корень n-й степени из произведения n положительных чисел. 
ls = [n1, n2, n3]
g_mean = (n1 * n2 * n3) ** (1/len(ls))
"""
from statistics import geometric_mean
from math import prod
cnt = 0
with open('09/09-11.txt') as file:
    for f in file:
        d = list(map(int, f.split()))
        one = [i for i in d if d.count(i) == 1]
        rep = [i for i in d if d.count(i) > 1]
        if len(one) == 2 and geometric_mean(rep) >= prod(one):
            cnt += 1
print(cnt)  # 12


# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""
""" Взято на мой курс """


