""" Task 10_task___old_13_task """

"""
10164 10570 10578 10773 10776 10781 11779 12245 12451 14649 19748 
"""
"""
Есть на вариантах экзаменов
31507
"""
# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""



# https://stepik.org/lesson/2339015/step/1?unit=2374422
"""
https://kompege.ru/task
11779 (Уровень: Базовый)

В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу узла в этой сети. 
Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети.
Сеть задана IP-адресом 151.192.0.0 и маской сети 255.224.0.0. Сколько в этой сети IP-адресов, у которых количество единиц и количество нулей в двоичной записи IP-адреса одинаково?
В ответе укажите только число.
"""
from ipaddress import *
c = 0
net = ip_network('151.192.0.0/255.224.0.0', 0)
for i in net:
    c += f'{i:b}'.count('1') == 16
print(c)  # 293930



# https://stepik.org/lesson/2339015/step/2?unit=2374422
"""
https://kompege.ru/task
12245 ЕГКР 16.12.23 (Уровень: Базовый)

В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая - к адресу узла в этой сети. 
Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и его маске.
Сеть задана IP-адресом 192.168.32.48 и сетевой маской 255.255.255.240.
Сколько в этой сети IP-адресов, для которых количество единиц в двоичной записи IP-адреса не кратно 2?
В ответе укажите только число.
"""
from ipaddress import *
net = ip_network('192.168.32.48/255.255.255.240', False)
c = 0
for i in net:
    c += f'{i:b}'.count('1') % 2
print(c)  # 8


# https://stepik.org/lesson/2339015/step/3?unit=2374422
"""
https://kompege.ru/task
10776 (Уровень: Базовый)

В терминологии сетей TCP/IP маска сети – это двоичное число, меньшее 2<sup>32</sup>; в маске сначала (в старших разрядах) стоят единицы, а затем с некоторого места нули.
Маска определяет, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу самого узла в этой сети. Обычно маска записывается по тем же правилам, что и IP-адрес – в виде четырёх байт, причём каждый байт записывается в виде десятичного числа. 
Адрес сети получается в результате применения поразрядной конъюнкции к заданному IP-адресу узла и маске.
Например, если IP-адрес узла равен 131.32.255.131, а маска равна 255.255.240.0, то адрес сети равен 131.32.240.0.

Для узла с IP-адресом 111.91.200.28 адрес сети равен 111.91.192.0. Найдите наименьшее возможное количество нулей в двоичной записи маски подсети.
"""
from ipaddress import *
for n in range(32, 0, -1):
    net = ip_network(f'111.91.200.28/{n}', False)
    if str(net) == f'111.91.192.0/{n}':
    # if str(net.network_address) == '111.91.192.0':
        print(32 - n)  # 12
        break


# https://stepik.org/lesson/2339015/step/4?unit=2374422
"""
https://kompege.ru/task
10578 (Уровень: Базовый)

В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая - к адресу узла в этой сети. 
Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети. 
Два узла, находящиеся в разных подсетях, имеют IP-адреса 10.96.180.231 и 10.96.140.118. В масках обеих подсетей одинаковое количество единиц. 
Найдите наибольшее возможное количество нулей в двоичной записи маски подсети.
"""
from ipaddress import *
for m in range(1, 33):
    net_1 = ip_network(f'10.96.180.231/{m}', False)
    net_2 = ip_network(f'10.96.140.118/{m}', False)
    if net_1 != net_2:
        print(32 - m)
        break



# https://stepik.org/lesson/2339015/step/5?unit=2374422
"""
https://kompege.ru/task
10570 (Уровень: Базовый)

В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая - к адресу узла в этой сети. 
Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети. 
Для узла с IP-адресом 154.201.208.17 адрес сети равен 154.201.192.0. Чему равно наибольшее возможное значение третьего слева байта маски? 
Ответ запишите в виде десятичного числа.
"""
from ipaddress import *
for n in range(32, 0, -1):
    net = ip_network(f'154.201.208.17/{n}', False)
    if str(net.network_address) == '154.201.192.0':
        msk = str(net.netmask).split('.')
        print(msk[2])  # 224
        break



# https://stepik.org/lesson/2339015/step/6?unit=2374422
"""
https://kompege.ru/task
10164 (Уровень: Средний)

В терминологии сетей TCP/IP маска сети – это двоичное число, меньшее 232; в маске сначала (в старших разрядах) стоят единицы, а затем с некоторого места нули. Маска определяет, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу самого узла в этой сети. Обычно маска записывается по тем же правилам, что и IP-адрес – в виде четырёх байт, причём каждый байт записывается в виде десятичного числа. Адрес сети получается в результате применения поразрядной конъюнкции к заданному IP-адресу узла и маске.
Если маска подсети 255.255.252.0 и IP-адрес компьютера в сети 156.132.15.138, то чему будет равен номер компьютера в сети?
"""
from ipaddress import *
n = 0
net = ip_network('156.132.15.138/255.255.252.0', 0)
for i in net.hosts():
    n += 1
    # if i == ip_address('156.132.15.138'):
    if str(i) == '156.132.15.138':
        print(n)  # 906
        break



# https://stepik.org/lesson/2339015/step/7?unit=2374422
"""
https://kompege.ru/task
10781 (Уровень: Средний)

В терминологии сетей TCP/IP маска сети – это двоичное число, меньшее 232; в маске сначала (в старших разрядах) стоят единицы, а затем с некоторого места нули.
Маска определяет, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу самого узла в этой сети. Обычно маска записывается по тем же правилам, что и IP-адрес – в виде четырёх байт, причём каждый байт записывается в виде десятичного числа. Адрес сети получается в результате применения поразрядной конъюнкции к заданному IP-адресу узла и маске.
Например, если IP-адрес узла равен 131.32.255.131, а маска равна 255.255.240.0, то адрес сети равен 131.32.240.0.

Два узла, находящиеся в одной сети, имеют IP-адреса 112.117.107.70 и 112.117.121.80. Укажите наименьшее возможное количество адресов в этой сети.
"""
from ipaddress import *
for m in range(32, 0, -1):
    net1 = ip_network(f'112.117.107.70/{m}', 0)
    net2 = ip_network(f'112.117.121.80/{m}', 0)
    if net1 == net2:
        print(net1.num_addresses)  # 8192
        # print(2**(32 - m))  # 8192
        break


# https://stepik.org/lesson/2339015/step/8?unit=2374422
"""
https://kompege.ru/task
# 14649 Открытый курс "Слово пацана" (Уровень: Средний)

В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу узла в этой сети. 
Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети.

Сеть, в которой содержится узел с IP-адресом 116.242.A.26, задана маской сети 255.255.255.224, где A - некоторое допустимое для записи IP-адреса число. 
Определите максимальное значение A, для которого для всех IP-адресов этой сети в двоичной записи IP-адреса суммарное количество единиц в левых двух байтах не меньше суммарного количества единиц в правых двух байтах.
В ответе укажите только число.
"""
from ipaddress import *
for a in range(255, -1, -1):
    net = ip_network(f'116.242.{a}.26/255.255.255.224', 0)
    if all(f'{i:b}'[:16].count('1') >= f'{i:b}'[16:].count('1') for i in net):
        print(a)  # 240
        break


# https://stepik.org/edit-lesson/2339015/step/9
"""
https://kompege.ru/task
10773 (Уровень: Базовый)

В терминологии сетей TCP/IP маска сети – это двоичное число, меньшее 232; в маске сначала (в старших разрядах) стоят единицы, а затем с некоторого места нули. Маска определяет, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу самого узла в этой сети. 
Обычно маска записывается по тем же правилам, что и IP-адрес – в виде четырёх байт, причём каждый байт записывается в виде  десятичного числа. Адрес сети получается в результате применения поразрядной конъюнкции к заданному IP-адресу узла и маске.
Например, если IP-адрес узла равен 131.32.255.131, а маска равна 255.255.240.0, то адрес сети равен 131.32.240.0.
Для узла с IP-адресом 133.57.64.130 адрес сети равен 133.57.64.0. Для скольких различных значений маски это возможно?
"""
from ipaddress import *
c = 0
for m in range(1, 33):
    net = ip_network(f'133.57.64.130/{m}', False)
    c += str(net) == f'133.57.64.0/{m}'
print(c)  # 7



# https://stepik.org/edit-lesson/2339015/step/10
"""
https://kompege.ru/task
19748 (Уровень: Средний)

В терминологии сетей TCP/IP маской сети называется двоичное число, определяющее, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу самого узла в этой сети. При этом в маске сначала (в старших разрядах) стоят единицы, а затем с некоторого места – нули.
Адрес сети получается в результате применения поразрядной конъюнкции к заданному IP-адресу узла и маске.
Например, если IP-адрес узла равен 231.32.255.131, а маска равна 255.255.240.0, то адрес сети равен 231.32.240.0.
Узлы с IP-адресами 157.220.185.237 и 157.220.184.230 принадлежат одной сети. Какое наименьшее количество IP-адресов, в двоичной записи которых ровно 15 единиц, может содержаться в этой сети?
"""
from ipaddress import *
for m in range(32, 12, -1):
    c = 0
    net1 = ip_network(f'157.220.185.237/{m}', 0)
    net2 = ip_network(f'157.220.184.230/{m}', 0)
    if net1 == net2:
        c += sum(f'{i:b}'.count('1') == 15 for i in net1)
    if c:
        print(c)  # 9
        break


# https://stepik.org/edit-lesson/2339015/step/11
"""
https://kompege.ru/task
12451 (Уровень: Средний)

В терминологии сетей TCP/IP маской сети называют двоичное число, которое показывает, какая часть IP-адреса узла сети относится к адресу сети, а какая – к адресу узла в этой сети. 
Адрес сети получается в результате применения поразрядной конъюнкции к заданному адресу узла и маске сети.
Сеть, в которой содержится узел с IP-адресом 246.81.65.A, задана маской сети 255.255.255.224, где A - некоторое допустимое для записи IP-адреса число. 
Определите количество значений A, для которых у всех узлов в этой сети в двоичной записи количество нулей в третьем байте больше, чем в четвертом.
"""
# 🌶️🌶️🌶️ Ловушка: адрес IP может оказаться как network/broadcast в формируемой сети из этого адреса IP ✅
from ipaddress import *
c = 0
for x in range(256):
    IP = f'246.81.65.{x}'
    net = ip_network(f'{IP}/255.255.255.224', 0)
    if ip_address(IP) not in (net[0], net[-1]):  # Проверяем, что IP не network/broadcast ✅
        c += all(f'{i:b}'[16:24].count('0') > f'{i:b}'[24:].count('0') for i in net.hosts())
print(c)  # 120





# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""







