""" Task 11 """


"""
126 212 303 1342 1855 13883 17524 17552 
"""
"""
Есть на вариантах экзаменов
31508
"""

"""
https://stepik.org/lesson/2286293/step/1?unit=2320826
https://kompege.ru/task
№ 126 (Уровень: Базовый)

При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 7 символов и содержащий только символы из 12-буквенного набора А, В, Е, К, М, Н, О, Р, С, Т, У, X. 
В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт. 
При этом используют посимвольное кодирование паролей, все символы кодируются одинаковым и минимально возможным количеством бит. 
Кроме собственно пароля для каждого пользователя в системе хранятся дополнительные сведения, для чего отведено 15 байт. 
Определите объём памяти в байтах, необходимый для хранения сведений о 150 пользователях.
"""
from math import log2, ceil
user = ceil(ceil(log2(12)) * 7 / 8)  # 4 byte
res = (user + 15) * 150
print(res)  # 2850


"""
https://stepik.org/lesson/2286293/step/2?unit=2320826
https://kompege.ru/task
№ 212 Джобс 14.09.2020 (Уровень: Базовый)

Для регистрации на сайте необходимо продумать пароль, состоящий из 9 символов. Он должен содержать хотя бы 1 цифру, строчные или заглавные буквы латинского алфавита (алфавит содержит 26 букв) и хотя бы 1 символ из перечисленных: «.», «$», «#», «@», «%», «&». 
В базе данных для хранения сведения о каждом пользователе отведено одинаковое и минимальное возможное целое число байт. При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и минимально возможным количеством бит. 
Кроме собственного пароля, для каждого пользователя в системе хранятся дополнительные сведения, для чего выделено целое число байт одинаковое для каждого пользователя. Для хранения сведений о двадцати пользователях потребовалось 500 байт. 
Сколько байт выделено для хранения дополнительных сведений об одном пользователе. 
В ответе запишите только целое число – количество байт.
"""
from math import ceil, log2
psw = ceil(ceil(log2(10 + 52 + 6)) * 9 / 8)
add = 500 // 20 - psw
print(add)  # 17



"""
https://stepik.org/lesson/2286293/step/3?unit=2320826
https://kompege.ru/task
№ 303 Джобс 28.09.2020 (Уровень: Средний)

Каждый сотрудник предприятия получает электронный пропуск, на котором записаны личный код сотрудника, код подразделения и некоторая дополнительная информация. 
Личный код состоит из 11 символов, каждый из которых может быть заглавной латинской буквой (используется 15 различных букв) или одной из цифр от 0 до 9. 
Для записи кода на пропуске отведено минимально возможное целое число байт. При этом используют посимвольное кодирование, все символы кодируют одинаковым минимально возможным количеством бит. 
Код подразделения состоит из 8 символов: в каждой из пяти первых позиций стоит одна из 26 латинских букв, затем – три десятичных цифры. 
Код подразделения записан на пропуске как двоичное число (используется посимвольное кодирование) и занимает минимально возможное целое число байт. Всего на пропуске хранится 30 байт данных. 
Сколько байт выделено для хранения дополнительных сведений об одном сотруднике? 
В ответе запишите только целое число – количество байт.
"""
from math import log2, ceil
code_1 = ceil(ceil(log2(25)) * 11 / 8)  # 7 byte
code_2 = ceil(ceil(log2(26)) * 5 / 8 + ceil(log2(10)) * 3 / 8)  # 5 byte
print(30 - (code_1 + code_2))  # 18



"""
https://stepik.org/lesson/2286293/step/4?unit=2320826
https://kompege.ru/task
№ 1855 Основная волна 2021 (Уровень: Базовый)

При регистрации в компьютерной системе каждому пользователю выдается идентификатор из 101 символа, каждый из которых может быть десятичной цифрой или одним из 4090 символов из специального набора. 
Каждый символ кодируется с помощью одинакового и минимального количества бит. 
Идентификатор же записывается в памяти с помощью минимально возможного целого количества байт.
Сколько килобайт потребуется для хранения идентификаторов 2048 пользователей?
"""
from math import log2, ceil
idf = ceil(101 * ceil(log2(4090 + 10)) / 8) #  165 byte - one indif
print(2048 * idf / 2**10)  # 330 byte


"""
https://stepik.org/lesson/2286293/step/5?unit=2320826
https://kompege.ru/task
№ 13883 (Уровень: Базовый)

При регистрации в компьютерной системе каждому объекту присваивается идентификатор, состоящий из 35 символов и содержащий только строчные и заглавные буквы из 26-символьного латинского алфавита. 
В базе данных для хранения сведений о каждом идентификаторе отведено одинаковое и минимально возможное целое число байт. 
При этом используется посимвольное кодирование идентификаторов, все символы кодируются одинаковым и минимально возможным количеством бит.
Определите объём памяти (в байтах), необходимый для хранения сведений о 25 объектах. 
В ответе запишите только целое число — количество байт.
"""
from math import log2, ceil
ind = ceil(35 * ceil(log2(52)) / 8)
print(ind * 25)  # 675


"""
https://stepik.org/lesson/2286293/step/6?unit=2320826
https://kompege.ru/task
№ 17552 Основная волна 08.06.24 (Уровень: Сложный)

На предприятии каждой изготовленной детали присваивают серийный номер, состоящий из 261 символов. Для его хранения отведено одинаковое и минимально возможное число байт. 
При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит. Известно, что для хранения 252 500 серийных номеров отведено более 31 Мбайт памяти. 
Определите минимально возможную мощность алфавита, из которого составляются серийные номера. 
В ответе запишите только число.
"""
from math import ceil, log2
for i in range(1, 100):
    if ceil(261 * i / 8) * 252_500 > 31 * 2**20:
        print(2**(i-1) + 1)
        break


"""
https://stepik.org/lesson/2286293/step/7?unit=2320826

При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 6 символов и содержащий только символы из 7-буквенного набора Н, О, Р, С, Т, У, Х. В базе данных для хранения сведений о каждом пользователе отведено одинаковое целое число байт, при этом для хранения сведений о 100 пользователях используется 1400 байт. 
Для каждого пользователя хранятся пароль и дополнительные сведения. Для хранения паролей используют посимвольное кодирование, все символы кодируются одинаковым и минимально возможным количеством бит.
Сколько бит отведено для хранения дополнительных сведений о каждом пользователе?
"""
from math import ceil, log2
i = ceil(log2(7))
for x in range(1, 100):
    if ceil((6 * i + x) / 8) * 100 > 1400:
        print(x - 1)  # 94
        break


"""
https://stepik.org/lesson/2286293/step/8?unit=2320826

Каждый сотрудник предприятия получает электронный пропуск, на котором записаны личный код, состоящий из двух частей. Первая часть кода содержит 10 символов, каждый из которых может быть одной из 26 заглавных латинских букв. Вторая часть кода содержит 5 символов, каждый из которых может быть одной из десятичных цифр. 
При этом в базе данных сервера формируется запись, содержащая этот код и дополнительную информацию о пользователе. 
Для представления кода используют посимвольное кодирование, все символы в пределах одной части кода кодируют одинаковым минимально возможным для этой части количеством битов, а для кода в целом выделяется минимально возможное целое количество байтов. Для хранения данных о 40 пользователях потребовалось 1800 байт. 
Сколько байтов выделено для хранения дополнительной информации об одном пользователе? В ответе запишите только целое число – количество байтов.
"""
from math import ceil, log2
i1 = ceil(log2(26))
I1 = i1 * 10
i2 = ceil(log2(10))
I2 = i2 * 5
for n in range(1, 1000):
    if (ceil((I1 + I2) / 8) + n) * 40 > 1800:
        print(n - 1)  # 36
        break


# https://stepik.org/lesson/2286293/step/9?unit=2320826
"""
https://stepik.org/lesson/1363051/step/2?unit=1378947

 На предприятии каждой изготовленной детали присваивают серийный номер, содержащий десятичные цифры, 26 латинских букв (без учёта регистра) и символы из 8164-символьного специального алфавита. В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт. 
 При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит. 
Известно, что для хранения 835 серийных номеров отведено более 156 Кбайт памяти.

Определите минимально возможную длину серийного номера. В ответе запишите только целое число.
"""
from math import ceil, log2
i = ceil(log2(10 + 26 + 8164))
for n in range(1, 1000):
    if ceil(n * i / 8) * 835 > 156 * 1024:
        print(n)  # 110
        break


# https://stepik.org/lesson/2286293/step/10?unit=2320826
"""
https://kompege.ru/task
17524 Основная волна 07.06.24 (Уровень: Средний)

 На предприятии каждой изготовленной детали присваивают серийный номер, содержащий десятичные цифры, 52 латинские буквы (с учётом регистра) и символы из 458-символьного специального алфавита. В базе данных для хранения каждого серийного номера отведено одинаковое и минимально возможное число байт. 
При этом используется посимвольное кодирование серийных номеров, все символы кодируются одинаковым и минимально возможным числом бит. Известно, что для хранения 862 серийных номеров отведено не более 276 Кбайт памяти. 
Определите максимально возможную длину серийного номера. В ответе запишите только целое число.
"""
from math import ceil, log2
i = ceil(log2(10 + 52 + 458))
for n in range(1, 1000):
    if ceil(n * i / 8) * 862 > 276 * 1024:
        print(n - 1)  # 261
        break


# https://stepik.org/lesson/2286293/step/11?unit=2320826
"""
https://stepik.org/lesson/765682/step/9?unit=767994
В школе 800 учащихся, коды учащихся записаны в школьной информационной системе с помощью минимального количества бит.
Каков информационный объем в байтах сообщения о кодах 320 учащихся, присутствующих на конференции?
"""
from math import ceil, log2
i = ceil(log2(800))
print(ceil(320 * i / 8))  # 400


# https://stepik.org/lesson/2286293/step/11?unit=2320826
"""
https://stepik.org/lesson/2286293/step/13?unit=2320826

Регистрационная запись на рейс авиакомпании содержит три поля: идентификатор пользователя, размер багажа и номер места на борту.
Поле "идентификатор пользователя" состоит из 10 символов, каждый из которых может быть одной из 26 заглавных латинских букв или цифрой. 
При этом каждый символ кодируется с помощью одинакового и минимально возможного количества бит, на весь идентификатор выделяется минимально возможное целое количество байт.
Размер багажа содержит информацию о ширине, высоте и глубине ручной клади, предельное значение для которой 55х40х20 см. Сохраняются только целые значения каждой из сторон. 
Для хранения информации о размере используется битовая последовательность минимальной длины. Одна для всех трех чисел сразу.
Место на борту представляет собой номер ряд (число от 1 до 100) и номер места в ряду (буква от A до Z). 
При этом номер ряда и номер места кодируются отдельно с помощью минимально возможного количества бит для каждого поля.
Вся запись на рейс записывается с помощью минимально возможного и целого количества байт.
Определите какой объем памяти в КБайтах нужно зарезервировать для хранения регистрационных записей для 1000 пользователей?
В качестве ответа приведите целое число - целую часть полученного результата.
"""
from math import ceil
user = ceil(10 * 6 /8)
size = 6 + 6 + 5
seat = 7 + 5
I = user + ceil((size + seat) / 8)
print(1000 * I // 1024)  # 11


# https://stepik.org/lesson/2286293/step/13?unit=2320826
"""
https://stepik.org/lesson/422609/step/10?unit=412286

Каждый сотрудник предприятия получает электронный пропуск, на котором записаны личный код сотрудника и срок действия пропуска. 
Личный код состоит из 10 символов, каждый из которых может быть одной из 26 заглавных латинских букв или 10 цифр. 
Для записи кода на пропуске используют посимвольное кодирование, все символы кодируют одинаковым минимально возможным количеством битов. 
Срок действия записывается как номер года (число от 0 до 50, означающее год от 2000 до 2050) и номер месяца (число от 1 до 12). 
Номер года и номер месяца записаны на пропуске как двоичные числа, каждое из них занимает минимально возможное количество битов.
Вся информация на пропуске упакована так, чтобы занимать минимально возможное количество байтов. Сколько байтов занимает вся информация на пропуске? 
В ответе запишите только целое число — количество байтов
"""
from math import ceil
code = 10 * 6
data = 6 + 4  # год и месяц рассматриваем как самостоятельные наборы символов (51 и 12)
print(ceil((code + data) / 8))  # 9


# https://stepik.org/lesson/2286293/step/14?unit=2320826
"""
https://kompege.ru/task
1342 Danov2101 (Уровень: Сложный) 

Задание повышенной сложности 🌶️
При регистрации в компьютерной системе на каждого сотрудника заводится запись из двух полей: 
идентификатор и биометрия лица. 
Идентификатор состоит из семи эмодзи, каждый из которых закодирован в виде трех шестнадцатеричных цифр из диапазона U+1Fххх Unicode символов. 
Биометрия лица представлена десятью десятичными трехзначными числами. 
В базе данных для хранения каждого поля отведено минимально возможное целое число байт. При этом используют посимвольное кодирование полей. Все символы (или числа) поля кодируют одинаковым и минимально возможным количеством бит. 
Определите объём памяти (в Кбайт), необходимый для хранения 256 записей. 
В ответе запишите только целое число – количество Кбайт.
"""
from math import ceil
I1 = ceil(12 * 7 / 8)   # 000-FFF = 16*16*16 = 4096 = 2**12  => i=12
I2 = ceil(10 * 10 / 8)  #  100-999 = 899 => i=10
res = (I1 + I2) * 256 // 1024
print(res)  # 6



# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""