""" Task 11 """
"""
Ссылка на мой урок
Ссылка на источник
"""
""" Взято на мой курс """


"""
https://stepik.org/edit-lesson/2054700/step/2
https://kompege.ru/task
№ 126 (Уровень: Базовый)

При регистрации в компьютерной системе каждому пользователю выдаётся пароль, состоящий из 7 символов и содержащий только символы из 12-буквенного набора А, В, Е, К, М, Н, О, Р, С, Т, У, X. 
В базе данных для хранения сведений о каждом пользователе отведено одинаковое и минимально возможное целое число байт. 
При этом используют посимвольное кодирование паролей, все символы кодируются одинаковым и минимально возможным количеством бит. 
Кроме собственно пароля для каждого пользователя в системе хранятся дополнительные сведения, для чего отведено 15 байт. 
Определите объём памяти в байтах, необходимый для хранения сведений о 150 пользователях.
"""
from math import log2, ceil
user = ceil(ceil(log2(12)) * 7 / 8)  # 4 byte
res = (user + 15) * 150
print(res)  # 2850


"""
https://stepik.org/lesson/2054700/step/3?unit=2083315
https://kompege.ru/task
№ 212 Джобс 14.09.2020 (Уровень: Базовый)

Для регистрации на сайте необходимо продумать пароль, состоящий из 9 символов. Он должен содержать хотя бы 1 цифру, строчные или заглавные буквы латинского алфавита (алфавит содержит 26 букв) и хотя бы 1 символ из перечисленных: «.», «$», «#», «@», «%», «&». 
В базе данных для хранения сведения о каждом пользователе отведено одинаковое и минимальное возможное целое число байт. При этом используют посимвольное кодирование паролей, все символы кодируют одинаковым и минимально возможным количеством бит. 
Кроме собственного пароля, для каждого пользователя в системе хранятся дополнительные сведения, для чего выделено целое число байт одинаковое для каждого пользователя. Для хранения сведений о двадцати пользователях потребовалось 500 байт. 
Сколько байт выделено для хранения дополнительных сведений об одном пользователе. 
В ответе запишите только целое число – количество байт.
"""
from math import ceil, log2
psw = ceil(ceil(log2(10 + 52 + 6)) * 9 / 8)
add = 500 // 20 - psw
print(add)  # 17



"""
https://stepik.org/lesson/2054700/step/4?unit=2083315
https://kompege.ru/task
№ 303 Джобс 28.09.2020 (Уровень: Средний)

Каждый сотрудник предприятия получает электронный пропуск, на котором записаны личный код сотрудника, код подразделения и некоторая дополнительная информация. 
Личный код состоит из 11 символов, каждый из которых может быть заглавной латинской буквой (используется 15 различных букв) или одной из цифр от 0 до 9. 
Для записи кода на пропуске отведено минимально возможное целое число байт. При этом используют посимвольное кодирование, все символы кодируют одинаковым минимально возможным количеством бит. 
Код подразделения состоит из 8 символов: в каждой из пяти первых позиций стоит одна из 26 латинских букв, затем – три десятичных цифры. 
Код подразделения записан на пропуске как двоичное число (используется посимвольное кодирование) и занимает минимально возможное целое число байт. Всего на пропуске хранится 30 байт данных. 
Сколько байт выделено для хранения дополнительных сведений об одном сотруднике? 
В ответе запишите только целое число – количество байт.
"""
from math import log2, ceil
code_1 = ceil(ceil(log2(25)) * 11 / 8)  # 7 byte
code_2 = ceil(ceil(log2(26)) * 5 / 8 + ceil(log2(10)) * 3 / 8)  # 5 byte
print(30 - (code_1 + code_2))  # 18






