""" Task 12 """


"""
23750 23814 23815 23850 23859 24173 24174 26348 27293 28933 
"""
"""
Есть на вариантах экзаменов
31509
"""

# https://stepik.org/lesson/2054747/step/2?unit=2083362
"""
https://kompege.ru/task
23750 Демоверсия 2026 (Уровень: Средний)
На ленте в соседних ячейках записана последовательность из 1000 символов, включающая только нули и единицы. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». В начальный момент времени головка расположена в ближайшей ячейке справа от последовательности.
Программа работы исполнителя: 
 	λ	        1	        0
q0	λ, L, q1	 	 
q1	λ, S, q1	0, S, q1	1, L, q1
После выполнения программы на ленте осталось ровно 343 нуля. Определите максимально возможное число нулей в исходной последовательности. 
"""
s_in = '0'*342 + '1' + '0'*657  # 342 + 657 = 999 нуля
s_out = '0'*342 + '0' + '1'*657  # 343 нуля


# https://stepik.org/lesson/2054747/step/3?unit=2083362
"""
https://kompege.ru/task
23850 (Уровень: Базовый)

На ленте исполнителя МТ в соседних ячейках записана последовательность из 800 единиц и 900 нулей, расположенных в произвольном порядке, и одной двойки в конце. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. Программа работы исполнителя:
Определите количество единиц в строке, полученной в результате работы программы.

Руками 😉. Первое изменение будет в q1, следующее в q0 и т.д. При этом все нули станут единицами и наоборот.
Значит '1' станет 900
Символов '0' и '1' в строке чётное кол-во, 
значит '2' окажется в программе q1 при которой '2' -> '0'
Ответ: 900
"""



# https://stepik.org/lesson/2054747/step/4?unit=2083362
"""
https://kompege.ru/task
28933 ЕГКР 18.04.26 (Уровень: Базовый)
На ленте в соседних ячейках записано двоичное представление числа 2027 без ведущих нулей. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей слева от последовательности ячейке.
Программа работы исполнителя:
Определите результат работы программы. В ответе запишите получившееся на ленте число в десятичной системе счисления.
"""
s_in = f'{2027:b}'
s_out = s_in + '11'
print(int(s_out, 2))  # 8111



# https://stepik.org/lesson/2054747/step/5?unit=2083362
"""
https://kompege.ru/tas
27293 (Уровень: Базовый)
На ленте исполнителя МТ в соседних ячейках записано двоичное представление двоичное представление некоторого натурального числа без ведущих нулей. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. Программа работы исполнителя:
После выполнения программы на ленте оказалась двоичная запись числа 11438. Определите, какое число было записано на ленте до начала работы программы. 
В ответе запишите это число в десятичной системе счисления.
"""
s_out = f'{11438:b}'  # 10110010101110
s_in = s_out[1:-3].replace('0', '*').replace('1', '0').replace('*', '1')  # 1001101010
print(int(s_in, 2))  # 618



# https://stepik.org/lesson/2054747/step/6?unit=2083362
"""
https://kompege.ru/task
26348 (Уровень: Базовый)
На ленте исполнителя МТ в соседних ячейках записано двоичное представление целого положительного числа без ведущих нулей. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей слева от последовательности ячейке.
Программа работы исполнителя:

После выполнения программы на ленте оказалось двоичная запись числа 794. Определите минимальное десятичное значение числа, которое могло быть записано на ленте до начала работы программы.
"""
for n in range(1, 10000):
    b = ''.join(['10'[i == '1'] for i in f'{n:b}']) + '10'
    if int(b, 2) == 794:
        print(n)  # 313
        break



# https://stepik.org/lesson/2054747/step/7?unit=2083362
"""
https://kompege.ru/task
23815 (Уровень: Базовый)
На ленте исполнителя МТ в соседних ячейках записана последовательность из 1000 символов, состоящей из 764 двоек, 122 троек и 114 символов Х, расположенных в указанном порядке. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. 
Программа для исполнителя:
Какую десятичную цифру необходимо указать вместо символа Х, чтобы сумма цифр последовательности после выполнения программы равнялась 3496?
"""
s__in = '2' * 764 + '3' * 122 + 'X' * 114
s_out = '3' * 764 + 'X' * 122 + '2' * 114
# 3496 = 3 * 764 + 'X' * 122 + 2 * 114
X = (3496 -  3 * 764 - 2 * 114) / 122
print(X)


# https://stepik.org/lesson/2054747/step/8?unit=2083362
"""
https://kompege.ru/task
23859 (Уровень: Базовый)
На ленте исполнителя МТ в соседних ячейках записана последовательность из 1000 символов, включающая только нули, единицы и двойки. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. Программа для исполнителя:
Известно, что количество символов 0 и 1 в исходной строке было одинаково, а сумма значений в исходной строке больше суммы значений в конечной строке на 200. Какое количество цифр 2 было в исходной строке?
"""
for n in range(1, 500):
    s1 = n * (0+1) + (1000 - 2*n) * (2)  # (0+1) и (2)  символы в исходной строке и их сумма
    s2 = n * (1+2) + (1000 - 2*n) * (0)  # (1+2) и (0)  символы в конечной строке и их сумма
    if s1 - s2 == 200:
        print(1000 - 2*n)  # 400   (n = 300)

# ручной вариант
# количество символов 0 и 1 в исходной строке было одинаково
# значит количество символов 1 и 2 в выходной строке тоже одинаково
"""
s__in -->  n * (0+1) + (1000 - 2*n) * (2)  --> 2000 - 3 * n
s_out -->  n * (1+2) + (1000 - 2*n) * (0)  --> 3 * n
2000 - 3*n - 3*n = 200
6 * n = 2000 - 200
n = 300

'2' -->  1000 - 2*n = 1000 - 600 = 400  (символов)
"""


# https://stepik.org/lesson/2054747/step/9?unit=2083362
"""
https://kompege.ru/task
24173 (Уровень: Базовый)
На ленте исполнителя МТ в соседних ячейках записана последовательность из 1000 символов, включающая только нули, единицы и двойки. 
Ячейки справа и слева от последовательности заполнены пустыми символами «λ». В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. 
Программа для исполнителя:
Известно, что количество символов 1 и 2 в исходной строке было одинаково, 
а сумма значений в исходной строке больше суммы значений в конечной строке на 178. Какое количество цифр 2 было в исходной строке?
"""
for n0 in range(1, 1000):
    for n12 in range(1, 500):
        s = '0' * n0 + '12' * n12
        if len(s) == 1000:
            sm_in = sum(map(int, s))
            s = s.replace('0', '+').replace('1', '*')
            s = s.replace('2', '1').replace('+', '2').replace('*', '0')
            sm_out = sum(map(int, s))
            if sm_in - sm_out == 178:
                print(s.count('1'))  # 363



# https://stepik.org/lesson/2054747/step/10?unit=2083362
"""
https://kompege.ru/task
# 23814 (Уровень: Базовый)
На ленте исполнителя МТ в соседних ячейках записана последовательность из 1000 символов, состоящей из 106 нулей, 334 единиц и 560 двоек, расположенных в указанном порядке. 
Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей ячейке справа от последовательности.
Определите количество нулей в последовательности, полученной после выполнения программы.
"""
"""
000 111 222 <<  # заход с левого края
000 11 0 >> 111  # Переводит все "2" в "1" дальше первую "1" в "0" и начинает идти обратно
000 11 0 000 >>  # При обратном ходе переводит все "1" в "0" 
"""
s__in = '0' * 106 + '1' * 334 + '2' * 560
s_out = '0' * 106 + '1' * 333 + '0' + '0' * 560  # 106 + 1 + 560  --> 667
print(s_out.count('0'))  # 667


# https://stepik.org/lesson/2054747/step/11?unit=2083362
"""
https://kompege.ru/task
24174 (Уровень: Базовый)
записана последовательность из 1000 символов, включающая только нули, единицы и двойки. 
Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. 
Известно, что количество символов 0 в конечной строке было в 2 раза больше, по сравнению с количеством символов 2 в исходной строке, 
а сумма значений в исходной строке меньше суммы значений в конечной строке на 1640. 
Какое количество цифр 0 было в исходной строке?
"""
# решение через строку
# пусть n0 = кол-ву нулей, а n2 = кол-ву двоек => n1 = 2 * n2 (кол-во единиц)
for n0 in range(1, 1000):
    for n2 in range(1, 500):
        s_in = '1' * 2 * n2 + '2' * n2 + '0' * n0   # формируем нашу строку
        if len(s_in) == 1000:  # проверяем, что строка имеет именно 1000 символов
            sum1 = sum(map(int, s_in))
            s_out = s_in.replace('1', '+')  # защита от наложения замен друг на друга
            s_out = s_out.replace('2', '1').replace('0', '2').replace('+', '0')
            sum2 = sum(map(int, s_out))
            if sum2 - sum1 == 1640:
                print(s_in.count('0'))  # 880

# быстрее и короче
for n2 in range(1, 500):  # кол-во '2' в начальной строке
    n1 = 2 * n2  # кол-во '1' в начальной строке
    n0 = 1000 - n1 - n2  # кол-во '0' в начальной строке
    sum_in = n1 + 2 * n2
    sum_out = 2 * n0 + n2
    if sum_out - sum_in == 1640:
        print(n0)  # 880








# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""

""" Взято на мой курс """