""" Task 12 """

"""
23750 23815 23850 26348 27293 23859 28933
"""

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""


# https://stepik.org/lesson/2054747/step/2?unit=2083362
"""
https://kompege.ru/task
23750 Демоверсия 2026 (Уровень: Средний)

На ленте в соседних ячейках записана последовательность из 1000 символов, включающая только нули и единицы. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». В начальный момент времени головка расположена в ближайшей ячейке справа от последовательности.
Программа работы исполнителя: 
 	λ	        1	        0
q0	λ, L, q1	 	 
q1	λ, S, q1	0, S, q1	1, L, q1
После выполнения программы на ленте осталось ровно 343 нуля. Определите максимально возможное число нулей в исходной последовательности. 
"""
s_in = '0'*342 + '1' + '0'*657  # 342 + 657 = 999 нуля
s_out = '0'*342 + '0' + '1'*657  # 343 нуля


# https://stepik.org/lesson/2054747/step/3?unit=2083362
"""
https://kompege.ru/task
23850 (Уровень: Базовый)

На ленте исполнителя МТ в соседних ячейках записана последовательность из 800 единиц и 900 нулей, расположенных в произвольном порядке, и одной двойки в конце. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. Программа работы исполнителя:
Определите количество единиц в строке, полученной в результате работы программы.

Руками 😉. Первое изменение будет в q1, следующее в q0 и т.д. При этом все нули станут единицами и наоборот.
Значит '1' станет 900
Символов '0' и '1' в строке чётное кол-во, 
значит '2' окажется в программе q1 при которой '2' -> '0'
Ответ: 900
"""



# https://stepik.org/lesson/2054747/step/4?unit=2083362
"""
https://kompege.ru/task
28933 ЕГКР 18.04.26 (Уровень: Базовый)

На ленте в соседних ячейках записано двоичное представление числа 2027 без ведущих нулей. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей слева от последовательности ячейке.
Программа работы исполнителя:
Определите результат работы программы. В ответе запишите получившееся на ленте число в десятичной системе счисления.
"""
s_in = f'{2027:b}'
s_out = s_in + '11'
print(int(s_out, 2))  # 8111



# https://stepik.org/lesson/2054747/step/5?unit=2083362
"""
https://kompege.ru/tas
27293 (Уровень: Базовый)

На ленте исполнителя МТ в соседних ячейках записано двоичное представление двоичное представление некоторого натурального числа без ведущих нулей. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. Программа работы исполнителя:
После выполнения программы на ленте оказалась двоичная запись числа 11438. Определите, какое число было записано на ленте до начала работы программы. 
В ответе запишите это число в десятичной системе счисления.
"""
s_out = f'{11438:b}'  # 10110010101110
s_in = s_out[1:-3].replace('0', '*').replace('1', '0').replace('*', '1')  # 1001101010
print(int(s_in, 2))  # 618



# https://stepik.org/lesson/2054747/step/6?unit=2083362
"""
https://kompege.ru/task
26348 (Уровень: Базовый)

На ленте исполнителя МТ в соседних ячейках записано двоичное представление целого положительного числа без ведущих нулей. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей слева от последовательности ячейке.
Программа работы исполнителя:

После выполнения программы на ленте оказалось двоичная запись числа 794. Определите минимальное десятичное значение числа, которое могло быть записано на ленте до начала работы программы.
"""
for n in range(1, 10000):
    b = ''.join(['10'[i == '1'] for i in f'{n:b}']) + '10'
    if int(b, 2) == 794:
        print(n)  # 313
        break


# https://stepik.org/lesson/2054747/step/7?unit=2083362
"""
https://kompege.ru/task
23815 (Уровень: Базовый)

На ленте исполнителя МТ в соседних ячейках записана последовательность из 1000 символов, состоящей из 764 двоек, 122 троек и 114 символов Х, расположенных в указанном порядке. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. 
Программа для исполнителя:
Какую десятичную цифру необходимо указать вместо символа Х, чтобы сумма цифр последовательности после выполнения программы равнялась 3496?
"""
s__in = '2' * 764 + '3' * 122 + 'X' * 114
s_out = '3' * 764 + 'X' * 122 + '2' * 114
# 3496 = 3 * 764 + 'X' * 122 + 2 * 114
X = (3496 -  3 * 764 - 2 * 114) / 122
print(X)


# https://stepik.org/lesson/2054747/step/8?unit=2083362
"""
https://kompege.ru/task
23859 (Уровень: Базовый)

На ленте исполнителя МТ в соседних ячейках записана последовательность из 1000 символов, включающая только нули, единицы и двойки. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. Программа для исполнителя:
Известно, что количество символов 0 и 1 в исходной строке было одинаково, а сумма значений в исходной строке больше суммы значений в конечной строке на 200. Какое количество цифр 2 было в исходной строке?
"""
for n in range(1, 500):
    s1 = n * (0+1) + (1000 - 2*n) * (2)  # (0+1) и (2)  символы в исходной строке и их сумма
    s2 = n * (1+2) + (1000 - 2*n) * (0)  # (1+2) и (0)  символы в конечной строке и их сумма
    if s1 - s2 == 200:
        print(1000 - 2*n)  # 400   (n = 300)

# ручной вариант
# количество символов 0 и 1 в исходной строке было одинаково
# значит количество символов 1 и 2 в выходной строке тоже одинаково
"""
s__in -->  n * (0+1) + (1000 - 2*n) * (2)  --> 2000 - 3 * n
s_out -->  n * (1+2) + (1000 - 2*n) * (0)  --> 3 * n
2000 - 3*n - 3*n = 200
6 * n = 2000 - 200
n = 300

'2' -->  1000 - 2*n = 1000 - 600 = 400  (символов)
"""


# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""


# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""
""" Взято на мой курс """
