""" Task 12 """

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""


# https://stepik.org/lesson/2054747/step/2?unit=2083362
"""
https://kompege.ru/task
23750 Демоверсия 2026 (Уровень: Средний)

На ленте в соседних ячейках записана последовательность из 1000 символов, включающая только нули и единицы. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». В начальный момент времени головка расположена в ближайшей ячейке справа от последовательности.
Программа работы исполнителя: 
 	λ	        1	        0
q0	λ, L, q1	 	 
q1	λ, S, q1	0, S, q1	1, L, q1
После выполнения программы на ленте осталось ровно 343 нуля. Определите максимально возможное число нулей в исходной последовательности. 
"""
s_in = '0'*342 + '1' + '0'*657  # 342 + 657 = 999 нуля
s_out = '0'*342 + '0' + '1'*657  # 343 нуля


# https://stepik.org/lesson/2054747/step/3?unit=2083362
"""
https://kompege.ru/task
23850 (Уровень: Базовый)

На ленте исполнителя МТ в соседних ячейках записана последовательность из 800 единиц и 900 нулей, расположенных в произвольном порядке, и одной двойки в конце. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. Программа работы исполнителя:
Определите количество единиц в строке, полученной в результате работы программы.

Руками 😉. Первое изменение будет в q1, следующее в q0 и т.д. При этом все нули станут единицами и наоборот.
Значит '1' станет 900
Символов '0' и '1' в строке чётное кол-во, 
значит '2' окажется в программе q1 при которой '2' -> '0'
Ответ: 900
"""



# https://stepik.org/lesson/2054747/step/4?unit=2083362
"""
https://kompege.ru/task
28933 ЕГКР 18.04.26 (Уровень: Базовый)

На ленте в соседних ячейках записано двоичное представление числа 2027 без ведущих нулей. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей слева от последовательности ячейке.
Программа работы исполнителя:
Определите результат работы программы. В ответе запишите получившееся на ленте число в десятичной системе счисления.
"""
s_in = f'{2027:b}'
s_out = s_in + '11'
print(int(s_out, 2))  # 8111



# https://stepik.org/lesson/2054747/step/5?unit=2083362
"""
https://kompege.ru/tas
27293 (Уровень: Базовый)

На ленте исполнителя МТ в соседних ячейках записано двоичное представление двоичное представление некоторого натурального числа без ведущих нулей. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей ячейке слева от последовательности. Программа работы исполнителя:
После выполнения программы на ленте оказалась двоичная запись числа 11438. Определите, какое число было записано на ленте до начала работы программы. 
В ответе запишите это число в десятичной системе счисления.
"""
s_out = f'{11438:b}'  # 10110010101110
s_in = s_out[1:-3].replace('0', '*').replace('1', '0').replace('*', '1')  # 1001101010
print(int(s_in, 2))  # 618



# https://stepik.org/lesson/2054747/step/6?unit=2083362
"""
https://kompege.ru/task
26348 (Уровень: Базовый)

На ленте исполнителя МТ в соседних ячейках записано двоичное представление целого положительного числа без ведущих нулей. Ячейки справа и слева от последовательности заполнены пустыми символами «λ». 
В начальный момент времени головка расположена в ближайшей слева от последовательности ячейке.
Программа работы исполнителя:

После выполнения программы на ленте оказалось двоичная запись числа 794. Определите минимальное десятичное значение числа, которое могло быть записано на ленте до начала работы программы.
"""
for n in range(1, 10000):
    b = ''.join(['10'[i == '1'] for i in f'{n:b}']) + '10'
    if int(b, 2) == 794:
        print(n)  # 313
        break



# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""






# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""

