""" Task 23_01 """
# Задачи с подсчетом команд с обязательным и избегаемым числами.

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""

"""
7011 8585 11953 25360 27312 27633 
"""

"""
Есть на вариантах экзаменов
31510
"""


# https://stepik.org/lesson/2304296/step/1?unit=2339050
"""
https://stepik.org/lesson/460368/step/11?auth=login&unit=450951

У исполнителя Калькулятор две команды, которым присвоены номера:
 прибавь 1
 умножь на 2
Сколько есть программ, которые число 1 преобразуют в число 16?  
"""
def f(a, b):
    if a > b:
        return 0
    if a == b:
        return 1
    return f(a + 1, b) + f(a * 2, b)
print(f(1, 16))  # 36


# https://stepik.org/lesson/2304296/step/2?unit=2339050
"""
https://stepik.org/lesson/569846/step/6?unit=564380

У исполнителя две команды, которым присвоены номера:
прибавь 1
умножь на 3

Сколько есть программ, которые число 2 преобразуют в число 18, и при этом траектория вычислений содержит число 15?
"""
def fn(a, b):
    if a > b:
        return 0
    if a == b:
        return 1
    return fn(a + 1, b) + fn(a * 3, b)
print(fn(2, 15) * fn(15, 18))  # 5


# https://stepik.org/lesson/2304296/step/3?unit=2339050
"""
https://kompege.ru/task
27633 Апробация 04.03.26 (Уровень: Базовый)

Исполнитель преобразует число на экране. У испол
нителя есть две команды, которые обозначены латинскими буквами:
A. Вычти 1
B. Найди целую часть от деления на 2
Первая из них уменьшает число на экране на 1, вторая заменяет число на экране на целую части от деления числа на 2. 
Программа для исполнителя - это последовательность команд.
Сколько существует программ, для которых при исходном числе 40 результатом является 6, и при этом траектория вычислений содержит число 17?
"""
def fn(a, b):
    if a < b:
        return 0
    if a == b:
        return 1
    return fn(a - 1, b) + fn(a // 2, b)
print(fn(40, 17) * fn(17, 6))  # 56


# https://stepik.org/lesson/2304296/step/4?unit=2339050
"""
https://stepik.org/lesson/569846/step/8?unit=564380

У исполнителя три команды, которым присвоены номера:
1. прибавь 1
2. прибавь 3
3. умножь на 2
Сколько есть программ, которые число 4 преобразуют в число 28, и при этом траектория вычислений НЕ содержит число 14?
"""
def fn(a, b):
    if a > b or a == 14:
        return 0
    if a == b:
        return 1
    return fn(a + 1, b) + fn(a + 3, b) + fn(a * 2, b)
print(fn(4, 28))  # 3780


# https://stepik.org/lesson/2304296/step/5?unit=2339050
"""
https://kompege.ru/task
25360 ЕГКР 13.12.25 (Уровень: Базовый)

Исполнитель преобразует число, записанное на экране. У исполнителя есть три команды, которые обозначены латинскими буквами:
A. вычти 3
В. вычти 6
C. найди целую часть от деления на 2
Сколько существует программ, для которых при исходном числе 86 результатом является 12, при этом траектория вычислений содержит число 53 и не содержит 36?
Траектория вычислений программы - это последовательность результатов выполнения всех команд программы.
"""
def fn(a, b):
    if a < b or a == 36:
        return 0
    if a == b:
        return 1
    return fn(a - 3, b) + fn(a - 6, b) + fn(a // 2, b)
print(fn(86, 53) * fn(53, 12))  # 144


# https://stepik.org/lesson/2304296/step/6?unit=2339050
"""
Исполнитель преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
1. Вычесть 1
2. Вычесть 3
3. Взять остаток от деления на 4
Программа для исполнителя – это последовательность команд. 
Команда 3 выполняется только для чисел, больших, чем 4.
Сколько существует таких программ, которые исходное число 22 преобразуют в число 2?
"""
def fn(a, b):
    if a < b:
        return 0
    if a == b:
        return 1
    if a > 4:
        return fn(a - 1, b) + fn(a - 3, b) + fn(a % 4, b)
    return fn(a - 1, b) + fn(a - 3, b)
print(fn(22, 2))


# https://stepik.org/lesson/2304296/step/7?unit=2339050
"""
https://kompege.ru/task
27312 (Уровень: Средний)
У исполнителя имеются три команды, которые обозначены латинскими буквами:
A. Вычесть 1
B. Найти целую часть от деления на 2
C. Найти целую часть от деления на 3
Программа для исполнителя – это последовательность команд. 
Сколько существует программ, для которых при исходном числе 106 результатом является 6, 
при этом траектория вычислений содержит ровно одно из чисел 48 или 61 (но не оба одновременно)?
"""
def fn(a, b, c=0):
    c += a in (48, 61)
    if a < b or c > 1:
        return 0
    if a == b and c == 1:
        return 1
    return fn(a - 1, b, c) + fn(a // 2, b, c) + fn(a // 3, b, c)
print(fn(106, 6))  # 4128


# https://stepik.org/lesson/2304296/step/8?unit=2339050
"""
https://kompege.ru/task
8585 (Уровень: Базовый)

Исполнитель преобразует число на экране. У исполнителя есть три команды, которым присвоены номера:
Вычти сумму всех цифр числа
Найди целую часть от деления на 2
Вычти 1
Первая из них уменьшает число на экране на сумму всех его цифр, вторая заменяет число на экране на целую часть от деления числа на 2, а третья уменьшает число на единицу.
Программа для исполнителя – это последовательность команд.
Сколько существует программ, для которых при исходном числе 40 результатом является число 10, и при этом траектория вычислений содержит число 25?
"""
def f(a, b):
    if a < b:
        return 0
    if a == b:
        return  1
    return f(a - sum(map(int, str(a))), b) + f(a // 2, b) +f(a - 1, b)
print(f(40, 25) * f(25, 10))  # 247


# https://stepik.org/lesson/2304296/step/9?unit=2339050
"""
# https://stepik.org/lesson/564194/step/11?unit=558442

Исполнитель преобразует число на экране. У исполнителя есть три команды:
Прибавить 1.
Умножить на 2.
Возвести в квадрат.
Первая команда увеличивает число на экране на 1, вторая - умножает на 2, третья команда возводит число в квадрат. 
Программа для исполнителя - это последовательность команд, каждая из которых увеличивает число. 
Сколько существует различных программ, которые преобразуют исходное число 1 в число 68?

Обратите внимание на команду 3 (возвести в квадрат) и на стартовое значение преобразуемого числа.
"""
def f(a, b):
    if a == b:
        return 1
    if a > b:
        return 0
    if a == 1:
        return f(a + 1, b) + f(a * 2, b)
    return f(a + 1, b) + f(a * 2, b) + f(a ** 2, b)
print(f(1, 68))  # 3628


# https://stepik.org/lesson/2304296/step/10?unit=2339050
"""
https://stepik.org/lesson/564227/step/9?unit=558475

У исполнителя есть две команды, которым присвоены номера:
Прибавить 1
Добавить слева 1
Первая команда увеличивает число на 1. Вторая команда приписывает к двоичному числу слева 1, 
например, для числа 10<sub>2</sub> результатом работы данной команды будет являться число 110<sub>2</sub>. 
Сколько существует программ, которые исходное двоичное число 100<sub>2</sub> преобразуют в двоичное число 110001<sub>2</sub>?
"""
def f(a, b):
    if a == b:
        return 1
    if a > b:
        return 0
    return f(a + 1, b) + f(int('1' + f'{a:b}', 2), b)

a = int('100', 2)
b = int('110001', 2)
print(f(a, b))  # 33


# https://stepik.org/lesson/2304296/step/11?unit=2339050
"""
https://kompege.ru/task
7011 (Уровень: Средний)

Задача повышенной сложности 🌶️
Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены коды:
A. Прибавь 2
B. Прибавь 3
С. Умножь на 2
Первая команда увеличивает число на 2 раза, вторая – на 3 раза, третья – в 2 раза. 
Программа для исполнителя – это последовательность команд. Траектория вычисления программы – это последовательности результатов выполнения всех команд.
Сколько существует программ, для которых при исходном числе 2 результатом будет являться число 40, при этом траектория вычисления не содержит число 28, а также не содержит подпоследовательность команд BACA. 
"""
def f(a, b, s=''):
    if a > b or a == 28 or 'BACA' in s:
        return 0
    if a == b:
        return  1
    return f(a + 2, b, s + 'A') + f(a + 3, b, s + 'B') + f(a * 2, b, s + 'C')

print(f(2, 40))


# # https://stepik.org/lesson/2304296/step/12?unit=2339050
"""
https://kompege.ru/task
11953 (Уровень: Средний)

Задача повышенной сложности 🌶️

Исполнитель преобразует число на экране. У исполнителя есть три команды, которые обозначены латинскими буквами:
    A. Прибавить последнюю цифру
    B. Добавить остаток от деления на 68
    C. Возвести в квадрат
Программа для исполнителя – это последовательность команд. 
Команда А прибавляет к числу его последнюю цифру. Например, из числа 68 получится число 76.
Команда B прибавляет к числу его остаток от деления на 68. Например, из числа 10 получится число 20.
Команда C возводит число в квадрат. Например, из числа 9 получится число 81.

Если после выполнения команды получается такое же число, то команду нельзя применять к этому числу. Например, к числу 10 нельзя применить команду A, так как 10 + 0 = 10.
Траектория вычислений программы – это последовательность результатов выполнения всех команд программы.

Сколько существует программ, для которых при исходном числе 2 результатом является число 680, при этом траектория вычислений содержит число 68 и не содержит числа 100?

<details open=""><summary>Подсказка</summary> <strong>from functools</strong> <strong>import *</strong><br />
подключаем декоратор <strong>@lru_cache</strong> для мемоизации результатов рекурсии</details>
"""
from functools import lru_cache
@lru_cache(None)
def f(a, b):
    if a > b or a == 100:
        return 0
    if a == b:
        return  1
    res = f(a ** 2, b)
    if a % 10 != 0:
        res += f(a + a % 10, b)
    if a % 68 != 0:
        res += f(a + a % 68, b)
    return res
print(f(2, 68) * f(68, 680))  # 47997789947424





"""✅ ADD ✅"""

"""
https://stepik.org/lesson/658663/step/6?unit=656094

Исполнитель преобразует число на экране. У исполнителя есть три команды, которым присвоены номера:
    Прибавить 1
    Прибавить 2
    Умножить на 2
Первая команда увеличивает число на экране на 1, вторая увеличивает его на 2, третья – умножает на 2. Программа для исполнителя – это последовательность команд. 
Сколько существует программ, которые преобразуют исходное число 1 в число 12 и при этом не содержат двух одинаковых команд подряд.
"""
def f(a,b,c=''):
    if a==b and all(['AA' not in c, 'BB' not in c, 'CC' not in c, ]):
        return 1
    if a > b :
        return 0
    return f(a + 1, b, c+'A') + f(a + 2, b, c+'B') + f(a * 2, b, c+'C')
print(f(1,12))  # 17

# long code
def f(a,b,c=''):
    if a==b:
        return 1
    if a > b :
        return 0
    if c == 'A':
        return f(a+2, b, 'B') + f(a*2, b, 'C')
    elif c == 'B':
        return f(a+1, b, 'A') + f(a*2, b, 'C')
    elif c == 'C':
        return f(a+1, b, 'A') + f(a+2, b, 'B')
    return f(a+1, b, 'A') + f(a+2, b, 'B') + f(a*2, b, 'C')
print(f(1,12))  # 17