""" Task 14 """
"""
926 8002 8370 17527 24629 25353  
"""

"""
Есть на вариантах экзаменов
31511
"""

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""


# https://stepik.org/lesson/2374105/step/1?unit=2409474
"""
https://kompege.ru/task
24629 (Уровень: Базовый)

Значение арифметического выражения  
14**1402 + 28**501 - 14**51 - 1400  
записали в системе счисления с основанием 14. 
Определите в 14-ричной записи числа количество цифр с числовым значением, равным D.
"""
# 24629 (Уровень: Базовый)
n = 14**1402 + 28**501 - 14**51 - 1400
c = 0
while n:
    c += n % 14 == 13  # D
    n //= 14
print(c)  # 511


# https://stepik.org/lesson/2374105/step/2?unit=2409474
"""
(ЕГЭ-2024)
https://stepik.org/lesson/564223/step/4?unit=558471

Значение арифметического выражения
3 * 289**2026 + 81*49**121 - 9*16**81 - 2025
записали в системе счисления с основанием 31. Определите сумму цифр с числовым значением, не превышающим 17, в записи этого числа.
"""
n = 3 * 289**2026 + 81*49**121 - 9*16**81 - 2025
c = 0
while n:
    r = n % 31
    if r <= 17:
        c += r
    n //= 31
print(c)  # 16385


# https://stepik.org/lesson/2374105/step/3?unit=2409474
"""
https://kompege.ru/task
25353 ЕГКР 13.12.25 (Уровень: Базовый)

Значение арифметического выражения
3 * 27**9 + 2 * 27**6 + 27**3 - x
где х - целое положительное число, не превышающее 27 000, записали в 27-ричной системе счисления. 
Определите наименьшее значение х, при котором в 27-ричной записи числа, являющегося значением данного арифметического выражения, содержится ровно 6 нулей.
В ответе запишите число в десятичной системе счисления.
"""
for x in range(1, 27_000):
    c = 0
    n = 3 * 27**9 + 2 * 27**6 + 27**3 - x
    while n:
        c += not n % 27
        n //= 27
    if c == 6:
        print(x)  # 27
        break


# https://stepik.org/lesson/2374105/step/4?unit=2409474
"""
https://kompege.ru/task
12468 (Уровень: Базовый)

Операнды арифметического выражения записаны в системе счисления с основанием 19.
78x79643 19 + 25x43  19 + 63x5 19
В записи чисел переменной x обозначена неизвестная цифра из алфавита 19-ричной системы счисления. Определите наименьшее значение x, при котором значение данного арифметического выражения кратно 18. 
Для найденного x вычислите частное от деления значения арифметического выражения на 18 и укажите его в ответе в десятичной системе счисления. Основание системы счисления указывать не нужно.
"""
alf = '0123456789abcdefghi'
for x in alf:
    n = int(f'78{x}79643', 19) + int(f'25{x}43', 19) + int(f'63{x}5', 19)
    if not n % 18:
        print(n // 18)  # 368599039
        break



# https://stepik.org/lesson/2374105/step/5?unit=2409474
"""
https://kompege.ru/task
5632 (Уровень: Средний)

Операнды арифметического выражения записаны в системе счисления с основанием 21.
32yxA + 16y18
В записи чисел переменными х и у обозначены две неизвестные цифры из алфавита 21-ричной системы счисления. Определите наименьшее значение х, при котором значение данного арифметического выражения кратно 12 при любом нечётном значении у. 
Для найденного значения х вычислите частное от деления значения арифметического выражения на 12 при у = 7 и укажите его в ответе в десятичной системе счисления. Основание системы счисления в ответе указывать не нужно.
"""
from string import printable as alf
def f(x, y):
    a = int(f'32{y}{x}a', 21)
    b = int(f'16{y}18', 21)
    return a + b

for x in alf[:21]:
    if all(not f(x,y) % 12 for y in alf[1:21:2]):
        # print(x)  # 3
        print(f(x, 7) // 12)  # 71524
        break


# https://stepik.org/lesson/2374105/step/6?unit=2409474
"""
https://kompege.ru/task
27298 (Уровень: Средний)

Операнды арифметического выражения записаны в системе счисления с основанием 40.
871x291 + 366x631 + 973x618
В записи чисел переменной x обозначена неизвестная цифра из алфавита 40-ричной системы счисления. 
Определите наименьшее значение x, при котором значение данного арифметического выражения кратно 39. 
Для найденного x вычислите частное от деления значения арифметического выражения на 13 и укажите его в ответе в десятичной системе счисления. Основание системы счисления указывать не нужно.
"""
for x in range(40):
    a = 8*40**6 + 7*40**5 + 1*40**4 + x*40**3 + 2*40**2 + 9*40**1 + 1*40**0
    b = 3*40**6 + 6*40**5 + 6*40**4 + x*40**3 + 6*40**2 + 3*40**1 + 1*40**0
    c = 9*40**6 + 7*40**5 + 3*40**4 + x*40**3 + 6*40**2 + 1*40**1 + 8*40**0
    res = a + b + c
    if not res % 39:
        # print(x)  # 10
        print(res // 13)  # 6461195610
        break

# variant
def cnv(ls:list, b):
    r = sum(int(n) * b**i for i, n in enumerate(ls[::-1]))
    return r

for x in range(40):
    a = f'8 7 1 {x} 2 9 1'.split()
    b = f'3 6 6 {x} 6 3 1'.split()
    c = f'9 7 3 {x} 6 1 8'.split()
    res = cnv(a, 40) + cnv(b, 40) + cnv(c, 40)
    if not res % 39:
        print(res // 13)  # 6461195610
        break


# https://stepik.org/lesson/2374105/step/7?unit=2409474
"""
https://kompege.ru/task
8002 (Уровень: Базовый)

Операнды арифметического выражения записаны в системе счисления с основанием 18.
77968х1118 + 4𝑥21318  <sub>18</sub>
В записи чисел переменной х обозначена неизвестная цифра из алфавита 18-ричной системы счисления. Определите наибольшее значение х, при котором значение данного арифметического выражения кратно 7. 
Для найденного значения х вычислите частное от деления значения арифметического выражения на 7 и укажите его в ответе в десятичной системе счисления. Основание системы счисления в ответе указывать не нужно.
"""
from string import printable
alf = printable[:18]
for i in alf[::-1]:
    n = int(f'77968{i}11', 18) + int(f'4{i}213', 18)
    if not n % 7:
        print(n // 7)  # 648833380
        break




# https://stepik.org/lesson/2374105/step/8?unit=2409474
"""
https://kompege.ru/task
8370 Danov2305 (Уровень: Средний)

Найдите минимальное число, для представлений которого в системах счисления с основаниями  p и q выполняется равенство:
234𝑝 = 345𝑞   <sub>𝑝</sub>
В ответ запишите найденное число в десятичной системе счисления.
"""
for p in range(5, 100):
    for q in range(6, 100):
        left = 2*p**2 + 3*p + 4
        right = 3*q**2 + 4*q + 5
        if left == right:
            print(left)  # 564
            exit()


# https://stepik.org/lesson/2374105/step/9?unit=2409474
"""
https://kompege.ru/task
17527 Основная волна 07.06.24 (Уровень: Базовый)

Значение арифметического выражения 
3100 - x
где х — целое положительное число, не превышающее 2030, записали в троичной системе счисления. Определите наибольшее значение х, при котором в троичной записи числа, являющегося значением данного арифметического выражения, содержится ровно пять нулей.
В ответе запишите число в десятичной системе счисления.
"""
for x in range(2030, 0, -1):
    n = 3**100 - x
    c = 0
    while n:
        c += not n % 3
        n //= 3
    if c == 6:  # в оригинале задачи c == 5
        print(x)  # 2025  (в оригинале задачи 2024)
        break


# https://stepik.org/lesson/2374105/step/10?unit=2409474
"""
https://kompege.ru/task
926 Джобс 08.02.2021 (Уровень: Сложный) 🌶️

Значение арифметического выражения: 
7500 + 7200 – 750 – Х   <sup>500</sup>
записали в системе счисления с основанием 7. Какая максимальная сумма разрядов может быть в таком числе, при условии что X и полученное значение положительны? 
"""
n = 7**500 + 7**200 - 7**50
for i in range(1000, 0, -1):
    if int('6' * i, 7) < n:
        print(6 * i) # 3000   сумма разрядов
        # print(i)   # 500   число разрядов
        break


# https://stepik.org/lesson/2374105/step/11?unit=2409474
"""
https://stepik.org/lesson/253323/step/4?unit=233538

Укажите наименьшее четырёхзначное восьмеричное число, двоичная запись которого содержит 5 единиц. 
В ответе запишите только само восьмеричное число, основание системы счисления указывать не нужно
"""
def cnv(n, b):
    r = ''
    while n:
        r = str(n % b) + r
        n //= b
    return r

a = int('1000', 8)
b = int('7777', 8)
for n in range(a, b+1):
    if f'{n:b}'.count('1') == 5:
        print(cnv(n, 8))  # 1017
        break



# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""