""" Task 15 """

"""
752 754 762 1968 2078 2123 4988 9370
"""

"""
Есть на вариантах экзаменов
25279
"""


""" Взято на мой курс """

# https://stepik.org/lesson/2352713/step/1?unit=2388053
"""
https://kompege.ru/task
762 (Уровень: Базовый)

Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на m». Для какого наименьшего натурального числа А формула
(ДЕЛ(x, A) ∧ ДЕЛ(x, 24) ∧ ¬ДЕЛ(x, 16)) → ¬ДЕЛ(x, A)
тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)? 
"""
def f(x):
    # return (not x % a and not x % 24 and x % 16) <= (x % a != 0)
    return x % a or x % 24 or not x % 16 or x % a

for a in range(1, 1000):
    if all(f(x) for x in range(1, 1000)):
        print(a)  # 16
        break


# https://stepik.org/lesson/2352713/step/2?unit=2388053
"""
https://kompege.ru/task
2123 Danov2201 (Уровень: Базовый)

Для какого наибольшего целого неотрицательного числа А выражение
(2y + x ≠ 70) ∨ (x < y) ∨ (A < x)
тождественно истинно, то есть принимает значение 1 при любых целых неотрицательных x и y? 
"""
def f(x, y):
    return (2 * x + y != 70) or (x < y) or (a < x)

for a in range(100, 0, -1):
    if all(f(x, y) for x in range(1, 1000) for y in range(1, 1000)):
        print(a)  # 23
        break



# https://stepik.org/lesson/2352713/step/3?unit=2388053
"""
https://kompege.ru/task
1968 Демоверсия 2022 (Уровень: Средний)

На числовой прямой даны два отрезка: D = [17; 58] и C = [29; 80]. 
Укажите наименьшую возможную длину такого отрезка A, для которого логическое выражение
(x ∈ D) → ((¬(x ∈ C) ∧ ¬(x ∈ A)) → ¬(x ∈ D))
истинно (т.е. принимает значение 1) при любом значении переменной х.
"""
def f(x):
    d = 17 <= x <= 58
    c = 29 <= x <= 80
    a = a1 <= x <= a2
    # return d <= ((not c and (not a)) <= (not d))
    return not d or c or a

d = [y for x in (17,58,29,80) for y in (x-0.1, x, x+0.1)]
res = 1000
for a1 in d:
    for a2 in d:
        if a1 < a2 and all(f(i) for i in d):
            res = min(res, a2 - a1)
print(round(res))  # 12


# https://stepik.org/lesson/2352713/step/4?unit=2388053
"""
https://kompege.ru/task
2078 (Уровень: Базовый)

Введём выражение M&K, обозначающее поразрядную конъюнкцию M и K (логическое «И» между соответствующими битами двоичной записи). 
Определите наибольшее натуральное число A, такое что выражение
(( (X & 13 ≠ 0) ∨ (X & A ≠ 0)) → (X & 13 ≠0)) ∨ ((X & A ≠ 0) ∧ (X & 39 = 0))
тождественно истинно (то есть принимает значение 1 при любом натуральном значении переменной X)?
"""
def f(x):
    # return (((x & 13 != 0) or (x & a != 0)) <= ((x & 13 != 0))) or ((x & a != 0) and (x & 39 == 0))
    return not (x & 13 or x & a) or x & 13 or (x & a and (not x & 39))

for a in range(100, 0, -1):
    if all(f(x) for x in range(1, 10_000)):
        print(a)  # 13
        break



# https://stepik.org/lesson/2352713/step/5?unit=2388053
"""
https://kompege.ru/task
4988 (Уровень: Базовый)

Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m»; 
и пусть на числовой прямой дан отрезок B = [70; 80].
Для какого количества различных натуральных значений числа А формула
ДЕЛ(x, 12) ∧ (x ∈ B) ∧ ¬ДЕЛ(x, A)
тождественно ложна (т.е. принимает значение 0) при любом натуральном значении переменной х?
"""
def f(x):
    b = 70 <= x <= 80
    return x % 12 == 0 and b and x % a != 0
    # return not x % 12 and b and x % a

c = 0
for a in range(1, 1000):
    if all(not f(x) for x in range(1, 1000)):
        c += 1
print(c)  # 12



# https://stepik.org/lesson/2352713/step/6?unit=2388053
"""
https://kompege.ru/task
9370 Джобс 10.06.23 (Уровень: Сложный)

Известно, что P = [5; 54], Q =[50; 93]. Найдите минимальное целое значение А, при котором выражение
((x ∈/ P) ∧ (x ∈ Q)) → (x > A)
ложно (принимает значение 0) для ровно 20 целых значений х.
"""
def f(x):
    p = 5 <= x <= 54
    q = 50 <= x <= 93
    # return (not p and q) <= (x > a)
    return p or not q or x > a

for a in range(1000):
    if sum(not f(i) for i in range(10_000)) == 20:
        print(a)  # 74
        break


# https://stepik.org/lesson/2352713/step/7?unit=2388053
"""
https://kompege.ru/task
752 (Уровень: Средний)

Элементами множества А являются натуральные числа. Известно, что выражение
¬(¬(x ∈ A) ∧ (x ∈ {3, 6, 9, 12})) ∨ ¬(x ∈ {1, 2, 3, 4, 5, 6}) 
истинно (т. е. принимает значение 1) при любом значении переменной х. Определите наименьшее возможное количество элементов множества A.
"""
def f(x):
    P = x in {3, 6, 9, 12}
    Q = x in {1, 2, 3, 4, 5, 6}
    A = x in a
    # return not (not A and P) or not Q
    return A or not P or not Q

a = set()
for x in range(1, 100):
    if not f(x):
        a.add(x)
print(len(a))  # 2  {3, 6}


# https://stepik.org/lesson/2352713/step/8?unit=2388053
"""
https://stepik.org/lesson/485748/step/2?unit=476932

Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m». 
Для какого наименьшего натурального числа A формула
(ДЕЛ(x, A) -> ДЕЛ(x, 54) \/ ДЕЛ(x, 130)) /\ ( A > 60)
тождественно истинна (то есть принимает значение 1 при любом натуральном значении переменной х)?
"""
def f(x):
    # return (x % a == 0) <= ((x % 54 == 0) or (x % 130 == 0)) and a > 60
    return (x % a or not x % 54 or not x % 130) and a > 60

for a in range(1, 1000):
    if all(f(x) for x in range(1, 1000)):
        print(a)
        break


# https://stepik.org/lesson/2352713/step/9?unit=2388053
"""
https://stepik.org/lesson/564224/step/9?unit=558472
https://inf-ege.sdamgia.ru/test?likes=15803

Известно, что для некоторого отрезка А формула
((x ∈ A) → (x2 ≤ 100)) ∧ ((x2 ≤ 16) → (x ∈ A))
тождественно истинна (то есть принимает значение 1 при всех вещественных значениях
переменной x). Какую наибольшую длину может иметь отрезок A?
x<sup>2</sup>
"""
def f(x):
    a = a1 <= x <= a2
    return (not a or x**2 <= 100) and (x**2 > 16 or a)

n = [y for x in (-10, -4, 4, 10) for y in (x-0.1, x, x +0.1)]
res = 0
for a1 in n:
    for a2 in n:
        if a2 > a1 and all(f(i) for i in range(-200, 200)):
            res = max(res, a2 - a1)
print(round(res))  # 20


# https://stepik.org/lesson/2352713/step/10?unit=2388053
"""
https://stepik.org/lesson/734492/step/4?unit=736056

Элементами множеств A, P и Q являются натуральные числа, причём P = { 3, 4, 5, 6, 7} и Q = { 4, 6, 8, 10, 12}. Известно, что выражение:
((x ∈ P) → (x ∈ Q)) ∨ (x ∈ A)
истинно (т. е. принимает значение 1) при любом значении переменной х. Определите наименьшее возможное значение произведения элементов множества A.
Выходные данные: программа должна вывести одно число - значение произведения элементов множества A.
"""
from math import prod
def fn(x):
    return not x in p or x in q or x in a

p = {3, 4, 5, 6, 7}
q = {4, 6, 8, 10, 12}
a = set()  # найти минимально возможное множество 'a'

for x in range(1 , 100):
    if not fn(x):
        a.add(x)
# print(a)  # {3, 5, 7}
print(prod(a))  # 105


# https://stepik.org/lesson/2352713/step/11?unit=2388053
"""
https://kompege.ru/task
754 (Уровень: Средний)

Элементами множеств А, P и Q являются натуральные числа, причём P = { 2, 4, 6, 8, 10, 12, 14, 16, 18, 20} и 
Q = { 5, 10, 15, 20, 25, 30, 35, 40, 45, 50}. Известно, что выражение:
((x∈A)→(x∈P)) ∧ ((x∈Q)→¬(x∈A))
истинно (т. е. принимает значение 1) при любом значении переменной х. 
Определите наибольшее возможное количество элементов множества A. 
"""
def f(x):
    A = x in a
    P = x in {2, 4, 6, 8, 10, 12, 14, 16, 18, 20}
    Q = x in {5, 10, 15, 20, 25, 30, 35, 40, 45, 50}
    # return (A <= P) and (Q <= (not A))
    # return (not A or P) and (not Q or not A)
    return not A or (not Q and P)

a = set(range(1, 1000))
for x in range(1, 100000):
    if f(x) == 0:
        a.remove(x)
# print(a)  # {2, 4, 6, 8, 12, 14, 16, 18}
print(len(a))  # 8







# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""
""" Взято на мой курс """