""" Task 16 """

"""
596 605 628 8561 1199 17557 23562 29083
"""
"""
Есть на вариантах экзаменов
"""


# https://stepik.org/lesson/2054938/step/2?unit=2083558
"""
https://kompege.ru/task
596 (Уровень: Базовый)

F(n) = n  при  n ≤ 3
F(n) = n3+F(n − 1)  если n > 3 и дает остаток 0 при делении на 3
F(n) = 4 + F(n // 3)) если n > 3 и дает остаток 1 при делении на 3
F(n) = n2 + F(n − 2) если n > 3 и дает остаток 2 при делении на 3
Выведите значение F(100)
"""
def f(n):
    if n <= 3:
        return n
    elif n > 3:
        if not n % 3:
            return n**3 + f(n - 1)
        elif n % 3 == 1:
            return 4 + f(n // 3)
        else:
            return n**2 + f(n - 2)
print(f(100))  # 121757


# https://stepik.org/lesson/2054938/step/3?unit=2083558
"""
https://kompege.ru/task
№ 1199 Апробация 27.04 (Уровень: Базовый)

Алгоритм вычисления значения функции F(n), где n — целое число, задан следующими соотношениями:
F(n) = 1 при n ≤ 1
F(n) = 3 × n + F(n − 1)  если n > 1 и при этом n чётно
F(n) = 2 × F(n − 2)  если n > 1  и при этом n нечётно.
Чему равно значение функции F(31)?
"""
def f(n):
    if n <= 1:
        return 1
    if n % 2:
        return 2 * f(n-2)
    return 3*n + f(n-1)
print(f(31))  # 32768


# https://stepik.org/lesson/2054938/step/4?unit=2083558
"""
https://kompege.ru/task
№ 628 Джобс 02.11.2020 (Уровень: Средний)

Алгоритм вычисления функции F(n) задан следующими соотношениями:
F(n) = n + 3  при n  ≤ 18
F(n) = (n // 3)  ⋅ F(n // 3) + n −12   при  n > 18  кратных 3
F(n) = F(n −1) + n2 + 5   при  n > 18  не кратных 3
Здесь «//» обозначает деление нацело. Определите количество натуральных значений из отрезка [1; 1 000] 
для которых все цифры значения F(n) чётные.
"""
def f(n):
    if n <= 18:
        return n + 3
    if n % 3:
        return f(n - 1) + n ** 2 + 5
    return (n // 3) * f(n // 3) + n - 12

cnt = 0
for n in range(1, 1001):
    cnt += all(i in '02468' for i in str(f(n)))
print(cnt)


# https://stepik.org/lesson/2054938/step/5?unit=2083558
"""
https://kompege.ru/task
№ 605 (Уровень: Средний)
Определите сумму чисел, которые выведет процедура при вызове f(100):
def f(n):
  print(n * n)
  if n > 1:
    print(2 * n + 1)
    f(n - 2)
    f(n // 3)
"""
def f(n, c=0):
    c += n * n
    if n > 1:
        # c += 2 * n + 1
        # c += f(n - 2)
        # c += f(n // 3)
        c += 2 * n + 1 + f(n - 2) + f(n // 3)
    return c
print(f(100))  # 296541



# https://stepik.org/lesson/2054938/step/6?unit=2083558
"""
https://kompege.ru/task
8561 (Уровень: Базовый)
Алгоритм вычисления функций F(n) и G(n), где n – целое число, задан следующими соотношениями:
F(n) = n, при n ≤ 1;
F(n) = F(n – 1) + F(n – 2) + 1, при n > 1 и кратном трем;
F(n) = G(n – 3), при n > 1 и не кратном трем;
G(n) = n, при n > 100;
G(n) = G(n + 2) +1, при n ≤ 1 00;
Определите значение выражения F (15) + F (12).
"""
def f(n):
    if n <= 1:
        return n
    if n % 3:
        return g(n - 3)
    return f(n - 1) + f(n  -2) + 1

def g(n):
    if n > 100:
        return n
    return g(n + 2) + 1

print(f(15) + f(12))  # 593


# https://stepik.org/lesson/2054938/step/7?unit=2083558
"""
https://kompege.ru/task
17557 Основная волна 08.06.24 (Уровень: Базовый)
Алгоритм вычисления значения функции F(n),  где n – натуральное число, задан следующими соотношениями:
F(n) = 1  при n = 1;
F(n) = 2 × n × F(n–1),  если  n > 1.
Чему равно значение выражения (F(2024) / 16 − F(2023)) / F(2022) ?
"""
from functools import lru_cache
@lru_cache(None)
def f(n):
    if n == 1:
        return 1
    return 2 * n * f(n - 1)
[f(i) for i in range(1, 2025)]
print((f(2024) // 16 - f(2023)) // f(2022))  # 1019592


# https://stepik.org/lesson/2054938/step/8?unit=2083558
"""
https://kompege.ru/task
23562 Пересдача 03.07.25 (Уровень: Базовый)
Алгоритм вычисления значения функции F(n)  и  G(n), где n – целое число, задан следующими соотношениями:
F(n) = G(n − 1);
G(n) = 3 × n, если n ≤ 9.
G(n) = G(n − 2) + 1, если n > 9.
Чему равно значение выражения F(47995) ?
"""
from functools import lru_cache
@lru_cache
def g(n):
    if n <= 9:
        return 3 * n
    return g(n-2) + 1
# def f(n):  # лишняя функция
#     return g(n-1)
[g(n) for n in range(9, 47995)]
print(g(47994))  # 24017


# https://stepik.org/lesson/2054938/step/9?unit=2083558
"""
https://kompege.ru/task
25355 ЕГКР 13.12.25 (Уровень: Базовый)

Алгоритм вычисления функций F(n) и G(n), где n - целое число, задан следующими соотношениями:
F(n) = F(n−4) + 3580, если n ≥ 19;
F(n)= 6 × (G(n − 7) − 36), если n < 19;
G(n) = n / 20 + 28, если n ≥ 248045;
G(n) = G(n + 9) − 4, если n < 248045.
Чему равно целочисленное значение функции F(673)?
"""
from functools import lru_cache
@lru_cache(None)
def f(n):
    if n < 19:
        return 6 * (g(n - 7) - 36)
    return f(n - 4) + 3580

@lru_cache(None)
def g(n):
    if n < 248045:
        return g(n + 9) - 4
    return n / 20 + 28  #  float

# для каждой функции @lru_cache делает свою таблицу
[g(n) for n in range(248045, 10, -1)]
[f(n) for n in range(19, 674)]
print(int(f(673)))  # 47  # f(n) может быть float из-за деления в g(n)



# https://stepik.org/lesson/2054938/step/10?unit=2083558
"""
https://kompege.ru/task
17679 Пересдача 04.07.24(Уровень: Базовый)

Алгоритм вычисления значения функции F(n), г де n - натуральное число, задан следующими соотношениями:
F(n) = 1 при n = 1;
F(n) = (n − 1) × F(n − 1),  если n > 1.
Чему равно значение выражения  (F(2024) /7 −F(2023)) / F(2022)?
"""
from functools import lru_cache
@lru_cache()
def f(n):
    if n == 1:
        return 1
    return (n - 1) * f(n - 1)

[f(i) for i in range(1, 2025)]
print((f(2024) // 7 - f(2023)) // f(2022))  # 582336

# Решение через списки
d = [1] * 2040
for n in range(2, 2030):
    d[n] = (n - 1) * d[n - 1]
print((d[2024] // 7 - d[2023]) // d[2022])  # 582336

# Руками
# 16/001.gif



# https://stepik.org/lesson/2054938/step/11?unit=2083558
"""
https://kompege.ru/task
29083 (Уровень: Средний)
Алгоритм вычисления значения функции F(n),  где n – целое число, задан следующими соотношениями:
F(n) = 6 при n < 17;
F(n) = (n + 5) × F(n − 9), если n ≥ 17.
Чему равно значение выражения (F(234561) / 436 + F(234552) / 218) / F(234534)?
"""
from functools import lru_cache
@lru_cache()
def f(n):
    if n < 17:
        return 6
    return (n + 5) * f(n - 9)

[f(i) for i in range(234535)]
print((f(234561) // 436 + f(234552) // 218) // f(234534)) # 29598002876968
# Решается руками. Через списки будет ошибка в результате, т.к. получаются слишком большие длины чисел







# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""
""" Взято на мой курс """