""" Task 17 """

"""
1998 4414 4677 8954 23276
"""
"""
Есть на вариантах экзаменов
31514
"""


# https://stepik.org/lesson/2352898/step/2?unit=2388241
"""
https://stepik.org/lesson/603962/step/5?unit=599239
Определите и запишите в ответе сначала количество пар элементов последовательности, 
в которых хотя бы одно число делится на 7, а другое при этом не делится на 17. 
Затем - максимальную из сумм элементов таких пар.
"""
f = [*map(int, open('17/17_01.txt'))]
c = mx = 0
for a, b in zip(f, f[1:]):
    if any([not a % 7 and b % 17, not b % 7 and a % 17]):
        c += 1
        mx = max(mx, a+b)
print(c, mx)  # 2510 19632



# https://stepik.org/lesson/2352898/step/3?unit=2388241
"""
https://stepik.org/lesson/603962/step/6?unit=599239
Определите и запишите в ответе сначала количество пар элементов последовательности, 
в которых хотя бы одно число оканчивается на 6 и делится на 3. 
Затем - минимальное число в паре среди всех таких пар.
"""
f = [*map(int, open('17/17_02.txt'))]
c = mn = 0
for a, b in zip(f, f[1:]):
    if any([str(a)[-1]=='6' and not a % 3, str(b)[-1]=='6' and not b % 3]):
        c += 1
        mn = min(mn, a, b)
print(c, abs(mn))  # 587 9996



# https://stepik.org/lesson/2352898/step/4?unit=2388241
"""
https://kompege.ru/task
4414 (Уровень: Базовый)  
Определите и запишите в ответе сначала количество пар элементов последовательности, 
у которых разность элементов кратна 36 и хотя бы один из элементов кратен 13, 
затем максимальную из разностей элементов таких пар. 
В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.
"""
f = [*map(int, open('17/17_03.txt'))]
c = mx = 0
for i in range(len(f)):
    for k in range(i+1, len(f)):
        a, b = f[i], f[k]
        if not abs(a - b) % 36 and any(not i % 13 for i in (a, b)):
            c += 1
            mx = max(mx, abs(a - b))
print(c, mx)  # 212587 9972


# https://stepik.org/lesson/2352898/step/5?unit=2388241
"""
https://kompege.ru/task
8954 (Уровень: Базовый)
В файле содержится последовательность натуральных чисел. Элементы последовательности могут принимать целые значения 
от 1 до 10 000 включительно. Определите количество пар последовательности, в которых только одно число кратно 7, 
а сумма элементов пары кратна максимальному элементу последовательности, оканчивающемуся на 0F в шестнадцатеричной системе счисления. 
В ответе запишите количество найденных пар, затем максимальную из сумм элементов таких пар. 
В данной задаче под парой подразумевается два идущих подряд элемента последовательности.
"""
f = [*map(int, open('17/17_04.txt'))]
mx = max(i for i in f if f'{i:x}'[-2:]=='0f')
cnt = res = 0
for a, b in zip(f, f[1:]):
    if sum(not i % 7 for i in (a, b))==1 and not (a + b) % mx:
        cnt += 1
        res = max(res, (a + b))
print(cnt, res)  # 2 9487


# https://stepik.org/lesson/2352898/step/6?unit=2388241
"""
https://kompege.ru/task
23276 Основная волна 11.06.25 (Уровень: Базовый)
Определите количество троек элементов последовательности, в которых не более двух из трёх элементов являются четырёхзначными числами, 
а сумма элементов тройки не больше максимального элемента последовательности, оканчивающегося на 25.
В ответе запишите количество найденных троек чисел, затем максимальную из сумм элементов таких троек.
"""
f = [*map(int, open('17/17_05.txt'))]
cnt = sm = 0
mx = max(i for i in f if abs(i) % 100 == 25)
for i in range(len(f) - 2):
    ls = f[i: i + 3]
    if sum(1000 <= abs(i) < 10000 for i in ls) <= 2:
        if sum(ls) <= mx:
            cnt += 1
            sm = max(sm, sum(ls))
print(cnt, sm)  # 6315 84523


# https://stepik.org/lesson/2352898/step/7?unit=2388241
"""
https://kompege.ru/task
4677 Резервный день 2022(Уровень: Базовый)
Определите количество пар последовательности, в которых хотя бы один элемент отрицательный 
и сумма элементов меньше количества чисел в последовательности, кратных 100. 
В ответе запишите количество найденных пар, затем абсолютное значение максимальной из сумм элементов таких пар.
"""
cnt, res = 0, -200_000
f = [*map(int, open('17/17_06.txt'))]
n_100 = sum(not i % 100 for i in f)
for a, b in zip(f, f[1:]):
    if (a<0 or b<0) and a+b < n_100:
        cnt += 1
        res = max(res, a + b)
print(cnt, abs(res))  # 4963 93



# https://stepik.org/lesson/2352898/step/8?unit=2388241
"""
https://kompege.ru/task
№ 1998 (Уровень: Базовый)
В файле содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от –10 000 до 10 000 включительно. 
Определите и запишите в ответе сначала количество троек элементов последовательности, в которых произведение кратно 7, а сумма оканчивается на 5, 
затем максимальную из сумм элементов таких троек. 
"""
from math import prod, inf
f = [*map(int, open('17/17_07.txt'))]
mx = -inf
c = 0
for i in range(len(f) - 2):
    d = f[i:i + 3]
    if not prod(d) % 7 and abs(sum(d)) % 10 == 5:
        c += 1
        mx = max(mx, sum(d))
print(c, mx)  # 153 19285


# https://stepik.org/lesson/2352898/step/9?unit=2388241
"""
https://kompege.ru/task
1997 (Уровень: Средний)
Определите и запишите в ответе сначала количество пар элементов последовательности, в которых чётность чисел различна, 
при этом чётное число делится на 4, а нечётное на 11, затем максимальную из сумм элементов таких пар. 
"""
from math import inf
f = [*map(int, open('17/17_08.txt'))]
mx = -inf
cnt = 0
for a, b in zip(f, f[1:]):
    if a % 2 != b % 2:
        if a % 2:
            a, b = b, a  # even, odd
        if not a % 4 and not b % 11:
            cnt += 1
            mx = max(mx, a + b)
print(cnt, mx)  # 126 15701


# https://stepik.org/edit-lesson/2352898/step/10
"""
https://kompege.ru/task
2398 (Уровень: Средний)
Тройка идущих подряд чисел последовательности называется уникальной, если только второе из них является положительным числом, заканчивающимся на 9. 
Определите количество уникальных троек чисел, а затем – максимальную из всех сумм таких троек.
"""
res = []
f = [*map(int, open('17/17_09.txt'))]
for i in range(len(f) - 2):
    a, b, c = f[i:i+3]
    if all([a <= 0 or a % 10 != 9, c <= 0 or c % 10 != 9, b > 0 and b % 10 == 9]):
        res.append(a + b + c)
print(len(res),  max(res))  # 206 23427



# https://stepik.org/edit-lesson/2352898/step/11
"""
https://kompege.ru/task
31363 Пересдача 08.07.26(Уровень: Средний)
Определите количество троек элементов последовательности, в которых ровно два элемента из трёх оканчиваются на 3 и являются четырёхзначными числами, 
а сумма всех элементов тройки больше максимального элемента последовательности, оканчивающегося на 3 и являющегося четырёхзначным числом. 
В ответе запишите количество найденных троек, затем максимальную из сумм элементов таких троек.
"""
res = []
f = [*map(int, open('17/17_10.txt'))]
mx = max(i for i in f if 1000 <= abs(i) <= 9999 and abs(i) % 10 == 3)
for i in range(len(f) - 2):
    d = f[i:i+3]
    if sum(1000 <= abs(i) <= 9999 and abs(i) % 10 == 3 for i in d) == 2:
        if sum(d) > mx:
            res.append(sum(d))
print(len(res),  max(res))  # 2508 104796







# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""


