""" Task 18 """

"""
940 941 4598 1074 1268 9787 9841 14420 31125
"""
"""
Есть на вариантах экзаменов
31515
"""


# https://stepik.org/lesson/2322498/step/1?unit=2357573
"""
https://kompege.ru/task
1268 (Уровень: Средний)
18_01.xls
"""
# 1172 1771


# https://stepik.org/lesson/2322498/step/2?unit=2357573
"""
Квадрат разлинован на NxN клеток. Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из трёх команд: влево, вверх или влево-вверх. 
По команде влево Робот перемещается в соседнюю левую клетку, по команде вверх – в соседнюю верхнюю, 
а по команде влево-вверх – на одну клетку влево и вверх по диагонали. При попытке выхода за границу квадрата Робот разрушается.
Перед каждым запуском Робота в каждой клетке квадрата записана величина вознаграждения от 1 до 100. Попав в клетку после хода влево или вверх, 
Робот получает указанное в ней вознаграждение, а если он попал в клетку после выполнения команды влево-вверх, вознаграждение удваивается. 
Это также относится к начальной и конечной клетке маршрута Робота.
Определите максимальное и минимальное вознаграждение, которое может получить Робот, 
пройдя из правой нижней клетки в левую верхнюю. В ответе укажите два числа – сначала максимальное вознаграждение, затем минимальное.
18-95.xls
"""
# 734 343


# https://stepik.org/lesson/2322498/step/3?unit=2357573
"""
https://kompege.ru/task
1074 (Уровень: Базовый)
18_03.xls
"""
# 687 246


# https://stepik.org/lesson/2322498/step/4?unit=2357573
"""
https://kompege.ru/task
4598 Основная волна 2022(Уровень: Базовый)
18_04.xlsx
"""
# 2628 1659


# https://stepik.org/lesson/2322498/step/5?unit=2357573
"""
https://kompege.ru/task
940 (Уровень: Базовый)
18_05.xlsx
"""
# 2343 1140


# https://stepik.org/lesson/2322498/step/6?unit=2357573
"""
https://kompege.ru/task
941 (Уровень: Базовый)
18_06.xlsx
"""
# 879 2148


# https://stepik.org/lesson/2322498/step/7?unit=2357573
"""
https://kompege.ru/task
9841 Основная волна 27.06.23(Уровень: Базовый)
18_07.xls
"""
# 2071 649



# https://stepik.org/lesson/2322498/step/8?unit=2357573
"""
https://kompege.ru/task
14420 (Уровень: Средний)
18_08.xlsx
"""
# 2025 448



# https://stepik.org/lesson/2322498/step/9?unit=2357573
"""
https://kompege.ru/task
9787 Основная волна 20.06.23(Уровень: Базовый)
18_09.xlsx
"""
# 1978 749



# https://stepik.org/lesson/2322498/step/10?unit=2357573
"""
https://kompege.ru/task
31125 Основная волна 18.06.26(Уровень: Базовый)
18_10.ods
"""
# 2320 860



# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""
#



# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""
#



# NEW
"""
1133 (Уровень: Базовый)
2156 (Уровень: Средний)
1918 (Уровень: Сложный)

"""

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""