""" Task 18 """

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""



# https://stepik.org/lesson/2322498/step/2?unit=2357573
"""
https://kompege.ru/task
1268 (Уровень: Средний)

Квадрат разлинован на NxN клеток. Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из двух команд: вправо или вниз. По команде вправо Робот перемещается в соседнюю правую клетку, по команде вниз – в соседнюю нижнюю. При попытке выхода за границу квадрата Робот разрушается. Перед каждым запуском Робота в каждой клетке квадрата записано натуральное число, не превышающее 100. 
Перемещаясь по клеткам квадрата, Робот вычисляет сумму следующим образом. Начальное значение суммы - значение той клетки, из которой Робот начинает движение. При посещении клетки, Робот прибавляет к сумме удвоенное значение, записанное в клетке, если он попал в эту клетку из соседней сверху клетки, и прибавляет к сумме утроенное значение, записанное в клетке, если он попал в эту клетку из соседней слева клетки.

Определите максимальную и минимальную денежную сумму, которую может собрать Робот, пройдя из левой верхней клетки в правую нижнюю. В ответе укажите два числа – сначала минимальную сумму, затем максимальную.
Файл к заданию: 18.xls
"""
# 1172 1771


# https://stepik.org/lesson/2322498/step/3?unit=2357573
"""
Квадрат разлинован на NxN клеток. Исполнитель Робот может перемещаться по клеткам, выполняя за одно перемещение одну из трёх команд: влево, вверх или влево-вверх. По команде влево Робот перемещается в соседнюю левую клетку, по команде вверх – в соседнюю верхнюю, а по команде влево-вверх – на одну клетку влево и вверх по диагонали. При попытке выхода за границу квадрата Робот разрушается.
Перед каждым запуском Робота в каждой клетке квадрата записана величина вознаграждения от 1 до 100. Попав в клетку после хода влево или вверх, Робот получает указанное в ней вознаграждение, а если он попал в клетку после выполнения команды влево-вверх, вознаграждение удваивается. Это также относится к начальной и конечной клетке маршрута Робота.

Определите максимальное и минимальное вознаграждение, которое может получить Робот, пройдя из правой нижней клетки в левую верхнюю. В ответе укажите два числа – сначала максимальное вознаграждение, затем минимальное.
Файл к заданию: 18.xls
"""
# 734 343


# NEW
"""
1133 (Уровень: Базовый)
2156 (Уровень: Средний)
1918 (Уровень: Сложный)

"""