""" Task 19_21 """

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""


# https://stepik.org/lesson/2335199/step/1?unit=2370417
"""
https://kompege.ru/task
# 9788 Основная волна 20.06.23 (Уровень: Базовый)
Задание 19.
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. 
За один ход игрок может добавить в кучу один или три камня либо увеличить количество камней в куче в четыре раза. Для того, чтобы делать ходы, у каждого игрока есть неограниченное количество камней.
Игра завершается в тот момент, когда количество камней в куче становится не менее 59.
Победителем считается игрок, сделавший последний ход, т.е. первым получивший кучу, состоящую из 59 или более камней.
В начальный момент в куче было S камней; 1 ≤ S ≤ 58.
Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.

Задание 19.
Укажите такое значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.

Задание 20.
Для игры, описанной в задании 19, найдите два таких минимальных значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
− Петя не может выиграть за один ход;
− Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.

Задание 21.
Для игры, описанной в задании 19, найдите минимальное значение S, при котором одновременно выполняются два
условия:
– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
Если найдено несколько значений S, в ответе запишите наименьшее из них.
"""
def f(a, m):
    if a >= 59:
        return not m % 2
    if not m:
        return 0
    g = [f(a+1, m-1), f(a+3, m-1), f(a*4, m-1)]
    return any(g) if m % 2 else all(g)
print(*[s for s in range(1, 59) if f(s,2)])
print(*[s for s in range(1, 59) if f(s,3) and not f(s, 1)][:2])
print([s for s in range(1, 59) if f(s,4) and not f(s, 2)][0])
"""
14
11 13
10
"""



# https://stepik.org/lesson/2335199/step/2?unit=2370417
"""
https://kompege.ru/task
846 (Уровень: Базовый)
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может
  а) добавить в кучу один камень;
  б) добавить в кучу два камня;
  в) увеличить количество камней в куче в три раза.
Игра завершается в тот момент, когда количество камней в куче превышает 64. 
Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 65 или больше камней. В начальный момент в куче было S камней, 1 ≤ S ≤ 64.

Задание 19.
Найдите значение S, при котором Ваня выигрывает своим первым ходом при любой игре Пети

Задание 20.
Для игры, описанной в задании 19, найдите минимальное и максимальное значение S, при котором у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
− Петя не может выиграть за один ход;
− Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания (через пробел).

Задание 21.
Для игры, описанной в задании 19, найдите значение S, при котором одновременно выполняются два условия:
– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом
"""
def f(a, m):
    if a >= 65:
        return not m % 2
    if not m:
        return 0
    g = [f(a + 1, m - 1), f(a + 2, m - 1), f(a * 3, m - 1)]
    return any(g) if m % 2 else all(g)

print([a for a in range(1, 65) if f(a, 2)][-1])
s20 = [a for a in range(1, 65) if f(a, 3) and not f(a, 1)]
print(s20[0], s20[-1])
print(*[a for a in range(1, 65) if f(a, 4) and not f(a,2)])
"""
21
7 20
18
"""


# https://stepik.org/lesson/2335199/step/3?unit=2370417
"""
https://kompege.ru/task
17875 Демоверсия 2025 (Уровень: Базовый)

Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может: убрать из кучи два камня или убрать из кучи пять камней или уменьшить количество камней в куче в три раза (количество камней, полученное при делении, округляется до меньшего). Например, из кучи в 20 камней за один ход можно получить кучу из 18, 15 или 6 камней. Игра завершается, когда количество камней в куче становится не более 19.
Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 19 или меньше камней. В начальный момент в куче было S камней, S ≥ 20.
Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.

Задание 19.
Укажите минимальное значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.

Задание 20.
Для игры, описанной в задании 19, найдите два наименьших значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
– Петя не может выиграть за один ход;
– Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.

Задание 21.
Для игры, описанной в задании 19, найдите минимальное значение S, при котором одновременно выполняются два условия:
– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
"""
def f(a, m):
    if a <= 19:
        return not m % 2
    if not m:
        return 0
    g = [f(a-2, m-1), f(a-5, m-1), f(a//3, m-1)]
    return any(g) if m % 2 else all(g)

print([s for s in range(20, 200) if f(s, 2)][0])
print(*[s for s in range(20, 200) if f(s, 3) and not f(s, 1)][:2])
print([s for s in range(20, 200) if f(s, 4) and not f(s, 2)][0])
"""
60
62 63
64
"""


# https://stepik.org/lesson/2335199/step/4?unit=2370417
"""
https://kompege.ru/task
№ 17875 Демоверсия 2025 (Уровень: Базовый)

Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может: убрать из кучи два камня или убрать из кучи пять камней или уменьшить количество камней в куче в три раза (количество камней, полученное при делении, округляется до меньшего). Например, из кучи в 20 камней за один ход можно получить кучу из 18, 15 или 6 камней. Игра завершается, когда количество камней в куче становится не более 19.
Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 19 или меньше камней. В начальный момент в куче было S камней, S ≥ 20.
Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника.

Задание 19.
Укажите минимальное значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.

Задание 20.
Для игры, описанной в задании 19, найдите два наименьших значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
– Петя не может выиграть за один ход;
– Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания. 

Задание 21.
Для игры, описанной в задании 19, найдите минимальное значение S, при котором одновременно выполняются два условия:
– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом. 
"""
def f(a, m):
    if a <= 19:
        return not m % 2
    if not m:
        return 0
    g = [f(a-2, m-1), f(a-5, m-1), f(a//3, m-1)]
    return any(g) if m % 2 else all(g)

print([s for s in range(20, 200) if f(s, 2)][0])
print(*[s for s in range(20, 200) if f(s, 3) and not f(s, 1)][:2])
print([s for s in range(20, 200) if f(s, 4) and not f(s, 2)][0])
"""
60
62 63
64
"""


# https://stepik.org/lesson/2335199/step/4?unit=2370417
"""
https://kompege.ru/task
2364 (Уровень: Средний)

Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может
а) добавить в кучу один камень;
б) добавить в кучу два камня;
в) добавить в кучу три камня.
Игра завершается в тот момент, когда количество камней в куче превышает 20. Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 21 или больше камней. В начальный момент в куче было S камней, 1 ≤ S ≤ 20.

Задание 19
Известно, что Ваня может гарантированно выиграть своим первым ходом. Укажите значение S, с которого началась игра.

Задание 20.
Укажите три значения S, при которых у Пети есть выигрышная стратегия, причём Петя может выиграть своим третьим ходом, независимо от того, как будет ходить Ваня. В ответе запишите полученные значения в порядке возрастания.

Задание 21.
Найдите количество значений S, при котором у Вани есть выигрышная стратегия, позволяющая ему выиграть при любой игре Пети.
"""
def f(s, m):
    if s > 20:
        return not m % 2
    if not m:
        return 0
    g = [f(s + 1, m - 1), f(s + 2, m - 1), f(s + 3, m - 1)]
    return any(g) if m % 2 else all(g)


print([s for s in range(1, 21) if f(s, 2)][0])
print(*[s for s in range(1, 21) if f(s, 5)][:3])
print(len([s for s in range(1, 21) if f(s, 10)]))  #  10 ходов хватит перебрать все камни
"""
17
10 11 12
5
"""



# https://stepik.org/lesson/2335199/step/5?unit=2370417
"""
https://kompege.ru/task   
№ 9750 (Уровень: Средний)

Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может выполнить любое из следующих действий:
1) убрать из кучи пять камней;
2) если количество камней в куче чётно, уменьшить его в два раза;
3) если количество камней в куче кратно трём, уменьшить его в три раза;
4) если количество камней в куче нечётно и не кратно трём, добавить один камень.
Например, если в куче 12 камней, то за один ход можно получить 7, 6 или 4 камня, а если в куче 11 камней, то за один ход можно получить 6 или 12 камней. 
Игра завершается, когда количество камней в куче становится не более 19. Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 19 или меньше камней. 
В начале игры в куче было S камней, S > 19

Задание 19.
Укажите минимальное значение S, при котором Петя не может выиграть первым ходом, но при любом первом ходе Пети Ваня может выиграть своим первым ходом.

Задание 20.
Найдите два наименьших значения S, при которых Петя не может выиграть первым ходом, но у Пети есть выигрышная стратегия, позволяющая ему выиграть вторым ходом при любой игре Вани.
В ответе запишите найденные значения в порядке возрастания.

Задание 21.
Найдите минимальное значение S, при котором у Вани есть стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети, но у Вани нет стратегии, которая позволила бы ему гарантированно выиграть первым ходом.
"""
def f(a, m):
    if a <= 19:
        return not m % 2
    if not m:
        return False
    g = [f(a-5, m-1)]
    if not a % 2:
        g += [f(a // 2, m-1)]
    if not a % 3:
        g += [f(a // 3, m - 1)]
    if a % 2 and a % 3:
        g += [f(a + 1, m - 1)]
    return any(g) if m % 2 else all(g)

print([a for a in range(20, 100) if f(a, 2)][0])
print(*[a for a in range(20, 100) if f(a, 3) and not f(a, 1)][:2])
print([a for a in range(20, 100) if f(a, 4) and not f(a, 2)][0])
"""
25
40 43
60
"""


# https://stepik.org/lesson/2335199/step/6?unit=2370417
"""
https://kompege.ru/task   
№ 18958 (Уровень: Базовый)
Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит одна куча камней. Игроки ходят по очереди, первый ход делает Петя. 
За один ход игрок может добавить в кучу три камня, увеличить количество камней в куче в три раза или добавить в кучу возведённое в квадрат количество камней в ней. 
Например, пусть в куче 10 камней, тогда игрок после своего хода может получить кучу из 13 камней, 30 камней или 110 камней. Игра завершается в тот момент, когда количество камней в куче становится более 665. 
Победителем считается игрок, сделавший последний ход, то есть первым получивший позицию, в которой в куче будет 666 или больше камней. В начальный момент в куче было S камней, S < 666.

Задание 19.
Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите минимальное значение S, когда такая ситуация возможна.

Задание 20.
Для игры, описанной в задании 19, найдите минимальное и максимальное значения S, при котором у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
− Петя не может выиграть за один ход;
− Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.

Задание 21.
Для игры, описанной в задании 19, найдите наибольшее значение S, при котором одновременно выполняются два условия:
– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
"""
def f(a, m, w=0):
    if a >= 665:
        return not m % 2
    if not m:
        return 0
    g = [f(a+3, m-1), f(a*3, m-1), f(a + a**2, m-1),]
    if m % 2:
        return any(g)
    return any(g) if w else all(g)

print([s for s in range(1, 666) if f(s, 2, 1)][0])
s20 = [s for s in range(1, 666) if f(s, 3) and not f(s, 1)]
print(s20[0], s20[-1])
print([s for s in range(1, 666) if f(s, 4) and not f(s, 2)][-1])
"""
5
8 22
19
"""


# https://stepik.org/lesson/2335199/step/7?unit=2370417
"""
https://kompege.ru/task   
3970 (Уровень: Базовый)

Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит лист бумаги, на котором написано двоичное число. Игроки ходят почереди, первый ход делает Петя. 
За один ход игрок может приписать справа или слева к имеющемуся на листе числу двоичную запись любого из чисел вида 2n + 1, где п - произвольное натуральное число, либо приписать справа или слева от имеющегося на листе числа его копию. 
Например, имея двоичное число 11001, за один ход можно получить путём копирования число 1100111001 или путём приписывания двоичной записи числа 3 числа 1100111 или 1111001.
Игра завершается в тот момент, когда количество единиц в двоичной записи числа на листе станет больше или равно 60. 
Победителем считается игрок, сделавший последний ход, т. е. первым получивший двоичное число, в записи которого использовано 60 или более единиц.
В начальный момент единиц в числе было S; 1 ≤ S ≤ 58.
Задание 19.
Известно, что Ваня выиграл своим первым ходом после неудачного первого хода Пети. Укажите минимальное значение S, когда такая ситуация возможна.

Задание 20.
Найдите такие значения S, при которых Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
- Петя не может выиграть за один ход;
- Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Из всех найденных значений запишите в ответе минимальное и максимальное в порядке возрастания.

Задание 21.
Найдите минимальное значение S, при котором одновременно выполняются два условия:
- у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
- у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
"""
# for n in range(1, 21):
#     print(f'{2**n + 1:b}')
#     print(f'{2**n + 1:b}'.count('1'))  # всегда 2  ✅
def f(a, m, w=0):
    if a >= 60:
        return not m % 2
    if not m:
        return 0
    g = [f(a+2, m-1), f(a*2, m-1)]
    if m % 2:
        return any(g)
    return any(g) if w else all(g)

print([s for s in range(1, 58) if f(s, 2, 1)][0])
s20 = [s for s in range(1, 58) if f(s, 3) and not f(s, 1)]
print(s20[0], s20[-1])
print([s for s in range(1, 58) if f(s, 4) and not f(s, 2)][0])
"""
15
14 27
24
"""


# https://stepik.org/lesson/2335199/step/8?unit=2370417
"""
https://kompege.ru/task
1202 Апробация 27.04 (Уровень: Базовый)

Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежат две кучи камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в одну из куч (по своему выбору) один камень или увеличить количество камней в куче в два раза. 
Например, пусть в одной куче 7 камней, а в другой 5 камней; такую позицию в игре будем обозначать (7, 5). Тогда за один ход можно получить любую из четырёх позиций: (8, 5), (14, 5), (7, 6), (7, 10). 
Для того чтобы делать ходы, у каждого игрока есть неограниченное количество камней.
Игра завершается в тот момент, когда суммарное количество камней в кучах становится не менее 59. Победителем считается игрок, сделавший последний ход, т.е. первым получивший такую позицию, что в кучах всего будет 59 камней или больше.
В начальный момент в первой куче было пять камней, во второй куче — S камней; 1 < S < 53.
Будем говорить, что игрок имеет выигрышную стратегию, если он может выиграть при любых ходах противника. Описать стратегию игрока — значит описать, какой ход он должен сделать в любой ситуации, которая ему может встретиться при различной игре противника. 
В описание выигрышной стратегии не следует включать ходы играющего по этой стратегии игрока, не являющиеся для него безусловно выигрышными, т.е. не являющиеся выигрышными независимо от игры противника.

Задание 19.
Укажите минимальное значение S, при котором Петя может выиграть своим первым ходом.

Задание 20.
Найдите два значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
  — Петя не может выиграть за один ход;
  — Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.

Задание 21.
Найдите минимальное значение S, при котором одновременно выполняются два условия:
  — у Вани есть выигрышная стратегия, позволяющая ему выиграть своим первым или вторым ходом при любой игре Пети;
  — у Вани нет стратегии, которая позволит ему гарантированно выиграть своим первым ходом.
"""
def f(a, b, m):
    if a + b >= 59:
        return not m % 2
    if not m:
        return False
    g = [f(a+1, b, m-1), f(a*2, b, m-1), f(a, b+1, m-1), f(a, b*2, m-1)]
    return any(g) if  m % 2 else all(g)

print([a for a in range(1, 53) if f(a, 5, 1)][0])
print(*[a for a in range(1, 53) if f(a, 5, 3) and not f(a, 5, 1)])
print([a for a in range(1, 53) if f(a, 5, 4) and not f(a, 5, 2)][0])
"""
27
24 26
23
"""


# https://stepik.org/lesson/2335199/step/9?unit=2370417
"""
https://kompege.ru/task
884 Джобс 25.12.2020 (Уровень: Средний)

Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит две кучи камней. Игроки ходят по очереди, первый ход делает Петя. 
За один ход игрок может добавить в любую кучу один камень или увеличить количество камней в любой куче в два раза. Игра завершается в тот момент, когда сумма камней в кучах становится не менее 30. 
В начальный момент в первой куче было K камней, а во второй – S камней, 1 ≤ K ≤ 29, 1 ≤ S ≤ 29.

Задание 19.
Сколько существует пар (S; K), таких что Ваня выигрывает первым ходом при любой игре Пети?

Задание 20.
При K=6, найдите минимальное и максимальное значение S, при котором у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
 − Петя не может выиграть за один ход;
 − Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания

Задание 21.
Сколько существует пар (S;K), при котором одновременно выполняются два условия:
 – у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
 – у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
"""
def f(a, b, m):
    if a+b >= 30:
        return not m % 2
    if not m:
        return 0
    g = [f(a+1, b, m-1), f(a*2, b, m-1), f(a, b+1, m-1), f(a, b*2, m-1)]
    return any(g) if m % 2 else all(g)

s19 = [(a, b) for a in range(1, 30) for b in range(1, 30) if a+b < 30]
print(len([i for i in s19 if f(i[0], i[1], 2)]))
s20 = [s for s in range(1, 30) if f(6, s, 3) and not f(6, s, 1)]
print(s20[0], s20[-1])
print(len([i for i in s19 if f(i[0], i[1], 4) and not f(i[0], i[1], 2)]))
"""
10
5 11
8
"""



# https://stepik.org/lesson/2335199/step/10?unit=2370417
"""
https://kompege.ru/task
844 (Уровень: Средний)

Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может
  а) добавить в кучу один камень;
  б) увеличить количество камней в куче в два раза;
  в) увеличить количество камней в куче в три раза.
Игра завершается в тот момент, когда количество камней в куче становится не менее 43. Если при этом в куче оказалось не более 72 камней, то победителем считается игрок, сделавший последний ход. В противном случае победителем становится его противник (при этом победа учитывается как ход противника). В начальный момент в куче было S камней, 1 ≤ S ≤ 42.

Задание 19.
Найдите минимальное значение S, при котором Ваня выигрывает своим первым ходом при любой игре Пети.

Задание 20.
Определите сколько существует значений S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
 − Петя не может выиграть за один ход;
 − Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.

Задание 21.
Найдите минимальное и максимальное значения S, при которых одновременно выполняются два условия:
 – у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
 – у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
Найденные значения запишите в ответе в порядке возрастания.
"""
def f(a, m):
    if 43 <= a <= 72:
        return not m % 2
    if a > 72:
        return m % 2 # если противник перелетел
    if not m:
        return 0
    g = [f(a+1, m-1), f(a*2, m-1), f(a*3, m-1)]
    return any(g) if m % 2 else all(g)

print([s for s in range(1, 43) if f(s, 2)][0])
print(len([s for s in range(1, 43) if f(s, 3) and not f(s, 1)]))
s21 = [s for s in range(1, 43) if f(s, 4) and not f(s, 2)]
print(s21[0], s21[-1])
"""
14
3
12 39
"""



# https://stepik.org/lesson/2335199/step/11?unit=2370417
"""
https://kompege.ru/task
2575 (Уровень: Средний)

Два игрока, Петя и Ваня, играют в следующую игру. Перед игроками лежит куча камней. Игроки ходят по очереди, первый ход делает Петя. За один ход игрок может добавить в кучу один камень, добавить два камня или увеличить количество камней в куче в три раза. 
При этом нельзя повторять ход, который только что сделал второй игрок. 
Например, если в начале игры в куче 4 камня, Петя может первым ходом получить кучу из 5, 6 или 12 камней. Если Петя добавил 1 камень и получил кучу из 5 камней, то следующим ходом Ваня может либо добавить 2 камня (и получить 7 камней), либо утроить количество камней в куче (их станет 15). Получить 6 камней Ваня не может, так как для этого нужно добавить 1 камень, а такой ход только что сделал Петя.
Чтобы делать ходы, у каждого игрока есть неограниченное количество камней.
Игра завершается, когда количество камней в куче становится не менее 62. Победителем считается игрок, сделавший последний ход, то есть первым получивший кучу, в которой будет 62 или больше камней. В начальный момент в куче было S камней, 1 ≤ S ≤ 61.

Задание 19.
Укажите такое значение S, при котором Петя не может выиграть за один ход, но при любом ходе Пети Ваня может выиграть своим первым ходом.

Задание 20.
Определите минимальное и максимальное значения S, при которых у Пети есть выигрышная стратегия, причём одновременно выполняются два условия:
− Петя не может выиграть за один ход;
− Петя может выиграть своим вторым ходом независимо от того, как будет ходить Ваня.
Найденные значения запишите в ответе в порядке возрастания.

Задание 21.
Найдите значение S, при котором одновременно выполняются два условия:
– у Вани есть выигрышная стратегия, позволяющая ему выиграть первым или вторым ходом при любой игре Пети;
– у Вани нет стратегии, которая позволит ему гарантированно выиграть первым ходом.
"""
def f(a, m, c=''):  # параметр 'c' запоминает текущий ход в игре
    if a >= 62:
        return not m % 2
    if not m:
        return 0
    g = []
    if c != '+1':
        g += [f(a+1, m-1, '+1')]
    if c != '+2':
        g += [f(a+2, m-1, '+2')]
    if c != '*3':
        g += [f(a*3, m-1, '*3')]
    return any(g) if m % 2 else all(g)

print(*[s for s in range(1, 62) if f(s, 2, 1)])
s20 = [s for s in range(1, 62) if f(s, 3) and not f(s, 1)]
print(s20[0], s20[-1])
print(*[s for s in range(1, 62) if f(s, 4) and not f(s, 2)])
"""
20
7 19
6
"""





# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""







