""" Task 23 """

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""


# https://stepik.org/lesson/2304296/step/2?unit=2339050
"""
https://stepik.org/lesson/460368/step/11?auth=login&unit=450951

У исполнителя Калькулятор две команды, которым присвоены номера:
 прибавь 1
 умножь на 2
Сколько есть программ, которые число 1 преобразуют в число 16?  
"""
def f(a, b):
    if a > b:
        return 0
    if a == b:
        return 1
    return f(a + 1, b) + f(a * 2, b)
print(f(1, 16))  # 36


# https://stepik.org/lesson/2304296/step/3?unit=2339050
"""
https://stepik.org/lesson/569846/step/6?unit=564380

У исполнителя две команды, которым присвоены номера:
прибавь 1
умножь на 3

Сколько есть программ, которые число 2 преобразуют в число 18, и при этом траектория вычислений содержит число 15?
"""
def fn(a, b):
    if a > b:
        return 0
    if a == b:
        return 1
    return fn(a + 1, b) + fn(a * 3, b)
print(fn(2, 15) * fn(15, 18))  # 5


# https://stepik.org/lesson/2304296/step/4?unit=2339050
"""
https://kompege.ru/task
27633 Апробация 04.03.26 (Уровень: Базовый)

Исполнитель преобразует число на экране. У испол
нителя есть две команды, которые обозначены латинскими буквами:
A. Вычти 1
B. Найди целую часть от деления на 2
Первая из них уменьшает число на экране на 1, вторая заменяет число на экране на целую части от деления числа на 2. 
Программа для исполнителя - это последовательность команд.
Сколько существует программ, для которых при исходном числе 40 результатом является 6, и при этом траектория вычислений содержит число 17?
"""
def fn(a, b):
    if a < b:
        return 0
    if a == b:
        return 1
    return fn(a - 1, b) + fn(a // 2, b)
print(fn(40, 17) * fn(17, 6))  # 56


# https://stepik.org/lesson/2304296/step/5?unit=2339050
"""
https://stepik.org/lesson/569846/step/8?unit=564380

У исполнителя три команды, которым присвоены номера:
1. прибавь 1
2. прибавь 3
3. умножь на 2
Сколько есть программ, которые число 4 преобразуют в число 28, и при этом траектория вычислений НЕ содержит число 14?
"""
def fn(a, b):
    if a > b or a == 14:
        return 0
    if a == b:
        return 1
    return fn(a + 1, b) + fn(a + 3, b) + fn(a * 2, b)
print(fn(4, 28))  # 3780


# https://stepik.org/lesson/2304296/step/6?unit=2339050
"""
https://kompege.ru/task
25360 ЕГКР 13.12.25 (Уровень: Базовый)

Исполнитель преобразует число, записанное на экране. У исполнителя есть три команды, которые обозначены латинскими буквами:
A. вычти 3
В. вычти 6
C. найди целую часть от деления на 2
Сколько существует программ, для которых при исходном числе 86 результатом является 12, при этом траектория вычислений содержит число 53 и не содержит 36?
Траектория вычислений программы - это последовательность результатов выполнения всех команд программы.
"""
def fn(a, b):
    if a < b or a == 36:
        return 0
    if a == b:
        return 1
    return fn(a - 3, b) + fn(a - 6, b) + fn(a // 2, b)
print(fn(86, 53) * fn(53, 12))  # 144


# https://stepik.org/lesson/2304296/step/7?unit=2339050
"""
Исполнитель преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
1. Вычесть 1
2. Вычесть 3
3. Взять остаток от деления на 4
Программа для исполнителя – это последовательность команд. 
Команда 3 выполняется только для чисел, больших, чем 4.
Сколько существует таких программ, которые исходное число 22 преобразуют в число 2?
"""
def fn(a, b):
    if a < b:
        return 0
    if a == b:
        return 1
    if a > 4:
        return fn(a - 1, b) + fn(a - 3, b) + fn(a % 4, b)
    return fn(a - 1, b) + fn(a - 3, b)
print(fn(22, 2))


# https://stepik.org/lesson/2304296/step/8?unit=2339050
"""
https://kompege.ru/task
27312 (Уровень: Средний)
У исполнителя имеются три команды, которые обозначены латинскими буквами:
A. Вычесть 1
B. Найти целую часть от деления на 2
C. Найти целую часть от деления на 3
Программа для исполнителя – это последовательность команд. 
Сколько существует программ, для которых при исходном числе 106 результатом является 6, 
при этом траектория вычислений содержит ровно одно из чисел 48 или 61 (но не оба одновременно)?
"""
def fn(a, b, c=0):
    c += a in (48, 61)
    if a < b or c > 1:
        return 0
    if a == b and c == 1:
        return 1
    return fn(a - 1, b, c) + fn(a // 2, b, c) + fn(a // 3, b, c)
print(fn(106, 6))  # 4128

