""" Task 23_02 """
# Задачи с поиском чисел по количеству программ.



# https://stepik.org/lesson/2304302/step/2?unit=2339056
"""
https://stepik.org/lesson/644891/step/2?unit=641496

У исполнителя Калькулятор есть три команды, которым присвоены номера:
1. Прибавить 1
2. Прибавить 5
3. Умножить на 3
Определите число, для получения которого из числа 1 существует 175 программ.
"""
def f(a, b):
    if a == b:
        return 1
    if a > b:
        return 0
    return f(a + 1, b) + f(a + 5, b) + f(a * 3, b)

for n in range(100):
    if f(1, n) == 175:
        print(n)  # 19
        break


# https://stepik.org/lesson/2304302/step/3?unit=2339056
"""
https://stepik.org/lesson/564227/step/3?unit=558475

У исполнителя Калькулятор есть три команды, которым присвоены номера:
Прибавить 1
Прибавить 5
Умножить на 3
Найдите длину самой короткой программы, в результате выполнения которой при исходном числе 1 результатом является число 227.
"""
# k - за сколько шагов должны придти к цели,  c=0 - подсчет шагов
def f(a, k, c=0):
    if a == 227 and c==k:
        return 1
    if a > 227 or c > k:  # без  c > k  уйдем в бесконечность в строке  if a == 227 and c==k:
        return 0
    return f(a + 1, k, c + 1) + f(a + 5, k, c + 1) +  f(a * 3, k, c + 1)

for k in range(1, 100):
    if f(1, k):
        print(k)  # 7
        break


# https://stepik.org/lesson/2304302/step/4?unit=2339056
"""
https://stepik.org/lesson/564227/step/4?unit=558475

Исполнитель Калькулятор преобразует число на экране. У исполнителя есть три команды, которым присвоены номера:
Прибавить 1
Прибавить 2
Умножить на 3
Сколько существует программ минимальной длины, в результате выполнения которых при исходном числе 1 результатом является число 31?
"""
res = []  # собираем значения (кол-во шагов) для всех подходящих программ
def f(a, b, k=0):  # k - кол-во шагов ведущие к числу b
    if a == b:
        res.append(k)
    if a < b:
        # собираем все программы (их кол-во шагов) приводящие к числу b (в т.ч. и с одинаковым кол-вом шагов)
        f(a + 1, b, k + 1)
        f(a + 2, b, k + 1)
        f(a * 3, b, k + 1)

f(1,31)
# print(min(res))  # 5  - минимальное кол-во шагов
print(res.count(min(res)))  # 4



# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""


# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""


# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""