""" Task 24 """

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""
""" Взято на мой курс """


"""
https://stepik.org/lesson/1653781/step/2?unit=2323600
Текстовый файл состоит не более чем из 106 символов X, Y и Z. Определите максимальную длину цепочки вида XYZXYZXYZ... (составленной из фрагментов XYZ, последний фрагмент может быть неполным).

Ниже приведён файл, который необходимо обработать с помощью данного алгоритма.
EGE/24/24_001.txt
"""
s = open('24.txt').read()
cnt = 0
c = 2
for i in range(1, len(s) - 1):
    w = s[i-1:i+2]
    if w in 'XYZXY':
        c += 1
        cnt = max(c, cnt)
    else:
        c = 2
print(cnt)  # 13


"""
https://stepik.org/lesson/1653781/step/3?unit=2323600

Текстовый файл  состоит не более чем из 106 символов - заглавных латинских букв и цифр. Определите максимальное число, состоящее только из чётных цифр. Под числом подразумевается последовательность цифр, ограниченная другими символами (не цифрами).

Ниже приведён файл, который необходимо обработать с помощью данного алгоритма.
"""
from re import *
s = open('add/24.txt').read()
# reg = r'(?<=[A-Z])[02468]*(?=[A-Z])'
reg = r'(?<=\D)[02468]+(?=\D)'  # ноль в начале допустим
res = findall(reg, s)
print(max(map(int, res)))  # 4444

# variant
from string import ascii_uppercase as W
s = open('24.txt').read().strip()
# print(s[0], s[-1])  # Проверка - обязательно должны быть буквы на концах или нечетные цифры
for i in W:
    s = s.replace(i, ' ')
for i in '3579':
    s = s.replace(i, '1')
s = s.split()
res = [i for i in s if '1' not in i]
print(max(map(int, res)))  # 4444

