""" Task 24 - 01 """

"""

"""
"""
Есть на вариантах экзаменов
17878
"""




# https://stepik.org/lesson/1653781/step/2?unit=2323600
"""
Текстовый файл состоит не более чем из 106 символов X, Y и Z. 
Определите максимальную длину цепочки вида XYZXYZXYZ... (составленной из фрагментов XYZ, последний фрагмент может быть неполным).
Ниже приведён файл, который необходимо обработать с помощью данного алгоритма.
EGE/24/24_1_01.txt
"""
s = open('24.txt').read()
cnt = 0
c = 2
for i in range(1, len(s) - 1):
    w = s[i-1:i+2]
    if w in 'XYZXY':
        c += 1
        cnt = max(c, cnt)
    else:
        c = 2
print(cnt)  # 13


# https://stepik.org/lesson/1653781/step/3?unit=2323600
"""
Текстовый файл  состоит не более чем из 106 символов - заглавных латинских букв и цифр. Определите максимальное число, состоящее только из чётных цифр. 
Под числом подразумевается последовательность цифр, ограниченная другими символами (не цифрами).
Ниже приведён файл, который необходимо обработать с помощью данного алгоритма.
EGE/24/24_1_02.txt
"""
from re import *
s = open('add/24.txt').read()
# reg = r'(?<=[A-Z])[02468]*(?=[A-Z])'
reg = r'(?<=\D)[02468]+(?=\D)'  # ноль в начале допустим
res = findall(reg, s)
print(max(map(int, res)))  # 4444

# variant
from string import ascii_uppercase as W
s = open('24.txt').read().strip()
# print(s[0], s[-1])  # Проверка - обязательно должны быть буквы на концах или нечетные цифры
for i in W:
    s = s.replace(i, ' ')
for i in '3579':
    s = s.replace(i, '1')
s = s.split()
res = [i for i in s if '1' not in i]
print(max(map(int, res)))  # 4444


# https://stepik.org/lesson/1653781/step/4?unit=2323600
"""
https://stepik.org/lesson/657266/step/10?unit=654468

В текстовом файле находится цепочка из символов, в которую могут входить заглавные буквы латинского алфавита A…Z и десятичные цифры. 
Найдите длину самой длинной подцепочки, состоящей из одинаковых символов. Если в файле несколько цепочек одинаковой длины, нужно взять первую из них. 
Выведите сначала символ, из которого строится эта подцепочка, а затем через пробел – длину этой подцепочки.
EGE/24/24_1_03.txt
"""
s = open('24.txt').read()
c = cnt = 1
w = char = ''
for i in range(len(s) - 1):
    if s[i] == s[i+1]:
        c += 1
        if c > cnt:  # ">" гарантия сохранения первого макс. знач. из подобных (">=" будет последнее макс. знач.)
            char = s[i]
            cnt = c
    else:
        c = 1
print(char, cnt)  # W 4



# https://stepik.org/lesson/1653781/step/5?unit=2323600
"""
https://stepik.org/lesson/657434/step/2?unit=654549

Текстовый файл содержит только заглавные буквы латинского алфавита (ABC…Z). Определите символ, который чаще всего встречается в файле сразу после буквы A. 
В ответе запишите сначала этот символ, а потом сразу (без разделителя) сколько раз он встретился после буквы А. Если таких символов несколько, нужно вывести тот, который стоит раньше в алфавите. 
Например, в тексте ABCAABADDD после буквы A два раза стоит B, по одному разу – A и D. Для этого текста ответом будет B2
"""
alf = sorted('QWERTYUIOPASDFGHJKLZXCVBNM')
s = open('24.txt').read()
d = [0]*26
for a,b in zip(s, s[1:]):
    if a == 'A':
        d[alf.index(b)] +=1
mx = max(d)
smb = alf[d.index(mx)]
print(smb, mx, sep='') # L1567

# variant
s = open('24.txt').read()
from string import ascii_uppercase as alf

d = {i: 0 for i in alf}
for a,b in zip(s, s[1:]):
    if a == 'A':
        d[b] += 1
d = sorted([(a, b) for a, b in d.items()], key=lambda x: (-x[1], x[0]))
print(*d[0], sep='') # L1567




# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""


# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""

# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""
""" Взято на мой курс """
