""" Task 25 """


# https://stepik.org/lesson/2350067/step/1?unit=2385488
"""
https://stepik.org/lesson/1228669/step/3?unit=1242202

Найдите 5 чисел больших 500000, таких, что среди их делителей есть число, оканчивающееся на 8, при этом этот делитель не равен 8 и самому числу. 
В качестве ответа приведите 5 наименьших чисел, соответствующих условию.

Формат вывода: для каждого из 5 таких найденных чисел в отдельной строке сначала выводится само число, затем минимальный делитель, оканчивающийся на 8, не равный 8 и самому числу.
"""
def dv(n):
    r = set()
    for i in range(18, int(n**0.5 + 1)):  # ✅ от 18-ти !!!
        if not n % i:
            r |= {i, n // i}
    r = [i for i in r if i % 10 == 8]
    return min(r, default=0)

c = 5
for n in range(500000, 10**10):
    d = dv(n)
    if d:
        print(n, d)
        c -= 1
    if not c:
        break
"""
500002 178
500004 18
500016 48
500018 58
500020 4348
"""


# https://stepik.org/lesson/2350067/step/2?unit=2385488
"""
https://kompege.ru/task
12477 PRO100 ЕГЭ 29.12.23 (Уровень: Средний)

Среди натуральных чисел, не превышающих 107, найдите все простые числа, соответствующие маске 3?1111*.
В ответе запишите все найденные числа в порядке возрастания.
"""
from fnmatch import *
for n in range(301111, 4000000):
    if fnmatch(str(n), '3?1111*'):
        if all(n % i for i in range(2, int(n**0.5 + 1))):
            print(n)
"""
311111
361111
3011117
3011119
3311117
3611119
3811117
3911111
"""


"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""







"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""