""" Task 25 """
"""
315 1867 3376 4335 8960 11249 12477 17536 17642
"""
"""
Есть на вариантах экзаменов
23207 31519
"""


# https://stepik.org/edit-lesson/2350067/step/2
"""
https://stepik.org/lesson/1228669/step/3?unit=1242202
https://kompege.ru/task
1867 Основная волна 2021 (Уровень: Базовый)
Найдите 5 чисел больших 500000, таких, что среди их делителей есть число, оканчивающееся на 8, при этом этот делитель не равен 8 и самому числу. 
В качестве ответа приведите 5 наименьших чисел, соответствующих условию.
Формат вывода: для каждого из 5 таких найденных чисел в отдельной строке сначала выводится само число, затем минимальный делитель, оканчивающийся на 8, не равный 8 и самому числу.
"""
def dv(n):
    r = set()
    for i in range(18, int(n**0.5 + 1)):  # ✅ от 18-ти !!!
        if not n % i:
            r |= {i, n // i}
    r = [i for i in r if i % 10 == 8]
    return min(r, default=0)

c = 5
for n in range(500000, 10**10):
    d = dv(n)
    if d:
        print(n, d)
        c -= 1
    if not c:
        break
"""
500002 178
500004 18
500016 48
500018 58
500020 4348
"""


# https://stepik.org/edit-lesson/2350067/step/3
"""
https://kompege.ru/task
12477 PRO100 ЕГЭ 29.12.23 (Уровень: Средний)
Среди натуральных чисел, не превышающих 107, найдите все простые числа, соответствующие маске 3?1111*.
В ответе запишите все найденные числа в порядке возрастания.
"""
from fnmatch import *
for n in range(301111, 4000000):
    if fnmatch(str(n), '3?1111*'):
        if all(n % i for i in range(2, int(n**0.5 + 1))):
            print(n)
"""
311111
361111
3011117
3011119
3311117
3611119
3811117
3911111
"""




"""
https://kompege.ru/task
315 Джобс 28.09.2020(Уровень: Средний)
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [326496; 649632], числа, у которых количество четных делителей равно количеству нечетных делителей (без учета единицы и самого числа). При этом в каждой из таких групп делителей не менее 70 элементов. 
Для каждого найденного числа запишите само число и минимальный делитель, больший 1000. 
Например:
для числа 2018 имеем следующие делители 2 и 1009. Поэтому результатом (не принимая во внимание количества делителей) будет пара чисел
2018 1009
"""
def dv(n):
    r = set()
    for i in range(1, int(n**0.5 + 1)):
        if not n % i:
            r |= {i, n // i}
    return r

for n in range(326496, 649632):
    d = dv(n)
    if len(d) >= 140 and not len(d) % 2:
        a = b = 0
        for i in d:
            if i % 2:
                b += 1
            else:
                a += 1
        if a == b:
            print(n, min(i for i in d if i > 1000))
"""
450450 1001
589050 1050
630630 1001
"""


# https://stepik.org/lesson/2350067/step/5?unit=2385488
"""
https://kompege.ru/task
3376 Джобс 22.04.2022 (Уровень: Базовый)
Среди натуральных чисел, не превышающих 10**9, найдите все числа, соответствующие маске 1*5*9, 
значения разрядов в которых идут в строго возрастающем порядке, и делящиеся на 21 без остатка. 
В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, 
а во втором столбце — соответствующие им частные от деления на 21.
"""
from fnmatch import *
for n in range(0, 123456790, 21):
    if fnmatch(str(n), '1*5*9'):
        if all(a < b for a, b in zip(str(n), str(n)[1:])):
            print(n, n//21)
"""
12579 599
123459 5879
134589 6409
1234569 58789
1356789 64609
"""


# https://stepik.org/lesson/2350067/step/6?unit=2385488
"""
https://kompege.ru/task
4335 Пробный 06.2022 /dev/inf advanced(Уровень: Базовый)
Напишите программу, которая перебирает целые числа, большие 960 000, в порядке возрастания и ищет среди них такие, 
у которых есть хотя бы три простых делителя, соответствующих маске *3? и не равных самому числу.
Вывести первые пять найденных чисел и для каждого сумму всех простых делителей, соответствующих маске *3? и не равных самому числу.
Формат вывода: для каждого из пяти таких найденных чисел в отдельной строке сначала выводится само число, 
затем – значение суммы делителей, соответствующих условию. Строки выводятся в порядке возрастания найденных чисел.
"""
def dv(n):
    r = set()
    for i in range(2, int(n**0.5 + 1)):
        if not n % i:
            r |= {i, n//i}
    return r

def prime(n):
    return all(n % i for i in range(2, int(n ** 0.5 + 1)))

c = 5
for n in range(960_000, 10**6):
    d = dv(n)
    simple = [i for i in d if prime(i) and i // 10 % 10 == 3]
    if len(simple) >= 3:
        print(n, sum(simple))
        c -= 1
    if not c:
        break
"""
960063 119
960066 799
960102 389
960219 299
960227 609
"""


# https://stepik.org/lesson/2350067/step/7?unit=2385488
"""
https://kompege.ru/task
5736 (Уровень: Средний)
Программа перебирает числа больше 10**9 и выбирает из них числа-палиндромы, 
у которых наибольший делитель (отличный от 1 и самого числа) кратен 7. 
Выведите первые 5 чисел, которые выберет программа, и для каждого числа (через пробел)  выведите наибольший делитель.
"""
def dv(n):
    r = set()
    for i in range(2, int(n**0.5 + 1)):
        if not n % i:
            r |= {i, n // i}
    return max(r)

c = 5
for n in range(10**9 + 1, 10**10):
    if str(n) == str(n)[::-1]:
        r = dv(n)
        if not r % 7:
            c -= 1
            print(n, r)
        if not c:
            break
"""
1001771001 333923667
1002002001 334000667
1003003001 143286143
1004774001 334924667
1005005001 335001667
"""



# https://stepik.org/lesson/2350067/step/8?unit=2385488
"""
https://kompege.ru/task
8960 Джобс 02.06.2023(Уровень: Базовый)

Найдите первые пять чисел, больших 500 000, сумма делителей которых соответствует маске *7?. 
Найденные числа выведите в порядке возрастания, справа от каждого запишите найденную сумму делителей.
"""
from fnmatch import *
def dv(n):
    r = set()
    for i in range(1, int(n**0.5 + 1)):
        if not n % i:
            r |= {i, n//i}
    return sum(r)

c = 5
for n in range(500_000, 10**10):
    d = dv(n)
    if fnmatch(str(d), '*7?'):
        print(n, d)
        c -= 1
    if not c:
        break
"""
500001 666672
500048 968874
500069 500070
500079 666776
500114 750174
"""


# https://stepik.org/lesson/2350067/step/9?unit=2385488
"""
https://kompege.ru/task
11249 (Уровень: Базовый)
Среди натуральных чисел, не превышающих 10**10, найдите все числа, соответствующие маске 7*61*331, делящиеся на 9627 без остатка.
В ответе запишите в первом столбце таблицы все найденные числа в порядке возрастания, 
а во втором столбце – соответствующие им результаты деления этих чисел на 9627.
"""
# ✅ Без fnmatch ✅
for n in range(0, 8 * 10**9, 9627):
    s = str(n)
    if s[0] == '7' and '61' in s[1:-3] and s[-3:] == '331':
        print(n, n // 9627)

from fnmatch import *
for n in range(0, 8 * 10**9, 9627):
    if fnmatch(str(n), '7*61*331'):
        print(n, n // 9627)
"""
706169331 73353
7069616331 734353
7406561331 769353
7416188331 770353
7618355331 791353
7676117331 797353
"""



# https://stepik.org/lesson/2350067/step/10?unit=2385488
"""
https://kompege.ru/task
12477 PRO100 ЕГЭ 29.12.23(Уровень: Средний)
Среди натуральных чисел, не превышающих 107, найдите все простые числа, соответствующие маске 3?1111*.
В ответе запишите все найденные числа в порядке возрастания.
"""
from fnmatch import *
for n in range(301111, 4_000_000):
    if fnmatch(str(n), '3?1111*'):
        if all(n % i for i in range(2, int(n**0.5 + 1))):
            print(n)
"""
311111
361111
3011117
3011119
3311117
3611119
3811117
3911111
"""


# https://stepik.org/lesson/2350067/step/11?unit=2385488
"""
https://kompege.ru/task
17536 Основная волна 07.06.24 (Уровень: Средний)

Пусть М — сумма минимального и максимального натуральных делителей целого числа, не считая единицы и самого числа. 
Если таких делителей у числа нет, то значение М считается равным нулю.
Напишите программу, которая перебирает целые числа, большие 800 000, в порядке возрастания и ищет среди них такие, 
для которых значение М оканчивается на 4.
В ответе запишите в первом столбце таблицы первые пять найденных чисел в порядке возрастания, 
а во втором столбце - соответствующие им значения M.
"""
def f(n):
    r = set()
    for i in range(2, int(n**0.5 + 1)):
        if not n % i:
            r |= {i, n // i}
    return sorted(r)

c = 5
for n in range(800_001, 10**10):
    d = f(n)
    if d:
        m = d[0] + d[-1]
        if m % 10 == 4:
            print(n, m)
            c -= 1
    if not c:
        break
"""
800004 400004
800009 114294
800013 266674
800024 400014
800033 61554
"""



# https://stepik.org/lesson/2350067/step/12?unit=2385488
"""
https://kompege.ru/task
17642 Основная волна 19.06.24 (Уровень: Базовый)
Напишите программу, которая перебирает целые числа, большие 800000, в порядке возрастания и ищет среди них такие, 
у которых есть натуральный делитель, оканчивающийся на цифру 9 и не равный ни самому числу, ни числу 9. 
В ответе запишите в первом столбце таблицы первые пять найденных чисел в порядке возрастания, 
а во втором столбце — соответствующий минимальный делитель для каждого числа, 
оканчивающийся цифрой 9, не равный ни самому числу, ни числу 9.
"""
def dv(n):
    r = set()
    for i in range(10, int(n**0.5 + 1)):
        if not n % i:
            r |= {i, n //i}
    return [i for i in r if i % 10 == 9]

c = 5
for n in range(800001, 10**10):
    d = dv(n)
    if d:
        print(n, min(d))
        c -= 1
    if not c:
        break
"""
800001 309
800003 47059
800004 409
800006 269
800007 39
"""





#
"""
https://kompege.ru/task
Ссылка на источник

Условие задачи
"""

"""Взято на мой курс"""