""" Task 26_01 """

"""
225 10107 1395 12256 17643 17881 23259 23283 2613 4205(7274) 4604 
"""
"""
Есть на вариантах экзаменов
31520
"""


# https://stepik.org/lesson/1994816/step/1?unit=2022866
"""
https://kompege.ru/task
4604 Основная волна 2022 (Уровень: Базовый)
В магазине для упаковки подарков есть N кубических коробок. Самой интересной считается упаковка подарка по принципу матрёшки – подарок упаковывается в одну из коробок, 
та в свою очередь в другую коробку и т.д. Одну коробку можно поместить в другую, если длина её стороны хотя бы на 3 единицы меньше длины стороны другой коробки. 
Определите наибольшее количество коробок, которое можно использовать для упаковки одного подарка, и максимально возможную длину стороны самой маленькой коробки, 
где будет находиться подарок. Размер подарка позволяет поместить его в самую маленькую коробку.
Входные данные
В первой строке входного файла находится число N – количество коробок в магазине (натуральное число, не превышающее 10 000). 
В следующих N строках находятся значения длин сторон коробок (все числа натуральные, не превышающие 10 000), каждое – в отдельной строке.
Запишите в ответе два целых числа: сначала наибольшее количество коробок, которое можно использовать для упаковки одного подарка, 
затем максимально возможную длину стороны самой маленькой коробки в таком наборе.
2767 51
"""
with open('26/26_01.txt') as fl:
    n_box = int(fl.readline())
    data = [*map(int, fl.readlines())]
    data.sort(reverse=True)
    cur_box = data[0]
    cnt = 1
    for i in range(1, n_box):
        if cur_box - data[i] >=3:
            cnt += 1
            cur_box = data[i]
    print(cnt, cur_box)  # 2767 51



# https://stepik.org/lesson/1994816/step/2?unit=2022866
"""
https://kompege.ru/task
225 Джобс 14.09.2020 (Уровень: Базовый)
Системный администратор раз в неделю создаёт архив пользовательских файлов. 
Однако объём диска, куда он помещает архив, может быть меньше, чем суммарный объём архивируемых файлов.
Известно, какой объём занимает файл каждого пользователя. Системный администратор старается сохранить файлы как можно большего размера. 
При этом используя выделенную память максимально эффективно – сохраняя файлы меньшего размера, если файлы большего не могут быть сохранены.
Входные данные.
В первой строке входного файла находятся два числа: S – размер свободного места на диске (натуральное число, не превышающее 1 000 000) и 
N – количество пользователей (натуральное число, не превышающее 10 000). 
В следующих N строках находятся значения объёмов файлов каждого пользователя (все числа натуральные, не превышающие 1000), каждое в отдельной строке.
Запишите в ответе два числа: сначала число сохраненных файлов, затем размер наименьшего сохраненного файла.
"""
f = open('26/26_02.txt').readlines()
M, N = map(int, f[0].split())
d = [*map(int, f[1:])]
d.sort(reverse=True)
sm = d[0]  # сумма файлов
c = idx = 1
for i in range(1, N):
    if d[i] + sm <= M:
        sm += d[i]
        c += 1
    else:
        # print(c, d[i])  # Случай, если меньший файл так и не будет найден.
        idx = i
        break
for i in range(idx, N):  # ищем файл на оставшееся место
    if sm + d[i] <= M:
        print(c + 1, d[i])  # 1054 732  Файл нашелся
        break



# https://stepik.org/lesson/1994816/step/3?unit=2022866
"""
https://kompege.ru/task
Ссылка на источник
На грузовом судне необходимо перевезти контейнеры, имеющие одинаковый габарит и разные массы. Общая масса всех контейнеров превышает грузоподъёмность судна. 
Количество грузовых мест на судне не меньше количества контейнеров, назначенных к перевозке. 
Определите минимальное количество контейнеров, которое может остаться после погрузки, и их наибольшую возможную суммарную массу.
Входные данные.
В первой строке входного файла находятся два числа: S – грузоподъёмность судна (натуральное число, не превышающее 100 000) и 
N – количество контейнеров (натуральное число, не превышающее 10 000). 
В следующих N строках находятся значения масс контейнеров, требующих транспортировки (все числа натуральные, не превышающие 100), каждое в отдельной строке.
Выходные данные.
Два целых неотрицательных числа: минимальное количество контейнеров, которое может остаться после погрузки, и их наибольшая возможная суммарная масса.
"""
# 7655 542450
f = open('26/26_03.txt').readlines()
s, n = map(int, f[0].split())
d = [*map(int, f[1:])]
d.sort()
idx = sm = 0
for i in range(n):
    if sm + d[i] <= s:
        sm += d[i]
        idx = i
    else:
        break
a = n - idx - 1
b = sum(d[idx + 1:])
print(a, b)  # 7655 542450




# https://stepik.org/lesson/1994816/step/4?unit=2022866
"""
https://kompege.ru/task
# 2613 (Уровень: Базовый)
Организация купила для своих сотрудников все места в нескольких подряд идущих рядах на концертной площадке. 
Известно, какие места уже распределены между сотрудниками. Найдите ряд с наибольшим номером, 
в котором наибольшее количеством подряд идущих мест, таких что все они уже распределены (заняты). 
В ответе запишите два целых числа: номер ряда и наибольшее количество подряд занятых мест.

Входные данные представлены в файле следующим образом. В первой строке входного файла находится одно число: 
N – количество занятых мест (натуральное число, не превышающее 10 000). 
В следующих N строках находятся пары чисел: ряд и место выкупленного билета, не превышающие 100000. 
В ответе запишите два целых числа: номер ряда и наибольшее количество подряд занятых мест.
"""
# 2613 (Уровень: Базовый)
f = open('26/26_04.txt').readlines()
d = dict()  # in - входные данные
for i in f[1:]:
    k, v = map(int, i.split())  # ряд, место
    d.setdefault(k, [])
    d[k] += [v]
res = []  # out - выходные данные
for r, s in d.items():
    s.sort()
    mx = 0
    c = 1
    for a, b in zip(s, s[1:]):
        if b - a == 1:
            c += 1
            mx = max(mx, c)
        else:
            c = 1
    res.append([mx, r])
res.sort(reverse=True)
seat, row = res[0]
print(row, seat)  # 99 14



# https://stepik.org/lesson/1994816/step/5?unit=2022866
"""
https://kompege.ru/task
4205 Открытый вариант 2022 (Уровень: Базовый)
7274 OpenFIPI (Уровень: Базовый)
В лесничестве саженцы сосны высадили параллельными рядами, которые пронумерованы идущими подряд натуральными числами. 
Растения в каждом ряду пронумерованы натуральными числами начиная с единицы.
По данным аэрофотосъёмки известно, в каких рядах и на каких местах растения не прижились. 
Найдите ряд с наибольшим номером, в котором есть ровно 13 идущих подряд свободных мест для посадки новых сосен, таких, 
что непосредственно слева и справа от них в том же ряду растут сосны. Гарантируется, что есть хотя бы один ряд, удовлетворяющий этому условию. 
В ответе запишите два целых числа: 
наибольший номер ряда и наименьший номер места для посадки из числа найденных в этом ряду подходящих последовательностей из 13 свободных мест.

Входные данные:
В первой строке входного файла находится число N – количество прижившихся саженцев сосны (натуральное число, не превышающее 20 000). 
Каждая из следующих N строк содержит два натуральных числа, не превышающих 100 000: номер ряда и номер места в этом ряду, на котором растёт деревце.

Выходные данные:
Два целых неотрицательных числа: наибольший номер ряда и наименьший номер места в выбранной последовательности из 13 мест, подходящих для посадки новых сосен.
"""
f = open('26/26_05.txt').readlines()
d = dict()
for row in f[1:]:
    k, v = map(int, row.split()) # ряд / место
    d.setdefault(k, [])
    d[k] += [v]
res = sorted([(k, v) for k, v in d.items()], reverse=True)
for r, v in res:
    v.sort()
    if len(v) > 1:
        for a, b in zip(v, v[1:]):
            if b - a == 14:
                print(r, a+1)  # 59966 50449
                exit()



# Ссылка на мой урок
"""
https://kompege.ru/task
23259 Основная волна 11.06.25(Уровень: Базовый)
Условие задачи
"""
#  23259 Основная волна 11.06.25(Уровень: Базовый)
# Логика: в самые грузоподъемные саноки сажаем первый, из возможной по массе, экипаж.
f = open('26/26_06.txt')
N, M = map(int, next(f).split())  # кол-во экипажей(crew) / санок(sled)
d = [*map(int, f)]  # массы экипажей + грузоподъемность санок
crew = sorted(d[:N], reverse=True)  # массы экипажей (в граммах)
sled = sorted(d[N:], reverse=True)  # максимально допустимая масса экипажа для конкретных санок
idx = 0
res_sled = []
for el in sled:
    for i in range(idx, N):
        if crew[i] <= el:
            res_sled.append(el)
            idx = i + 1
            break
print(len(res_sled), end = ' ')  # 800
max_sled = sled[0]
for i in crew:
    if i <= max_sled:
        print(i)  # 450466
        break
# 800 450466




# Ссылка на мой урок
"""
https://kompege.ru/task
23283 Основная волна 11.06.25 (Уровень: Базовый)
https://vkvideo.ru/video-205865487_456240488?t=1h26m3s&ref_domain=kompege.ru
Условие задачи
"""
f = open('26/26_07.txt')
windows, user = int(f.readline()), int(f.readline())  # кол-во окон / граждан
time = [tuple(map(int, i.split())) for i in f]  # время начала / время окончания приёма (в минутах)
time.sort()
win = [0] * windows
cnt = last = 0
for st, en in time:
    for i in range(windows):  # каждый раз пробегаемся по всем окнам
        if win[i] < st:  #  '<'  со следующей минуты после завершения приёма предыдущего
            win[i] = en
            cnt += 1
            last = i
            break
print(cnt, last + 1)  # 793 2 (+ 1: места (окна) пронумерованы начиная с 1)



# Ссылка на мой урок
"""
https://kompege.ru/task
17881 Демоверсия 2025 (Уровень: Базовый)
Условие задачи
"""
from statistics import mean
f = open('26/26_08.txt')
N = int(next(f))  # кол-во студентов
data = [[*map(int, i.split())] for i in f]
data = [(i[0], mean(i[1:]), i[1:].count(2)) for i in data]  # id / сред.балл /  наличие двоек
vin = [i for i in data if not i[2]]   # Без двоек
d2 = sorted(i for i in data if i[2]==3)  # получили по 3 двойки (по условию задачи мы ищем только ID, а не место в общем списке)
vin.sort(key=lambda x: (-x[1], x[0]))
idx = N // 4 - 1  # -1 ✅ т.к индекс начинается с нуля
print(vin[idx][0], d2[0][0])  # 52326 635


# Ссылка на мой урок
"""
https://kompege.ru/task
12256 ЕГКР 16.12.13_(23) (Уровень: Базовый)
Условие задачи
"""
f = open('26/26_09.txt')
M, N = map(int, next(f).split())
D = sorted(map(int, f))
cnt = m = 0
for i in range(N):
    if m + D[i] <= M:
        cnt += 1
        m += D[i]
    else:
        m -= D[i-1]
        break
for el in D[::-1]:  # ищем самую тяжёлую посылку
    if m + el <= M:
        print(cnt, el)  # 629 50
        break
# вариант без переворота списка
# for i in range(N-1, -1, -1):
#     if m + D[i] <= M:
#         print(cnt, D[i])  # 629 50
#         break



# Ссылка на мой урок
"""
https://kompege.ru/task
10107 Демоверсия 2024 (Уровень: Средний)
Условие задачи
"""
f = open('26/26_10.txt')
next(f)
d = [[*map(int, i.split())] for i in f]
d.sort(key=lambda x: x[1])  # сортируем по возрастанию времени окончания.
res = [d[0]]  # проведение мероприятий
for i in d:
    st, en = i
    if st >= res[-1][1]:
        res.append(i)
# ищем самое позднее время начала последнего мероприятия от окончания предпоследнего мероприятия (т.е. макс. перерыв)
for i in d[::-1]:
    if res[-2][1] <= i[0]:
        print(len(res), i[0] - res[-2][1])  # 32 15
        break



# Ссылка на мой урок
"""
https://kompege.ru/task
17643 Основная волна 19.06.24 (Уровень: Базовый)
Условие задачи
"""
from statistics import mean
f = open('26/26_11.txt')
next(f)
data = [[*map(int, i.split())] for i in f]  # артикул / цена / статус(0-продан/1-не продан)
avr = mean(i[1] for i in data)
expensive = [i for i in data if i[1] > avr]
d_exp = dict()  # артикул: [цена,0,0] цена / кол-во продан / не продан
for art, price, stat in expensive:
    d_exp.setdefault(art, [price, 0, 0])
    d_exp[art][1] += not stat  # продан (прилетел статус 0)
    d_exp[art][2] += stat # если продан (прилетел статус 1)
res = [[k] + [*v] for k, v in d_exp.items()] # артикул / цена / кол-во: продан / не продан
res.sort(key=lambda x: (-x[2], -x[1], x[3]))
_, price, cnt, remainder = res[0]
print(price * cnt, remainder)  # 43656 36




# Ссылка на мой урок
"""
https://kompege.ru/task
Ссылка на источник
Условие задачи
"""

""" Взято на мой курс """

